adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/*

Copyright (c) 2010 - 2018, Nordic Semiconductor ASA

All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form, except as embedded into a Nordic
   Semiconductor ASA integrated circuit in a product or a software update for
   such product, must reproduce the above copyright notice, this list of
   conditions and the following disclaimer in the documentation and/or other
   materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

4. This software, with or without modification, must only be used with a
   Nordic Semiconductor ASA integrated circuit.

5. Any software provided in binary form under this license must not be reverse
   engineered, decompiled, modified and/or disassembled.

THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef __NRF9120_MLM1_MODEM_BITS_H
#define __NRF9120_MLM1_MODEM_BITS_H

/*lint ++flb "Enter library region" */

/* Peripheral: AESL2 */
/* Description: AES-128 HW accelerator for LTE L2 security and MAC */

/* Register: AESL2_TASKS_START_GATHER */
/* Description: Start input DMA */

/* Bit 0 : Start input DMA */
#define AESL2_TASKS_START_GATHER_TASKS_START_GATHER_Pos (0UL) /*!< Position of TASKS_START_GATHER field. */
#define AESL2_TASKS_START_GATHER_TASKS_START_GATHER_Msk (0x1UL << AESL2_TASKS_START_GATHER_TASKS_START_GATHER_Pos) /*!< Bit mask of TASKS_START_GATHER field. */
#define AESL2_TASKS_START_GATHER_TASKS_START_GATHER_Trigger (1UL) /*!< Trigger task */

/* Register: AESL2_TASKS_STOP_GATHER */
/* Description: Stop  input DMA */

/* Bit 0 : Stop  input DMA */
#define AESL2_TASKS_STOP_GATHER_TASKS_STOP_GATHER_Pos (0UL) /*!< Position of TASKS_STOP_GATHER field. */
#define AESL2_TASKS_STOP_GATHER_TASKS_STOP_GATHER_Msk (0x1UL << AESL2_TASKS_STOP_GATHER_TASKS_STOP_GATHER_Pos) /*!< Bit mask of TASKS_STOP_GATHER field. */
#define AESL2_TASKS_STOP_GATHER_TASKS_STOP_GATHER_Trigger (1UL) /*!< Trigger task */

/* Register: AESL2_TASKS_START_SCATTER */
/* Description: Start output DMA */

/* Bit 0 : Start output DMA */
#define AESL2_TASKS_START_SCATTER_TASKS_START_SCATTER_Pos (0UL) /*!< Position of TASKS_START_SCATTER field. */
#define AESL2_TASKS_START_SCATTER_TASKS_START_SCATTER_Msk (0x1UL << AESL2_TASKS_START_SCATTER_TASKS_START_SCATTER_Pos) /*!< Bit mask of TASKS_START_SCATTER field. */
#define AESL2_TASKS_START_SCATTER_TASKS_START_SCATTER_Trigger (1UL) /*!< Trigger task */

/* Register: AESL2_TASKS_STOP_SCATTER */
/* Description: Stop  output DMA */

/* Bit 0 : Stop  output DMA */
#define AESL2_TASKS_STOP_SCATTER_TASKS_STOP_SCATTER_Pos (0UL) /*!< Position of TASKS_STOP_SCATTER field. */
#define AESL2_TASKS_STOP_SCATTER_TASKS_STOP_SCATTER_Msk (0x1UL << AESL2_TASKS_STOP_SCATTER_TASKS_STOP_SCATTER_Pos) /*!< Bit mask of TASKS_STOP_SCATTER field. */
#define AESL2_TASKS_STOP_SCATTER_TASKS_STOP_SCATTER_Trigger (1UL) /*!< Trigger task */

/* Register: AESL2_TASKS_INITIALIZE_AES */
/* Description: New keys (and IV) ready to be used, reset keybytes, ivbytes */

/* Bit 0 : New keys (and IV) ready to be used, reset keybytes, ivbytes */
#define AESL2_TASKS_INITIALIZE_AES_TASKS_INITIALIZE_AES_Pos (0UL) /*!< Position of TASKS_INITIALIZE_AES field. */
#define AESL2_TASKS_INITIALIZE_AES_TASKS_INITIALIZE_AES_Msk (0x1UL << AESL2_TASKS_INITIALIZE_AES_TASKS_INITIALIZE_AES_Pos) /*!< Bit mask of TASKS_INITIALIZE_AES field. */
#define AESL2_TASKS_INITIALIZE_AES_TASKS_INITIALIZE_AES_Trigger (1UL) /*!< Trigger task */

/* Register: AESL2_TASKS_START_OPERATION */
/* Description: Start cipher / MAC calculation depending on MODE */

/* Bit 0 : Start cipher / MAC calculation depending on MODE */
#define AESL2_TASKS_START_OPERATION_TASKS_START_OPERATION_Pos (0UL) /*!< Position of TASKS_START_OPERATION field. */
#define AESL2_TASKS_START_OPERATION_TASKS_START_OPERATION_Msk (0x1UL << AESL2_TASKS_START_OPERATION_TASKS_START_OPERATION_Pos) /*!< Bit mask of TASKS_START_OPERATION field. */
#define AESL2_TASKS_START_OPERATION_TASKS_START_OPERATION_Trigger (1UL) /*!< Trigger task */

/* Register: AESL2_TASKS_FINALIZE_MAC */
/* Description: Finalize MAC calculation */

/* Bit 0 : Finalize MAC calculation */
#define AESL2_TASKS_FINALIZE_MAC_TASKS_FINALIZE_MAC_Pos (0UL) /*!< Position of TASKS_FINALIZE_MAC field. */
#define AESL2_TASKS_FINALIZE_MAC_TASKS_FINALIZE_MAC_Msk (0x1UL << AESL2_TASKS_FINALIZE_MAC_TASKS_FINALIZE_MAC_Pos) /*!< Bit mask of TASKS_FINALIZE_MAC field. */
#define AESL2_TASKS_FINALIZE_MAC_TASKS_FINALIZE_MAC_Trigger (1UL) /*!< Trigger task */

/* Register: AESL2_TASKS_RESET */
/* Description: Stop all transfers and crypto operations (initialize) */

/* Bit 0 : Stop all transfers and crypto operations (initialize) */
#define AESL2_TASKS_RESET_TASKS_RESET_Pos (0UL) /*!< Position of TASKS_RESET field. */
#define AESL2_TASKS_RESET_TASKS_RESET_Msk (0x1UL << AESL2_TASKS_RESET_TASKS_RESET_Pos) /*!< Bit mask of TASKS_RESET field. */
#define AESL2_TASKS_RESET_TASKS_RESET_Trigger (1UL) /*!< Trigger task */

/* Register: AESL2_TaskZeroPenalty_PCP_1 */
/* Description: TaskZeroPenalty register for PCP 1 */

