adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 0 :   */
#define AESL2_TaskZeroPenalty_PCP_1_ZERO_PENALTY_Pos (0UL) /*!< Position of ZERO_PENALTY field. */
#define AESL2_TaskZeroPenalty_PCP_1_ZERO_PENALTY_Msk (0x1UL << AESL2_TaskZeroPenalty_PCP_1_ZERO_PENALTY_Pos) /*!< Bit mask of ZERO_PENALTY field. */
#define AESL2_TaskZeroPenalty_PCP_1_ZERO_PENALTY_SET_ZERO_PENALTY (1UL) /*!< Set Zero Penalty */

/* Register: AESL2_TaskFullPenalty_PCP_1 */
/* Description: TaskFullPenalty register for PCP 1 */

/* Bit 0 :   */
#define AESL2_TaskFullPenalty_PCP_1_FULL_PENALTY_Pos (0UL) /*!< Position of FULL_PENALTY field. */
#define AESL2_TaskFullPenalty_PCP_1_FULL_PENALTY_Msk (0x1UL << AESL2_TaskFullPenalty_PCP_1_FULL_PENALTY_Pos) /*!< Bit mask of FULL_PENALTY field. */
#define AESL2_TaskFullPenalty_PCP_1_FULL_PENALTY_SET_FULL_PENALTY (1UL) /*!< Set Full Penalty */

/* Register: AESL2_TaskZeroPenalty_PCP_0 */
/* Description: TaskZeroPenalty register for PCP 0 */

/* Bit 0 :   */
#define AESL2_TaskZeroPenalty_PCP_0_ZERO_PENALTY_Pos (0UL) /*!< Position of ZERO_PENALTY field. */
#define AESL2_TaskZeroPenalty_PCP_0_ZERO_PENALTY_Msk (0x1UL << AESL2_TaskZeroPenalty_PCP_0_ZERO_PENALTY_Pos) /*!< Bit mask of ZERO_PENALTY field. */
#define AESL2_TaskZeroPenalty_PCP_0_ZERO_PENALTY_SET_ZERO_PENALTY (1UL) /*!< Set Zero Penalty */

/* Register: AESL2_TaskFullPenalty_PCP_0 */
/* Description: TaskFullPenalty register for PCP 0 */

/* Bit 0 :   */
#define AESL2_TaskFullPenalty_PCP_0_FULL_PENALTY_Pos (0UL) /*!< Position of FULL_PENALTY field. */
#define AESL2_TaskFullPenalty_PCP_0_FULL_PENALTY_Msk (0x1UL << AESL2_TaskFullPenalty_PCP_0_FULL_PENALTY_Pos) /*!< Bit mask of FULL_PENALTY field. */
#define AESL2_TaskFullPenalty_PCP_0_FULL_PENALTY_SET_FULL_PENALTY (1UL) /*!< Set Full Penalty */

/* Register: AESL2_EVENTS_GATHER_STARTED */
/* Description: Input DMA started */

/* Bit 0 : Input DMA started */
#define AESL2_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Pos (0UL) /*!< Position of EVENTS_GATHER_STARTED field. */
#define AESL2_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Msk (0x1UL << AESL2_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Pos) /*!< Bit mask of EVENTS_GATHER_STARTED field. */
#define AESL2_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_NotGenerated (0UL) /*!< Event not generated */
#define AESL2_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Generated (1UL) /*!< Event generated */

/* Register: AESL2_EVENTS_GATHER_DONE */
/* Description: Input DMA done */

/* Bit 0 : Input DMA done */
#define AESL2_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Pos (0UL) /*!< Position of EVENTS_GATHER_DONE field. */
#define AESL2_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Msk (0x1UL << AESL2_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Pos) /*!< Bit mask of EVENTS_GATHER_DONE field. */
#define AESL2_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_NotGenerated (0UL) /*!< Event not generated */
#define AESL2_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Generated (1UL) /*!< Event generated */

/* Register: AESL2_EVENTS_SCATTER_STARTED */
/* Description: Output DMA started */

/* Bit 0 : Output DMA started */
#define AESL2_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_Pos (0UL) /*!< Position of EVENTS_SCATTER_STARTED field. */
#define AESL2_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_Msk (0x1UL << AESL2_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_Pos) /*!< Bit mask of EVENTS_SCATTER_STARTED field. */
#define AESL2_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_NotGenerated (0UL) /*!< Event not generated */
#define AESL2_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_Generated (1UL) /*!< Event generated */

/* Register: AESL2_EVENTS_SCATTER_DONE */
/* Description: Output DMA done */

/* Bit 0 : Output DMA done */
#define AESL2_EVENTS_SCATTER_DONE_EVENTS_SCATTER_DONE_Pos (0UL) /*!< Position of EVENTS_SCATTER_DONE field. */
#define AESL2_EVENTS_SCATTER_DONE_EVENTS_SCATTER_DONE_Msk (0x1UL << AESL2_EVENTS_SCATTER_DONE_EVENTS_SCATTER_DONE_Pos) /*!< Bit mask of EVENTS_SCATTER_DONE field. */
#define AESL2_EVENTS_SCATTER_DONE_EVENTS_SCATTER_DONE_NotGenerated (0UL) /*!< Event not generated */
#define AESL2_EVENTS_SCATTER_DONE_EVENTS_SCATTER_DONE_Generated (1UL) /*!< Event generated */

/* Register: AESL2_EVENTS_IV_READY */
/* Description: IV received (ivbytes == 16) */

/* Bit 0 : IV received (ivbytes == 16) */
#define AESL2_EVENTS_IV_READY_EVENTS_IV_READY_Pos (0UL) /*!< Position of EVENTS_IV_READY field. */
#define AESL2_EVENTS_IV_READY_EVENTS_IV_READY_Msk (0x1UL << AESL2_EVENTS_IV_READY_EVENTS_IV_READY_Pos) /*!< Bit mask of EVENTS_IV_READY field. */
#define AESL2_EVENTS_IV_READY_EVENTS_IV_READY_NotGenerated (0UL) /*!< Event not generated */
#define AESL2_EVENTS_IV_READY_EVENTS_IV_READY_Generated (1UL) /*!< Event generated */

/* Register: AESL2_EVENTS_AES_INITIALIZED */
/* Description: New keys and IV taken into use */

/* Bit 0 : New keys and IV taken into use */
#define AESL2_EVENTS_AES_INITIALIZED_EVENTS_AES_INITIALIZED_Pos (0UL) /*!< Position of EVENTS_AES_INITIALIZED field. */
#define AESL2_EVENTS_AES_INITIALIZED_EVENTS_AES_INITIALIZED_Msk (0x1UL << AESL2_EVENTS_AES_INITIALIZED_EVENTS_AES_INITIALIZED_Pos) /*!< Bit mask of EVENTS_AES_INITIALIZED field. */
#define AESL2_EVENTS_AES_INITIALIZED_EVENTS_AES_INITIALIZED_NotGenerated (0UL) /*!< Event not generated */
#define AESL2_EVENTS_AES_INITIALIZED_EVENTS_AES_INITIALIZED_Generated (1UL) /*!< Event generated */

/* Register: AESL2_EVENTS_MESSAGE_READY */
/* Description: LENGTH == 0 */

/* Bit 0 : LENGTH == 0 */
#define AESL2_EVENTS_MESSAGE_READY_EVENTS_MESSAGE_READY_Pos (0UL) /*!< Position of EVENTS_MESSAGE_READY field. */
#define AESL2_EVENTS_MESSAGE_READY_EVENTS_MESSAGE_READY_Msk (0x1UL << AESL2_EVENTS_MESSAGE_READY_EVENTS_MESSAGE_READY_Pos) /*!< Bit mask of EVENTS_MESSAGE_READY field. */
#define AESL2_EVENTS_MESSAGE_READY_EVENTS_MESSAGE_READY_NotGenerated (0UL) /*!< Event not generated */
#define AESL2_EVENTS_MESSAGE_READY_EVENTS_MESSAGE_READY_Generated (1UL) /*!< Event generated */

/* Register: AESL2_EVENTS_MAC_READY */
/* Description: MAC calculated */

/* Bit 0 : MAC calculated */
#define AESL2_EVENTS_MAC_READY_EVENTS_MAC_READY_Pos (0UL) /*!< Position of EVENTS_MAC_READY field. */
#define AESL2_EVENTS_MAC_READY_EVENTS_MAC_READY_Msk (0x1UL << AESL2_EVENTS_MAC_READY_EVENTS_MAC_READY_Pos) /*!< Bit mask of EVENTS_MAC_READY field. */
#define AESL2_EVENTS_MAC_READY_EVENTS_MAC_READY_NotGenerated (0UL) /*!< Event not generated */
#define AESL2_EVENTS_MAC_READY_EVENTS_MAC_READY_Generated (1UL) /*!< Event generated */

