adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 5 : Write '1' to enable interrupt for event AES_INITIALIZED */
#define AESL2_INTENSET_AES_INITIALIZED_Pos (5UL) /*!< Position of AES_INITIALIZED field. */
#define AESL2_INTENSET_AES_INITIALIZED_Msk (0x1UL << AESL2_INTENSET_AES_INITIALIZED_Pos) /*!< Bit mask of AES_INITIALIZED field. */
#define AESL2_INTENSET_AES_INITIALIZED_Disabled (0UL) /*!< Read: Disabled */
#define AESL2_INTENSET_AES_INITIALIZED_Enabled (1UL) /*!< Read: Enabled */
#define AESL2_INTENSET_AES_INITIALIZED_Set (1UL) /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event IV_READY */
#define AESL2_INTENSET_IV_READY_Pos (4UL) /*!< Position of IV_READY field. */
#define AESL2_INTENSET_IV_READY_Msk (0x1UL << AESL2_INTENSET_IV_READY_Pos) /*!< Bit mask of IV_READY field. */
#define AESL2_INTENSET_IV_READY_Disabled (0UL) /*!< Read: Disabled */
#define AESL2_INTENSET_IV_READY_Enabled (1UL) /*!< Read: Enabled */
#define AESL2_INTENSET_IV_READY_Set (1UL) /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event SCATTER_DONE */
#define AESL2_INTENSET_SCATTER_DONE_Pos (3UL) /*!< Position of SCATTER_DONE field. */
#define AESL2_INTENSET_SCATTER_DONE_Msk (0x1UL << AESL2_INTENSET_SCATTER_DONE_Pos) /*!< Bit mask of SCATTER_DONE field. */
#define AESL2_INTENSET_SCATTER_DONE_Disabled (0UL) /*!< Read: Disabled */
#define AESL2_INTENSET_SCATTER_DONE_Enabled (1UL) /*!< Read: Enabled */
#define AESL2_INTENSET_SCATTER_DONE_Set (1UL) /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event SCATTER_STARTED */
#define AESL2_INTENSET_SCATTER_STARTED_Pos (2UL) /*!< Position of SCATTER_STARTED field. */
#define AESL2_INTENSET_SCATTER_STARTED_Msk (0x1UL << AESL2_INTENSET_SCATTER_STARTED_Pos) /*!< Bit mask of SCATTER_STARTED field. */
#define AESL2_INTENSET_SCATTER_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define AESL2_INTENSET_SCATTER_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define AESL2_INTENSET_SCATTER_STARTED_Set (1UL) /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event GATHER_DONE */
#define AESL2_INTENSET_GATHER_DONE_Pos (1UL) /*!< Position of GATHER_DONE field. */
#define AESL2_INTENSET_GATHER_DONE_Msk (0x1UL << AESL2_INTENSET_GATHER_DONE_Pos) /*!< Bit mask of GATHER_DONE field. */
#define AESL2_INTENSET_GATHER_DONE_Disabled (0UL) /*!< Read: Disabled */
#define AESL2_INTENSET_GATHER_DONE_Enabled (1UL) /*!< Read: Enabled */
#define AESL2_INTENSET_GATHER_DONE_Set (1UL) /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event GATHER_STARTED */
#define AESL2_INTENSET_GATHER_STARTED_Pos (0UL) /*!< Position of GATHER_STARTED field. */
#define AESL2_INTENSET_GATHER_STARTED_Msk (0x1UL << AESL2_INTENSET_GATHER_STARTED_Pos) /*!< Bit mask of GATHER_STARTED field. */
#define AESL2_INTENSET_GATHER_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define AESL2_INTENSET_GATHER_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define AESL2_INTENSET_GATHER_STARTED_Set (1UL) /*!< Enable */

/* Register: AESL2_INTENCLR */
/* Description: Disable interrupt */

/* Bit 8 : Write '1' to disable interrupt for event RESETTED */
#define AESL2_INTENCLR_RESETTED_Pos (8UL) /*!< Position of RESETTED field. */
#define AESL2_INTENCLR_RESETTED_Msk (0x1UL << AESL2_INTENCLR_RESETTED_Pos) /*!< Bit mask of RESETTED field. */
#define AESL2_INTENCLR_RESETTED_Disabled (0UL) /*!< Read: Disabled */
#define AESL2_INTENCLR_RESETTED_Enabled (1UL) /*!< Read: Enabled */
#define AESL2_INTENCLR_RESETTED_Clear (1UL) /*!< Disable */

/* Bit 7 : Write '1' to disable interrupt for event MAC_READY */
#define AESL2_INTENCLR_MAC_READY_Pos (7UL) /*!< Position of MAC_READY field. */
#define AESL2_INTENCLR_MAC_READY_Msk (0x1UL << AESL2_INTENCLR_MAC_READY_Pos) /*!< Bit mask of MAC_READY field. */
#define AESL2_INTENCLR_MAC_READY_Disabled (0UL) /*!< Read: Disabled */
#define AESL2_INTENCLR_MAC_READY_Enabled (1UL) /*!< Read: Enabled */
#define AESL2_INTENCLR_MAC_READY_Clear (1UL) /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event MESSAGE_READY */
#define AESL2_INTENCLR_MESSAGE_READY_Pos (6UL) /*!< Position of MESSAGE_READY field. */
#define AESL2_INTENCLR_MESSAGE_READY_Msk (0x1UL << AESL2_INTENCLR_MESSAGE_READY_Pos) /*!< Bit mask of MESSAGE_READY field. */
#define AESL2_INTENCLR_MESSAGE_READY_Disabled (0UL) /*!< Read: Disabled */
#define AESL2_INTENCLR_MESSAGE_READY_Enabled (1UL) /*!< Read: Enabled */
#define AESL2_INTENCLR_MESSAGE_READY_Clear (1UL) /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event AES_INITIALIZED */
#define AESL2_INTENCLR_AES_INITIALIZED_Pos (5UL) /*!< Position of AES_INITIALIZED field. */
#define AESL2_INTENCLR_AES_INITIALIZED_Msk (0x1UL << AESL2_INTENCLR_AES_INITIALIZED_Pos) /*!< Bit mask of AES_INITIALIZED field. */
#define AESL2_INTENCLR_AES_INITIALIZED_Disabled (0UL) /*!< Read: Disabled */
#define AESL2_INTENCLR_AES_INITIALIZED_Enabled (1UL) /*!< Read: Enabled */
#define AESL2_INTENCLR_AES_INITIALIZED_Clear (1UL) /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event IV_READY */
#define AESL2_INTENCLR_IV_READY_Pos (4UL) /*!< Position of IV_READY field. */
#define AESL2_INTENCLR_IV_READY_Msk (0x1UL << AESL2_INTENCLR_IV_READY_Pos) /*!< Bit mask of IV_READY field. */
#define AESL2_INTENCLR_IV_READY_Disabled (0UL) /*!< Read: Disabled */
#define AESL2_INTENCLR_IV_READY_Enabled (1UL) /*!< Read: Enabled */
#define AESL2_INTENCLR_IV_READY_Clear (1UL) /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event SCATTER_DONE */
#define AESL2_INTENCLR_SCATTER_DONE_Pos (3UL) /*!< Position of SCATTER_DONE field. */
#define AESL2_INTENCLR_SCATTER_DONE_Msk (0x1UL << AESL2_INTENCLR_SCATTER_DONE_Pos) /*!< Bit mask of SCATTER_DONE field. */
#define AESL2_INTENCLR_SCATTER_DONE_Disabled (0UL) /*!< Read: Disabled */
#define AESL2_INTENCLR_SCATTER_DONE_Enabled (1UL) /*!< Read: Enabled */
#define AESL2_INTENCLR_SCATTER_DONE_Clear (1UL) /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event SCATTER_STARTED */
#define AESL2_INTENCLR_SCATTER_STARTED_Pos (2UL) /*!< Position of SCATTER_STARTED field. */
#define AESL2_INTENCLR_SCATTER_STARTED_Msk (0x1UL << AESL2_INTENCLR_SCATTER_STARTED_Pos) /*!< Bit mask of SCATTER_STARTED field. */
#define AESL2_INTENCLR_SCATTER_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define AESL2_INTENCLR_SCATTER_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define AESL2_INTENCLR_SCATTER_STARTED_Clear (1UL) /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event GATHER_DONE */
#define AESL2_INTENCLR_GATHER_DONE_Pos (1UL) /*!< Position of GATHER_DONE field. */
#define AESL2_INTENCLR_GATHER_DONE_Msk (0x1UL << AESL2_INTENCLR_GATHER_DONE_Pos) /*!< Bit mask of GATHER_DONE field. */
#define AESL2_INTENCLR_GATHER_DONE_Disabled (0UL) /*!< Read: Disabled */
#define AESL2_INTENCLR_GATHER_DONE_Enabled (1UL) /*!< Read: Enabled */
#define AESL2_INTENCLR_GATHER_DONE_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event GATHER_STARTED */
#define AESL2_INTENCLR_GATHER_STARTED_Pos (0UL) /*!< Position of GATHER_STARTED field. */
#define AESL2_INTENCLR_GATHER_STARTED_Msk (0x1UL << AESL2_INTENCLR_GATHER_STARTED_Pos) /*!< Bit mask of GATHER_STARTED field. */
#define AESL2_INTENCLR_GATHER_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define AESL2_INTENCLR_GATHER_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define AESL2_INTENCLR_GATHER_STARTED_Clear (1UL) /*!< Disable */

/* Register: AESL2_INTPEND */
/* Description: Pending interrupts */

/* Bit 8 : Read pending status of interrupt for event RESETTED */
#define AESL2_INTPEND_RESETTED_Pos (8UL) /*!< Position of RESETTED field. */
#define AESL2_INTPEND_RESETTED_Msk (0x1UL << AESL2_INTPEND_RESETTED_Pos) /*!< Bit mask of RESETTED field. */
#define AESL2_INTPEND_RESETTED_NotPending (0UL) /*!< Read: Not pending */
#define AESL2_INTPEND_RESETTED_Pending (1UL) /*!< Read: Pending */

/* Bit 7 : Read pending status of interrupt for event MAC_READY */
#define AESL2_INTPEND_MAC_READY_Pos (7UL) /*!< Position of MAC_READY field. */
#define AESL2_INTPEND_MAC_READY_Msk (0x1UL << AESL2_INTPEND_MAC_READY_Pos) /*!< Bit mask of MAC_READY field. */
#define AESL2_INTPEND_MAC_READY_NotPending (0UL) /*!< Read: Not pending */
#define AESL2_INTPEND_MAC_READY_Pending (1UL) /*!< Read: Pending */

/* Bit 6 : Read pending status of interrupt for event MESSAGE_READY */
#define AESL2_INTPEND_MESSAGE_READY_Pos (6UL) /*!< Position of MESSAGE_READY field. */
#define AESL2_INTPEND_MESSAGE_READY_Msk (0x1UL << AESL2_INTPEND_MESSAGE_READY_Pos) /*!< Bit mask of MESSAGE_READY field. */
#define AESL2_INTPEND_MESSAGE_READY_NotPending (0UL) /*!< Read: Not pending */
#define AESL2_INTPEND_MESSAGE_READY_Pending (1UL) /*!< Read: Pending */

