adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 5 : Read pending status of interrupt for event AES_INITIALIZED */
#define AESL2_INTPEND_AES_INITIALIZED_Pos (5UL) /*!< Position of AES_INITIALIZED field. */
#define AESL2_INTPEND_AES_INITIALIZED_Msk (0x1UL << AESL2_INTPEND_AES_INITIALIZED_Pos) /*!< Bit mask of AES_INITIALIZED field. */
#define AESL2_INTPEND_AES_INITIALIZED_NotPending (0UL) /*!< Read: Not pending */
#define AESL2_INTPEND_AES_INITIALIZED_Pending (1UL) /*!< Read: Pending */

/* Bit 4 : Read pending status of interrupt for event IV_READY */
#define AESL2_INTPEND_IV_READY_Pos (4UL) /*!< Position of IV_READY field. */
#define AESL2_INTPEND_IV_READY_Msk (0x1UL << AESL2_INTPEND_IV_READY_Pos) /*!< Bit mask of IV_READY field. */
#define AESL2_INTPEND_IV_READY_NotPending (0UL) /*!< Read: Not pending */
#define AESL2_INTPEND_IV_READY_Pending (1UL) /*!< Read: Pending */

/* Bit 3 : Read pending status of interrupt for event SCATTER_DONE */
#define AESL2_INTPEND_SCATTER_DONE_Pos (3UL) /*!< Position of SCATTER_DONE field. */
#define AESL2_INTPEND_SCATTER_DONE_Msk (0x1UL << AESL2_INTPEND_SCATTER_DONE_Pos) /*!< Bit mask of SCATTER_DONE field. */
#define AESL2_INTPEND_SCATTER_DONE_NotPending (0UL) /*!< Read: Not pending */
#define AESL2_INTPEND_SCATTER_DONE_Pending (1UL) /*!< Read: Pending */

/* Bit 2 : Read pending status of interrupt for event SCATTER_STARTED */
#define AESL2_INTPEND_SCATTER_STARTED_Pos (2UL) /*!< Position of SCATTER_STARTED field. */
#define AESL2_INTPEND_SCATTER_STARTED_Msk (0x1UL << AESL2_INTPEND_SCATTER_STARTED_Pos) /*!< Bit mask of SCATTER_STARTED field. */
#define AESL2_INTPEND_SCATTER_STARTED_NotPending (0UL) /*!< Read: Not pending */
#define AESL2_INTPEND_SCATTER_STARTED_Pending (1UL) /*!< Read: Pending */

/* Bit 1 : Read pending status of interrupt for event GATHER_DONE */
#define AESL2_INTPEND_GATHER_DONE_Pos (1UL) /*!< Position of GATHER_DONE field. */
#define AESL2_INTPEND_GATHER_DONE_Msk (0x1UL << AESL2_INTPEND_GATHER_DONE_Pos) /*!< Bit mask of GATHER_DONE field. */
#define AESL2_INTPEND_GATHER_DONE_NotPending (0UL) /*!< Read: Not pending */
#define AESL2_INTPEND_GATHER_DONE_Pending (1UL) /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event GATHER_STARTED */
#define AESL2_INTPEND_GATHER_STARTED_Pos (0UL) /*!< Position of GATHER_STARTED field. */
#define AESL2_INTPEND_GATHER_STARTED_Msk (0x1UL << AESL2_INTPEND_GATHER_STARTED_Pos) /*!< Bit mask of GATHER_STARTED field. */
#define AESL2_INTPEND_GATHER_STARTED_NotPending (0UL) /*!< Read: Not pending */
#define AESL2_INTPEND_GATHER_STARTED_Pending (1UL) /*!< Read: Pending */

/* Register: AESL2_LENGTH */
/* Description: Keystream length in bits (Cipher), message length in bits (MAC) */

/* Bits 31..0 : LENGTH */
#define AESL2_LENGTH_LENGTH_Pos (0UL) /*!< Position of LENGTH field. */
#define AESL2_LENGTH_LENGTH_Msk (0xFFFFFFFFUL << AESL2_LENGTH_LENGTH_Pos) /*!< Bit mask of LENGTH field. */

/* Register: AESL2_MODE */
/* Description: Mode: 0 == Cipher, 1 == MAC */

/* Bit 0 : MODE */
#define AESL2_MODE_MODE_Pos (0UL) /*!< Position of MODE field. */
#define AESL2_MODE_MODE_Msk (0x1UL << AESL2_MODE_MODE_Pos) /*!< Bit mask of MODE field. */
#define AESL2_MODE_MODE_Cipher (0UL) /*!< Ciphering mode */
#define AESL2_MODE_MODE_MAC (1UL) /*!< CMAC mode */

/* Register: AESL2_MAC */
/* Description: EIA2 MAC */

/* Bits 31..0 : MAC */
#define AESL2_MAC_MAC_Pos (0UL) /*!< Position of MAC field. */
#define AESL2_MAC_MAC_Msk (0xFFFFFFFFUL << AESL2_MAC_MAC_Pos) /*!< Bit mask of MAC field. */

/* Register: AESL2_INJOBPTR */
/* Description: Input job pointer */

/* Bits 31..0 : INJOBPTR */
#define AESL2_INJOBPTR_INJOBPTR_Pos (0UL) /*!< Position of INJOBPTR field. */
#define AESL2_INJOBPTR_INJOBPTR_Msk (0xFFFFFFFFUL << AESL2_INJOBPTR_INJOBPTR_Pos) /*!< Bit mask of INJOBPTR field. */

/* Register: AESL2_OUTJOBPTR */
/* Description: Output job pointer */

/* Bits 31..0 : OUTJOBPTR */
#define AESL2_OUTJOBPTR_OUTJOBPTR_Pos (0UL) /*!< Position of OUTJOBPTR field. */
#define AESL2_OUTJOBPTR_OUTJOBPTR_Msk (0xFFFFFFFFUL << AESL2_OUTJOBPTR_OUTJOBPTR_Pos) /*!< Bit mask of OUTJOBPTR field. */

/* Register: AESL2_PENALTY_REG */
/* Description: Description collection: Penalty register for PCP n */

/* Bits 1..0 : Penalty Level */
#define AESL2_PENALTY_REG_Penalty_Pos (0UL) /*!< Position of Penalty field. */
#define AESL2_PENALTY_REG_Penalty_Msk (0x3UL << AESL2_PENALTY_REG_Penalty_Pos) /*!< Bit mask of Penalty field. */
#define AESL2_PENALTY_REG_Penalty_Full (0UL) /*!< Auto 0) Full penalty) */
#define AESL2_PENALTY_REG_Penalty_Semi1 (1UL) /*!< (Auto 1)  Semi (power on, clock off) */
#define AESL2_PENALTY_REG_Penalty_Semi0 (2UL) /*!< (Auto 2) Semi (power on, clock core on, clock buffer off) */
#define AESL2_PENALTY_REG_Penalty_Zero (3UL) /*!< (Auto 3)  Zero penalty */

/* Register: AESL2_FORCE_OVERRIDE */
/* Description: Description collection: Force override register for PCP n */

/* Bit 15 :   */
#define AESL2_FORCE_OVERRIDE_DISABLE_Pos (15UL) /*!< Position of DISABLE field. */
#define AESL2_FORCE_OVERRIDE_DISABLE_Msk (0x1UL << AESL2_FORCE_OVERRIDE_DISABLE_Pos) /*!< Bit mask of DISABLE field. */
#define AESL2_FORCE_OVERRIDE_DISABLE_zero (0UL) /*!< all forcing disabled */
#define AESL2_FORCE_OVERRIDE_DISABLE_one (1UL) /*!< all forcing enabled */

/* Bit 9 :   */
#define AESL2_FORCE_OVERRIDE_PwrreqCore_Pos (9UL) /*!< Position of PwrreqCore field. */
#define AESL2_FORCE_OVERRIDE_PwrreqCore_Msk (0x1UL << AESL2_FORCE_OVERRIDE_PwrreqCore_Pos) /*!< Bit mask of PwrreqCore field. */
#define AESL2_FORCE_OVERRIDE_PwrreqCore_zero (0UL) /*!< powerRequest.core = 0 */
#define AESL2_FORCE_OVERRIDE_PwrreqCore_one (1UL) /*!< powerRequest.core = 1 */

/* Bit 8 :   */
#define AESL2_FORCE_OVERRIDE_PwrreqSW_Pos (8UL) /*!< Position of PwrreqSW field. */
#define AESL2_FORCE_OVERRIDE_PwrreqSW_Msk (0x1UL << AESL2_FORCE_OVERRIDE_PwrreqSW_Pos) /*!< Bit mask of PwrreqSW field. */
#define AESL2_FORCE_OVERRIDE_PwrreqSW_zero (0UL) /*!< powerRequest.switch = 0 */
#define AESL2_FORCE_OVERRIDE_PwrreqSW_one (1UL) /*!< powerRequest.switch = 1 */

/* Bit 7 :   */
#define AESL2_FORCE_OVERRIDE_PwrreqAll_Pos (7UL) /*!< Position of PwrreqAll field. */
#define AESL2_FORCE_OVERRIDE_PwrreqAll_Msk (0x1UL << AESL2_FORCE_OVERRIDE_PwrreqAll_Pos) /*!< Bit mask of PwrreqAll field. */
#define AESL2_FORCE_OVERRIDE_PwrreqAll_zero (0UL) /*!< All clock forcing  disabled */
#define AESL2_FORCE_OVERRIDE_PwrreqAll_one (1UL) /*!< All clock forcing  enabled */

/* Bit 3 :   */
#define AESL2_FORCE_OVERRIDE_ClkreqCore_Pos (3UL) /*!< Position of ClkreqCore field. */
#define AESL2_FORCE_OVERRIDE_ClkreqCore_Msk (0x1UL << AESL2_FORCE_OVERRIDE_ClkreqCore_Pos) /*!< Bit mask of ClkreqCore field. */
#define AESL2_FORCE_OVERRIDE_ClkreqCore_zero (0UL) /*!< clockRequest.core = 0 */
#define AESL2_FORCE_OVERRIDE_ClkreqCore_one (1UL) /*!< clockRequest.core = 1 */

/* Bit 2 :   */
#define AESL2_FORCE_OVERRIDE_ClkreqBuff_Pos (2UL) /*!< Position of ClkreqBuff field. */
#define AESL2_FORCE_OVERRIDE_ClkreqBuff_Msk (0x1UL << AESL2_FORCE_OVERRIDE_ClkreqBuff_Pos) /*!< Bit mask of ClkreqBuff field. */
#define AESL2_FORCE_OVERRIDE_ClkreqBuff_zero (0UL) /*!< clockRequest.buff = 0 */
#define AESL2_FORCE_OVERRIDE_ClkreqBuff_one (1UL) /*!< clockRequest.buff = 1 */

/* Bit 1 :   */
#define AESL2_FORCE_OVERRIDE_ClkreqAll_Pos (1UL) /*!< Position of ClkreqAll field. */
#define AESL2_FORCE_OVERRIDE_ClkreqAll_Msk (0x1UL << AESL2_FORCE_OVERRIDE_ClkreqAll_Pos) /*!< Bit mask of ClkreqAll field. */
#define AESL2_FORCE_OVERRIDE_ClkreqAll_zero (0UL) /*!< clockRequest.switch = 0 */
#define AESL2_FORCE_OVERRIDE_ClkreqAll_one (1UL) /*!< clockRequest.switch = 1 */

