adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 0 :   */
#define AESL2_FORCE_OVERRIDE_ChangeMeToo_Pos (0UL) /*!< Position of ChangeMeToo field. */
#define AESL2_FORCE_OVERRIDE_ChangeMeToo_Msk (0x1UL << AESL2_FORCE_OVERRIDE_ChangeMeToo_Pos) /*!< Bit mask of ChangeMeToo field. */
#define AESL2_FORCE_OVERRIDE_ChangeMeToo_zero (0UL) /*!< clockRequest.switch_a = 0 */
#define AESL2_FORCE_OVERRIDE_ChangeMeToo_one (1UL) /*!< clockRequest.switch_a = 1 */

/* Register: AESL2_TURN_OFF_AUTO_CLOCKSOURCE_REQ */
/* Description: Turn of the automatic clock request. */

/* Bit 1 :   */
#define AESL2_TURN_OFF_AUTO_CLOCKSOURCE_REQ_ClockStart1_Pos (1UL) /*!< Position of ClockStart1 field. */
#define AESL2_TURN_OFF_AUTO_CLOCKSOURCE_REQ_ClockStart1_Msk (0x1UL << AESL2_TURN_OFF_AUTO_CLOCKSOURCE_REQ_ClockStart1_Pos) /*!< Bit mask of ClockStart1 field. */
#define AESL2_TURN_OFF_AUTO_CLOCKSOURCE_REQ_ClockStart1_zero (0UL) /*!< normal clock start for PCP 1 */
#define AESL2_TURN_OFF_AUTO_CLOCKSOURCE_REQ_ClockStart1_one (1UL) /*!< turn off normal clock start for PCP 1 */

/* Bit 0 :   */
#define AESL2_TURN_OFF_AUTO_CLOCKSOURCE_REQ_ClockStart0_Pos (0UL) /*!< Position of ClockStart0 field. */
#define AESL2_TURN_OFF_AUTO_CLOCKSOURCE_REQ_ClockStart0_Msk (0x1UL << AESL2_TURN_OFF_AUTO_CLOCKSOURCE_REQ_ClockStart0_Pos) /*!< Bit mask of ClockStart0 field. */
#define AESL2_TURN_OFF_AUTO_CLOCKSOURCE_REQ_ClockStart0_zero (0UL) /*!< normal clock start for PCP 0 */
#define AESL2_TURN_OFF_AUTO_CLOCKSOURCE_REQ_ClockStart0_one (1UL) /*!< turn off normal clock start for PCP 0 */


/* Peripheral: AMLI */
/* Description: AHB Multi-Layer Interface */

/* Register: AMLI_RAMPRI_CPU */
/* Description: AHB bus master priority register for CPU */

/* Bits 27..24 : Priority register for RAM AHB slave 6 */
#define AMLI_RAMPRI_CPU_RAM6_Pos (24UL) /*!< Position of RAM6 field. */
#define AMLI_RAMPRI_CPU_RAM6_Msk (0xFUL << AMLI_RAMPRI_CPU_RAM6_Pos) /*!< Bit mask of RAM6 field. */
#define AMLI_RAMPRI_CPU_RAM6_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_CPU_RAM6_Pri1 (1UL) /*!< Priority 1 */
#define AMLI_RAMPRI_CPU_RAM6_Pri2 (2UL) /*!< Priority 2 */
#define AMLI_RAMPRI_CPU_RAM6_Pri3 (3UL) /*!< Priority 3 */
#define AMLI_RAMPRI_CPU_RAM6_Pri4 (4UL) /*!< Priority 4 */
#define AMLI_RAMPRI_CPU_RAM6_Pri5 (5UL) /*!< Priority 5 */
#define AMLI_RAMPRI_CPU_RAM6_Pri6 (6UL) /*!< Priority 6 */
#define AMLI_RAMPRI_CPU_RAM6_Pri7 (7UL) /*!< Priority 7 */
#define AMLI_RAMPRI_CPU_RAM6_Pri8 (8UL) /*!< Priority 8 */
#define AMLI_RAMPRI_CPU_RAM6_Pri9 (9UL) /*!< Priority 9 */
#define AMLI_RAMPRI_CPU_RAM6_Pri10 (10UL) /*!< Priority 10 */
#define AMLI_RAMPRI_CPU_RAM6_Pri11 (11UL) /*!< Priority 11 */
#define AMLI_RAMPRI_CPU_RAM6_Pri12 (12UL) /*!< Priority 12 */
#define AMLI_RAMPRI_CPU_RAM6_Pri13 (13UL) /*!< Priority 13 */
#define AMLI_RAMPRI_CPU_RAM6_Pri14 (14UL) /*!< Priority 14 */
#define AMLI_RAMPRI_CPU_RAM6_Pri15 (15UL) /*!< Priority 15 */

/* Bits 23..20 : Priority register for RAM AHB slave 5 */
#define AMLI_RAMPRI_CPU_RAM5_Pos (20UL) /*!< Position of RAM5 field. */
#define AMLI_RAMPRI_CPU_RAM5_Msk (0xFUL << AMLI_RAMPRI_CPU_RAM5_Pos) /*!< Bit mask of RAM5 field. */
#define AMLI_RAMPRI_CPU_RAM5_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_CPU_RAM5_Pri1 (1UL) /*!< Priority 1 */
#define AMLI_RAMPRI_CPU_RAM5_Pri2 (2UL) /*!< Priority 2 */
#define AMLI_RAMPRI_CPU_RAM5_Pri3 (3UL) /*!< Priority 3 */
#define AMLI_RAMPRI_CPU_RAM5_Pri4 (4UL) /*!< Priority 4 */
#define AMLI_RAMPRI_CPU_RAM5_Pri5 (5UL) /*!< Priority 5 */
#define AMLI_RAMPRI_CPU_RAM5_Pri6 (6UL) /*!< Priority 6 */
#define AMLI_RAMPRI_CPU_RAM5_Pri7 (7UL) /*!< Priority 7 */
#define AMLI_RAMPRI_CPU_RAM5_Pri8 (8UL) /*!< Priority 8 */
#define AMLI_RAMPRI_CPU_RAM5_Pri9 (9UL) /*!< Priority 9 */
#define AMLI_RAMPRI_CPU_RAM5_Pri10 (10UL) /*!< Priority 10 */
#define AMLI_RAMPRI_CPU_RAM5_Pri11 (11UL) /*!< Priority 11 */
#define AMLI_RAMPRI_CPU_RAM5_Pri12 (12UL) /*!< Priority 12 */
#define AMLI_RAMPRI_CPU_RAM5_Pri13 (13UL) /*!< Priority 13 */
#define AMLI_RAMPRI_CPU_RAM5_Pri14 (14UL) /*!< Priority 14 */
#define AMLI_RAMPRI_CPU_RAM5_Pri15 (15UL) /*!< Priority 15 */

/* Bits 19..16 : Priority register for RAM AHB slave 4 */
#define AMLI_RAMPRI_CPU_RAM4_Pos (16UL) /*!< Position of RAM4 field. */
#define AMLI_RAMPRI_CPU_RAM4_Msk (0xFUL << AMLI_RAMPRI_CPU_RAM4_Pos) /*!< Bit mask of RAM4 field. */
#define AMLI_RAMPRI_CPU_RAM4_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_CPU_RAM4_Pri1 (1UL) /*!< Priority 1 */
#define AMLI_RAMPRI_CPU_RAM4_Pri2 (2UL) /*!< Priority 2 */
#define AMLI_RAMPRI_CPU_RAM4_Pri3 (3UL) /*!< Priority 3 */
#define AMLI_RAMPRI_CPU_RAM4_Pri4 (4UL) /*!< Priority 4 */
#define AMLI_RAMPRI_CPU_RAM4_Pri5 (5UL) /*!< Priority 5 */
#define AMLI_RAMPRI_CPU_RAM4_Pri6 (6UL) /*!< Priority 6 */
#define AMLI_RAMPRI_CPU_RAM4_Pri7 (7UL) /*!< Priority 7 */
#define AMLI_RAMPRI_CPU_RAM4_Pri8 (8UL) /*!< Priority 8 */
#define AMLI_RAMPRI_CPU_RAM4_Pri9 (9UL) /*!< Priority 9 */
#define AMLI_RAMPRI_CPU_RAM4_Pri10 (10UL) /*!< Priority 10 */
#define AMLI_RAMPRI_CPU_RAM4_Pri11 (11UL) /*!< Priority 11 */
#define AMLI_RAMPRI_CPU_RAM4_Pri12 (12UL) /*!< Priority 12 */
#define AMLI_RAMPRI_CPU_RAM4_Pri13 (13UL) /*!< Priority 13 */
#define AMLI_RAMPRI_CPU_RAM4_Pri14 (14UL) /*!< Priority 14 */
#define AMLI_RAMPRI_CPU_RAM4_Pri15 (15UL) /*!< Priority 15 */

/* Bits 15..12 : Priority register for RAM AHB slave 3 */
#define AMLI_RAMPRI_CPU_RAM3_Pos (12UL) /*!< Position of RAM3 field. */
#define AMLI_RAMPRI_CPU_RAM3_Msk (0xFUL << AMLI_RAMPRI_CPU_RAM3_Pos) /*!< Bit mask of RAM3 field. */
#define AMLI_RAMPRI_CPU_RAM3_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_CPU_RAM3_Pri1 (1UL) /*!< Priority 1 */
#define AMLI_RAMPRI_CPU_RAM3_Pri2 (2UL) /*!< Priority 2 */
#define AMLI_RAMPRI_CPU_RAM3_Pri3 (3UL) /*!< Priority 3 */
#define AMLI_RAMPRI_CPU_RAM3_Pri4 (4UL) /*!< Priority 4 */
#define AMLI_RAMPRI_CPU_RAM3_Pri5 (5UL) /*!< Priority 5 */
#define AMLI_RAMPRI_CPU_RAM3_Pri6 (6UL) /*!< Priority 6 */
#define AMLI_RAMPRI_CPU_RAM3_Pri7 (7UL) /*!< Priority 7 */
#define AMLI_RAMPRI_CPU_RAM3_Pri8 (8UL) /*!< Priority 8 */
#define AMLI_RAMPRI_CPU_RAM3_Pri9 (9UL) /*!< Priority 9 */
#define AMLI_RAMPRI_CPU_RAM3_Pri10 (10UL) /*!< Priority 10 */
#define AMLI_RAMPRI_CPU_RAM3_Pri11 (11UL) /*!< Priority 11 */
#define AMLI_RAMPRI_CPU_RAM3_Pri12 (12UL) /*!< Priority 12 */
#define AMLI_RAMPRI_CPU_RAM3_Pri13 (13UL) /*!< Priority 13 */
#define AMLI_RAMPRI_CPU_RAM3_Pri14 (14UL) /*!< Priority 14 */
#define AMLI_RAMPRI_CPU_RAM3_Pri15 (15UL) /*!< Priority 15 */

/* Bits 11..8 : Priority register for RAM AHB slave 2 */
#define AMLI_RAMPRI_CPU_RAM2_Pos (8UL) /*!< Position of RAM2 field. */
#define AMLI_RAMPRI_CPU_RAM2_Msk (0xFUL << AMLI_RAMPRI_CPU_RAM2_Pos) /*!< Bit mask of RAM2 field. */
#define AMLI_RAMPRI_CPU_RAM2_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_CPU_RAM2_Pri1 (1UL) /*!< Priority 1 */
#define AMLI_RAMPRI_CPU_RAM2_Pri2 (2UL) /*!< Priority 2 */
#define AMLI_RAMPRI_CPU_RAM2_Pri3 (3UL) /*!< Priority 3 */
#define AMLI_RAMPRI_CPU_RAM2_Pri4 (4UL) /*!< Priority 4 */
#define AMLI_RAMPRI_CPU_RAM2_Pri5 (5UL) /*!< Priority 5 */
#define AMLI_RAMPRI_CPU_RAM2_Pri6 (6UL) /*!< Priority 6 */
#define AMLI_RAMPRI_CPU_RAM2_Pri7 (7UL) /*!< Priority 7 */
#define AMLI_RAMPRI_CPU_RAM2_Pri8 (8UL) /*!< Priority 8 */
#define AMLI_RAMPRI_CPU_RAM2_Pri9 (9UL) /*!< Priority 9 */
#define AMLI_RAMPRI_CPU_RAM2_Pri10 (10UL) /*!< Priority 10 */
#define AMLI_RAMPRI_CPU_RAM2_Pri11 (11UL) /*!< Priority 11 */
#define AMLI_RAMPRI_CPU_RAM2_Pri12 (12UL) /*!< Priority 12 */
#define AMLI_RAMPRI_CPU_RAM2_Pri13 (13UL) /*!< Priority 13 */
#define AMLI_RAMPRI_CPU_RAM2_Pri14 (14UL) /*!< Priority 14 */
#define AMLI_RAMPRI_CPU_RAM2_Pri15 (15UL) /*!< Priority 15 */

/* Bits 7..4 : Priority register for RAM AHB slave 1 */
#define AMLI_RAMPRI_CPU_RAM1_Pos (4UL) /*!< Position of RAM1 field. */
#define AMLI_RAMPRI_CPU_RAM1_Msk (0xFUL << AMLI_RAMPRI_CPU_RAM1_Pos) /*!< Bit mask of RAM1 field. */
#define AMLI_RAMPRI_CPU_RAM1_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_CPU_RAM1_Pri1 (1UL) /*!< Priority 1 */
#define AMLI_RAMPRI_CPU_RAM1_Pri2 (2UL) /*!< Priority 2 */
#define AMLI_RAMPRI_CPU_RAM1_Pri3 (3UL) /*!< Priority 3 */
#define AMLI_RAMPRI_CPU_RAM1_Pri4 (4UL) /*!< Priority 4 */
#define AMLI_RAMPRI_CPU_RAM1_Pri5 (5UL) /*!< Priority 5 */
#define AMLI_RAMPRI_CPU_RAM1_Pri6 (6UL) /*!< Priority 6 */
#define AMLI_RAMPRI_CPU_RAM1_Pri7 (7UL) /*!< Priority 7 */
#define AMLI_RAMPRI_CPU_RAM1_Pri8 (8UL) /*!< Priority 8 */
#define AMLI_RAMPRI_CPU_RAM1_Pri9 (9UL) /*!< Priority 9 */
#define AMLI_RAMPRI_CPU_RAM1_Pri10 (10UL) /*!< Priority 10 */
#define AMLI_RAMPRI_CPU_RAM1_Pri11 (11UL) /*!< Priority 11 */
#define AMLI_RAMPRI_CPU_RAM1_Pri12 (12UL) /*!< Priority 12 */
#define AMLI_RAMPRI_CPU_RAM1_Pri13 (13UL) /*!< Priority 13 */
#define AMLI_RAMPRI_CPU_RAM1_Pri14 (14UL) /*!< Priority 14 */
#define AMLI_RAMPRI_CPU_RAM1_Pri15 (15UL) /*!< Priority 15 */

/* Bits 3..0 : Priority register for RAM AHB slave 0 */
#define AMLI_RAMPRI_CPU_RAM0_Pos (0UL) /*!< Position of RAM0 field. */
#define AMLI_RAMPRI_CPU_RAM0_Msk (0xFUL << AMLI_RAMPRI_CPU_RAM0_Pos) /*!< Bit mask of RAM0 field. */
#define AMLI_RAMPRI_CPU_RAM0_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_CPU_RAM0_Pri1 (1UL) /*!< Priority 1 */
#define AMLI_RAMPRI_CPU_RAM0_Pri2 (2UL) /*!< Priority 2 */
#define AMLI_RAMPRI_CPU_RAM0_Pri3 (3UL) /*!< Priority 3 */
#define AMLI_RAMPRI_CPU_RAM0_Pri4 (4UL) /*!< Priority 4 */
#define AMLI_RAMPRI_CPU_RAM0_Pri5 (5UL) /*!< Priority 5 */
#define AMLI_RAMPRI_CPU_RAM0_Pri6 (6UL) /*!< Priority 6 */
#define AMLI_RAMPRI_CPU_RAM0_Pri7 (7UL) /*!< Priority 7 */
#define AMLI_RAMPRI_CPU_RAM0_Pri8 (8UL) /*!< Priority 8 */
#define AMLI_RAMPRI_CPU_RAM0_Pri9 (9UL) /*!< Priority 9 */
#define AMLI_RAMPRI_CPU_RAM0_Pri10 (10UL) /*!< Priority 10 */
#define AMLI_RAMPRI_CPU_RAM0_Pri11 (11UL) /*!< Priority 11 */
#define AMLI_RAMPRI_CPU_RAM0_Pri12 (12UL) /*!< Priority 12 */
#define AMLI_RAMPRI_CPU_RAM0_Pri13 (13UL) /*!< Priority 13 */
#define AMLI_RAMPRI_CPU_RAM0_Pri14 (14UL) /*!< Priority 14 */
#define AMLI_RAMPRI_CPU_RAM0_Pri15 (15UL) /*!< Priority 15 */

/* Register: AMLI_RAMPRI_EXTRAM */
/* Description: Description collection: AHB bus master priority register for external RAM slave port (EXTRAMs) */

/* Bits 27..24 : Priority register for RAM AHB slave 6 */
#define AMLI_RAMPRI_EXTRAM_RAM6_Pos (24UL) /*!< Position of RAM6 field. */
#define AMLI_RAMPRI_EXTRAM_RAM6_Msk (0xFUL << AMLI_RAMPRI_EXTRAM_RAM6_Pos) /*!< Bit mask of RAM6 field. */
#define AMLI_RAMPRI_EXTRAM_RAM6_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_EXTRAM_RAM6_Pri1 (1UL) /*!< Priority 1 */
#define AMLI_RAMPRI_EXTRAM_RAM6_Pri2 (2UL) /*!< Priority 2 */
#define AMLI_RAMPRI_EXTRAM_RAM6_Pri3 (3UL) /*!< Priority 3 */
#define AMLI_RAMPRI_EXTRAM_RAM6_Pri4 (4UL) /*!< Priority 4 */
#define AMLI_RAMPRI_EXTRAM_RAM6_Pri5 (5UL) /*!< Priority 5 */
#define AMLI_RAMPRI_EXTRAM_RAM6_Pri6 (6UL) /*!< Priority 6 */
#define AMLI_RAMPRI_EXTRAM_RAM6_Pri7 (7UL) /*!< Priority 7 */
#define AMLI_RAMPRI_EXTRAM_RAM6_Pri8 (8UL) /*!< Priority 8 */
#define AMLI_RAMPRI_EXTRAM_RAM6_Pri9 (9UL) /*!< Priority 9 */
#define AMLI_RAMPRI_EXTRAM_RAM6_Pri10 (10UL) /*!< Priority 10 */
#define AMLI_RAMPRI_EXTRAM_RAM6_Pri11 (11UL) /*!< Priority 11 */
#define AMLI_RAMPRI_EXTRAM_RAM6_Pri12 (12UL) /*!< Priority 12 */
#define AMLI_RAMPRI_EXTRAM_RAM6_Pri13 (13UL) /*!< Priority 13 */
#define AMLI_RAMPRI_EXTRAM_RAM6_Pri14 (14UL) /*!< Priority 14 */
#define AMLI_RAMPRI_EXTRAM_RAM6_Pri15 (15UL) /*!< Priority 15 */

/* Bits 23..20 : Priority register for RAM AHB slave 5 */
#define AMLI_RAMPRI_EXTRAM_RAM5_Pos (20UL) /*!< Position of RAM5 field. */
#define AMLI_RAMPRI_EXTRAM_RAM5_Msk (0xFUL << AMLI_RAMPRI_EXTRAM_RAM5_Pos) /*!< Bit mask of RAM5 field. */
#define AMLI_RAMPRI_EXTRAM_RAM5_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_EXTRAM_RAM5_Pri1 (1UL) /*!< Priority 1 */
#define AMLI_RAMPRI_EXTRAM_RAM5_Pri2 (2UL) /*!< Priority 2 */
#define AMLI_RAMPRI_EXTRAM_RAM5_Pri3 (3UL) /*!< Priority 3 */
#define AMLI_RAMPRI_EXTRAM_RAM5_Pri4 (4UL) /*!< Priority 4 */
#define AMLI_RAMPRI_EXTRAM_RAM5_Pri5 (5UL) /*!< Priority 5 */
#define AMLI_RAMPRI_EXTRAM_RAM5_Pri6 (6UL) /*!< Priority 6 */
#define AMLI_RAMPRI_EXTRAM_RAM5_Pri7 (7UL) /*!< Priority 7 */
#define AMLI_RAMPRI_EXTRAM_RAM5_Pri8 (8UL) /*!< Priority 8 */
#define AMLI_RAMPRI_EXTRAM_RAM5_Pri9 (9UL) /*!< Priority 9 */
#define AMLI_RAMPRI_EXTRAM_RAM5_Pri10 (10UL) /*!< Priority 10 */
#define AMLI_RAMPRI_EXTRAM_RAM5_Pri11 (11UL) /*!< Priority 11 */
#define AMLI_RAMPRI_EXTRAM_RAM5_Pri12 (12UL) /*!< Priority 12 */
#define AMLI_RAMPRI_EXTRAM_RAM5_Pri13 (13UL) /*!< Priority 13 */
#define AMLI_RAMPRI_EXTRAM_RAM5_Pri14 (14UL) /*!< Priority 14 */
#define AMLI_RAMPRI_EXTRAM_RAM5_Pri15 (15UL) /*!< Priority 15 */

