adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Peripheral: BBDLL */
/* Description: Base Band  DLL */

/* Register: BBDLL_EVENTS_LOCKERROR */
/* Description: Error event, BBDLL no longer in lock */

/* Bit 0 : Error event, BBDLL no longer in lock */
#define BBDLL_EVENTS_LOCKERROR_EVENTS_LOCKERROR_Pos (0UL) /*!< Position of EVENTS_LOCKERROR field. */
#define BBDLL_EVENTS_LOCKERROR_EVENTS_LOCKERROR_Msk (0x1UL << BBDLL_EVENTS_LOCKERROR_EVENTS_LOCKERROR_Pos) /*!< Bit mask of EVENTS_LOCKERROR field. */
#define BBDLL_EVENTS_LOCKERROR_EVENTS_LOCKERROR_NotGenerated (0UL) /*!< Event not generated */
#define BBDLL_EVENTS_LOCKERROR_EVENTS_LOCKERROR_Generated (1UL) /*!< Event generated */

/* Register: BBDLL_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 0 : Enable or disable interrupt for event LOCKERROR */
#define BBDLL_INTEN_LOCKERROR_Pos (0UL) /*!< Position of LOCKERROR field. */
#define BBDLL_INTEN_LOCKERROR_Msk (0x1UL << BBDLL_INTEN_LOCKERROR_Pos) /*!< Bit mask of LOCKERROR field. */
#define BBDLL_INTEN_LOCKERROR_Disabled (0UL) /*!< Disable */
#define BBDLL_INTEN_LOCKERROR_Enabled (1UL) /*!< Enable */

/* Register: BBDLL_INTENSET */
/* Description: Enable interrupt */

/* Bit 0 : Write '1' to enable interrupt for event LOCKERROR */
#define BBDLL_INTENSET_LOCKERROR_Pos (0UL) /*!< Position of LOCKERROR field. */
#define BBDLL_INTENSET_LOCKERROR_Msk (0x1UL << BBDLL_INTENSET_LOCKERROR_Pos) /*!< Bit mask of LOCKERROR field. */
#define BBDLL_INTENSET_LOCKERROR_Disabled (0UL) /*!< Read: Disabled */
#define BBDLL_INTENSET_LOCKERROR_Enabled (1UL) /*!< Read: Enabled */
#define BBDLL_INTENSET_LOCKERROR_Set (1UL) /*!< Enable */

/* Register: BBDLL_INTENCLR */
/* Description: Disable interrupt */

/* Bit 0 : Write '1' to disable interrupt for event LOCKERROR */
#define BBDLL_INTENCLR_LOCKERROR_Pos (0UL) /*!< Position of LOCKERROR field. */
#define BBDLL_INTENCLR_LOCKERROR_Msk (0x1UL << BBDLL_INTENCLR_LOCKERROR_Pos) /*!< Bit mask of LOCKERROR field. */
#define BBDLL_INTENCLR_LOCKERROR_Disabled (0UL) /*!< Read: Disabled */
#define BBDLL_INTENCLR_LOCKERROR_Enabled (1UL) /*!< Read: Enabled */
#define BBDLL_INTENCLR_LOCKERROR_Clear (1UL) /*!< Disable */

/* Register: BBDLL_INTPEND */
/* Description: Pending interrupts */

/* Bit 0 : Read pending status of interrupt for event LOCKERROR */
#define BBDLL_INTPEND_LOCKERROR_Pos (0UL) /*!< Position of LOCKERROR field. */
#define BBDLL_INTPEND_LOCKERROR_Msk (0x1UL << BBDLL_INTPEND_LOCKERROR_Pos) /*!< Bit mask of LOCKERROR field. */
#define BBDLL_INTPEND_LOCKERROR_NotPending (0UL) /*!< Read: Not pending */
#define BBDLL_INTPEND_LOCKERROR_Pending (1UL) /*!< Read: Pending */

/* Register: BBDLL_INLOCK */
/* Description: BBDLL locked or not */

/* Bit 0 : BBDLL locked or not */
#define BBDLL_INLOCK_INLOCK_Pos (0UL) /*!< Position of INLOCK field. */
#define BBDLL_INLOCK_INLOCK_Msk (0x1UL << BBDLL_INLOCK_INLOCK_Pos) /*!< Bit mask of INLOCK field. */
#define BBDLL_INLOCK_INLOCK_NotInLock (0UL) /*!< BBDLL not locked */
#define BBDLL_INLOCK_INLOCK_InLock (1UL) /*!< BBDLL locked */

/* Register: BBDLL_OVERRIDE_FORCEINLOCK */
/* Description: Unspecified */

/* Bit 0 : Force BBDLL in lock */
#define BBDLL_OVERRIDE_FORCEINLOCK_FORCEINLOCK_Pos (0UL) /*!< Position of FORCEINLOCK field. */
#define BBDLL_OVERRIDE_FORCEINLOCK_FORCEINLOCK_Msk (0x1UL << BBDLL_OVERRIDE_FORCEINLOCK_FORCEINLOCK_Pos) /*!< Bit mask of FORCEINLOCK field. */
#define BBDLL_OVERRIDE_FORCEINLOCK_FORCEINLOCK_NoOverride (0UL) /*!< No override */
#define BBDLL_OVERRIDE_FORCEINLOCK_FORCEINLOCK_ForceLock (1UL) /*!< Force lock */

/* Register: BBDLL_TEST */
/* Description: Unspecified */

/* Bits 3..0 : ATE test bus control */
#define BBDLL_TEST_ATE_Pos (0UL) /*!< Position of ATE field. */
#define BBDLL_TEST_ATE_Msk (0xFUL << BBDLL_TEST_ATE_Pos) /*!< Bit mask of ATE field. */


/* Peripheral: BPROT */
/* Description: Block Protect */

/* Register: BPROT_DISABLEINDEBUG */
/* Description: Disable protection mechanism in debug mode */

/* Bit 0 : Disable the protection mechanism for NVM regions while in debug mode. This register will only disable the protection mechanism if the device is in debug mode. */
#define BPROT_DISABLEINDEBUG_DISABLEINDEBUG_Pos (0UL) /*!< Position of DISABLEINDEBUG field. */
#define BPROT_DISABLEINDEBUG_DISABLEINDEBUG_Msk (0x1UL << BPROT_DISABLEINDEBUG_DISABLEINDEBUG_Pos) /*!< Bit mask of DISABLEINDEBUG field. */
#define BPROT_DISABLEINDEBUG_DISABLEINDEBUG_Enabled (0UL) /*!< Enable in debug */
#define BPROT_DISABLEINDEBUG_DISABLEINDEBUG_Disabled (1UL) /*!< Disable in debug */

/* Register: BPROT_CONFIG0 */
/* Description: Block protect configuration register 0 */

/* Bit 31 : Enable protection for region 31. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION31_Pos (31UL) /*!< Position of REGION31 field. */
#define BPROT_CONFIG0_REGION31_Msk (0x1UL << BPROT_CONFIG0_REGION31_Pos) /*!< Bit mask of REGION31 field. */
#define BPROT_CONFIG0_REGION31_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG0_REGION31_Enabled (1UL) /*!< Protection enable */

/* Bit 30 : Enable protection for region 30. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION30_Pos (30UL) /*!< Position of REGION30 field. */
#define BPROT_CONFIG0_REGION30_Msk (0x1UL << BPROT_CONFIG0_REGION30_Pos) /*!< Bit mask of REGION30 field. */
#define BPROT_CONFIG0_REGION30_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG0_REGION30_Enabled (1UL) /*!< Protection enable */

/* Bit 29 : Enable protection for region 29. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION29_Pos (29UL) /*!< Position of REGION29 field. */
#define BPROT_CONFIG0_REGION29_Msk (0x1UL << BPROT_CONFIG0_REGION29_Pos) /*!< Bit mask of REGION29 field. */
#define BPROT_CONFIG0_REGION29_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG0_REGION29_Enabled (1UL) /*!< Protection enable */

/* Bit 28 : Enable protection for region 28. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION28_Pos (28UL) /*!< Position of REGION28 field. */
#define BPROT_CONFIG0_REGION28_Msk (0x1UL << BPROT_CONFIG0_REGION28_Pos) /*!< Bit mask of REGION28 field. */
#define BPROT_CONFIG0_REGION28_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG0_REGION28_Enabled (1UL) /*!< Protection enable */

/* Bit 27 : Enable protection for region 27. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION27_Pos (27UL) /*!< Position of REGION27 field. */
#define BPROT_CONFIG0_REGION27_Msk (0x1UL << BPROT_CONFIG0_REGION27_Pos) /*!< Bit mask of REGION27 field. */
#define BPROT_CONFIG0_REGION27_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG0_REGION27_Enabled (1UL) /*!< Protection enable */

