adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 4 : Enable protection for region 100. Write '0' has no effect. */
#define BPROT_CONFIG3_REGION100_Pos (4UL) /*!< Position of REGION100 field. */
#define BPROT_CONFIG3_REGION100_Msk (0x1UL << BPROT_CONFIG3_REGION100_Pos) /*!< Bit mask of REGION100 field. */
#define BPROT_CONFIG3_REGION100_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG3_REGION100_Enabled (1UL) /*!< Protection enable */

/* Bit 3 : Enable protection for region 99. Write '0' has no effect. */
#define BPROT_CONFIG3_REGION99_Pos (3UL) /*!< Position of REGION99 field. */
#define BPROT_CONFIG3_REGION99_Msk (0x1UL << BPROT_CONFIG3_REGION99_Pos) /*!< Bit mask of REGION99 field. */
#define BPROT_CONFIG3_REGION99_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG3_REGION99_Enabled (1UL) /*!< Protection enable */

/* Bit 2 : Enable protection for region 98. Write '0' has no effect. */
#define BPROT_CONFIG3_REGION98_Pos (2UL) /*!< Position of REGION98 field. */
#define BPROT_CONFIG3_REGION98_Msk (0x1UL << BPROT_CONFIG3_REGION98_Pos) /*!< Bit mask of REGION98 field. */
#define BPROT_CONFIG3_REGION98_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG3_REGION98_Enabled (1UL) /*!< Protection enable */

/* Bit 1 : Enable protection for region 97. Write '0' has no effect. */
#define BPROT_CONFIG3_REGION97_Pos (1UL) /*!< Position of REGION97 field. */
#define BPROT_CONFIG3_REGION97_Msk (0x1UL << BPROT_CONFIG3_REGION97_Pos) /*!< Bit mask of REGION97 field. */
#define BPROT_CONFIG3_REGION97_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG3_REGION97_Enabled (1UL) /*!< Protection enable */

/* Bit 0 : Enable protection for region 96. Write '0' has no effect. */
#define BPROT_CONFIG3_REGION96_Pos (0UL) /*!< Position of REGION96 field. */
#define BPROT_CONFIG3_REGION96_Msk (0x1UL << BPROT_CONFIG3_REGION96_Pos) /*!< Bit mask of REGION96 field. */
#define BPROT_CONFIG3_REGION96_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG3_REGION96_Enabled (1UL) /*!< Protection enable */

/* Register: BPROT_CONFIG4 */
/* Description: Block protect configuration register 0 */

/* Bit 31 : Enable protection for region 159. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION159_Pos (31UL) /*!< Position of REGION159 field. */
#define BPROT_CONFIG4_REGION159_Msk (0x1UL << BPROT_CONFIG4_REGION159_Pos) /*!< Bit mask of REGION159 field. */
#define BPROT_CONFIG4_REGION159_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION159_Enabled (1UL) /*!< Protection enable */

/* Bit 30 : Enable protection for region 158. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION158_Pos (30UL) /*!< Position of REGION158 field. */
#define BPROT_CONFIG4_REGION158_Msk (0x1UL << BPROT_CONFIG4_REGION158_Pos) /*!< Bit mask of REGION158 field. */
#define BPROT_CONFIG4_REGION158_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION158_Enabled (1UL) /*!< Protection enable */

/* Bit 29 : Enable protection for region 157. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION157_Pos (29UL) /*!< Position of REGION157 field. */
#define BPROT_CONFIG4_REGION157_Msk (0x1UL << BPROT_CONFIG4_REGION157_Pos) /*!< Bit mask of REGION157 field. */
#define BPROT_CONFIG4_REGION157_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION157_Enabled (1UL) /*!< Protection enable */

/* Bit 28 : Enable protection for region 156. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION156_Pos (28UL) /*!< Position of REGION156 field. */
#define BPROT_CONFIG4_REGION156_Msk (0x1UL << BPROT_CONFIG4_REGION156_Pos) /*!< Bit mask of REGION156 field. */
#define BPROT_CONFIG4_REGION156_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION156_Enabled (1UL) /*!< Protection enable */

/* Bit 27 : Enable protection for region 155. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION155_Pos (27UL) /*!< Position of REGION155 field. */
#define BPROT_CONFIG4_REGION155_Msk (0x1UL << BPROT_CONFIG4_REGION155_Pos) /*!< Bit mask of REGION155 field. */
#define BPROT_CONFIG4_REGION155_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION155_Enabled (1UL) /*!< Protection enable */

/* Bit 26 : Enable protection for region 154. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION154_Pos (26UL) /*!< Position of REGION154 field. */
#define BPROT_CONFIG4_REGION154_Msk (0x1UL << BPROT_CONFIG4_REGION154_Pos) /*!< Bit mask of REGION154 field. */
#define BPROT_CONFIG4_REGION154_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION154_Enabled (1UL) /*!< Protection enable */

/* Bit 25 : Enable protection for region 153. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION153_Pos (25UL) /*!< Position of REGION153 field. */
#define BPROT_CONFIG4_REGION153_Msk (0x1UL << BPROT_CONFIG4_REGION153_Pos) /*!< Bit mask of REGION153 field. */
#define BPROT_CONFIG4_REGION153_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION153_Enabled (1UL) /*!< Protection enable */

/* Bit 24 : Enable protection for region 152. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION152_Pos (24UL) /*!< Position of REGION152 field. */
#define BPROT_CONFIG4_REGION152_Msk (0x1UL << BPROT_CONFIG4_REGION152_Pos) /*!< Bit mask of REGION152 field. */
#define BPROT_CONFIG4_REGION152_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION152_Enabled (1UL) /*!< Protection enable */

/* Bit 23 : Enable protection for region 151. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION151_Pos (23UL) /*!< Position of REGION151 field. */
#define BPROT_CONFIG4_REGION151_Msk (0x1UL << BPROT_CONFIG4_REGION151_Pos) /*!< Bit mask of REGION151 field. */
#define BPROT_CONFIG4_REGION151_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION151_Enabled (1UL) /*!< Protection enable */

/* Bit 22 : Enable protection for region 150. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION150_Pos (22UL) /*!< Position of REGION150 field. */
#define BPROT_CONFIG4_REGION150_Msk (0x1UL << BPROT_CONFIG4_REGION150_Pos) /*!< Bit mask of REGION150 field. */
#define BPROT_CONFIG4_REGION150_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION150_Enabled (1UL) /*!< Protection enable */

/* Bit 21 : Enable protection for region 149. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION149_Pos (21UL) /*!< Position of REGION149 field. */
#define BPROT_CONFIG4_REGION149_Msk (0x1UL << BPROT_CONFIG4_REGION149_Pos) /*!< Bit mask of REGION149 field. */
#define BPROT_CONFIG4_REGION149_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION149_Enabled (1UL) /*!< Protection enable */

/* Bit 20 : Enable protection for region 148. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION148_Pos (20UL) /*!< Position of REGION148 field. */
#define BPROT_CONFIG4_REGION148_Msk (0x1UL << BPROT_CONFIG4_REGION148_Pos) /*!< Bit mask of REGION148 field. */
#define BPROT_CONFIG4_REGION148_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION148_Enabled (1UL) /*!< Protection enable */

/* Bit 19 : Enable protection for region 147. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION147_Pos (19UL) /*!< Position of REGION147 field. */
#define BPROT_CONFIG4_REGION147_Msk (0x1UL << BPROT_CONFIG4_REGION147_Pos) /*!< Bit mask of REGION147 field. */
#define BPROT_CONFIG4_REGION147_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION147_Enabled (1UL) /*!< Protection enable */

/* Bit 18 : Enable protection for region 146. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION146_Pos (18UL) /*!< Position of REGION146 field. */
#define BPROT_CONFIG4_REGION146_Msk (0x1UL << BPROT_CONFIG4_REGION146_Pos) /*!< Bit mask of REGION146 field. */
#define BPROT_CONFIG4_REGION146_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION146_Enabled (1UL) /*!< Protection enable */

/* Bit 17 : Enable protection for region 145. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION145_Pos (17UL) /*!< Position of REGION145 field. */
#define BPROT_CONFIG4_REGION145_Msk (0x1UL << BPROT_CONFIG4_REGION145_Pos) /*!< Bit mask of REGION145 field. */
#define BPROT_CONFIG4_REGION145_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION145_Enabled (1UL) /*!< Protection enable */

/* Bit 16 : Enable protection for region 144. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION144_Pos (16UL) /*!< Position of REGION144 field. */
#define BPROT_CONFIG4_REGION144_Msk (0x1UL << BPROT_CONFIG4_REGION144_Pos) /*!< Bit mask of REGION144 field. */
#define BPROT_CONFIG4_REGION144_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION144_Enabled (1UL) /*!< Protection enable */

