adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 15 : Enable protection for region 143. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION143_Pos (15UL) /*!< Position of REGION143 field. */
#define BPROT_CONFIG4_REGION143_Msk (0x1UL << BPROT_CONFIG4_REGION143_Pos) /*!< Bit mask of REGION143 field. */
#define BPROT_CONFIG4_REGION143_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION143_Enabled (1UL) /*!< Protection enable */

/* Bit 14 : Enable protection for region 142. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION142_Pos (14UL) /*!< Position of REGION142 field. */
#define BPROT_CONFIG4_REGION142_Msk (0x1UL << BPROT_CONFIG4_REGION142_Pos) /*!< Bit mask of REGION142 field. */
#define BPROT_CONFIG4_REGION142_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION142_Enabled (1UL) /*!< Protection enable */

/* Bit 13 : Enable protection for region 141. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION141_Pos (13UL) /*!< Position of REGION141 field. */
#define BPROT_CONFIG4_REGION141_Msk (0x1UL << BPROT_CONFIG4_REGION141_Pos) /*!< Bit mask of REGION141 field. */
#define BPROT_CONFIG4_REGION141_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION141_Enabled (1UL) /*!< Protection enable */

/* Bit 12 : Enable protection for region 140. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION140_Pos (12UL) /*!< Position of REGION140 field. */
#define BPROT_CONFIG4_REGION140_Msk (0x1UL << BPROT_CONFIG4_REGION140_Pos) /*!< Bit mask of REGION140 field. */
#define BPROT_CONFIG4_REGION140_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION140_Enabled (1UL) /*!< Protection enable */

/* Bit 11 : Enable protection for region 139. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION139_Pos (11UL) /*!< Position of REGION139 field. */
#define BPROT_CONFIG4_REGION139_Msk (0x1UL << BPROT_CONFIG4_REGION139_Pos) /*!< Bit mask of REGION139 field. */
#define BPROT_CONFIG4_REGION139_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION139_Enabled (1UL) /*!< Protection enable */

/* Bit 10 : Enable protection for region 138. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION138_Pos (10UL) /*!< Position of REGION138 field. */
#define BPROT_CONFIG4_REGION138_Msk (0x1UL << BPROT_CONFIG4_REGION138_Pos) /*!< Bit mask of REGION138 field. */
#define BPROT_CONFIG4_REGION138_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION138_Enabled (1UL) /*!< Protection enable */

/* Bit 9 : Enable protection for region 137. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION137_Pos (9UL) /*!< Position of REGION137 field. */
#define BPROT_CONFIG4_REGION137_Msk (0x1UL << BPROT_CONFIG4_REGION137_Pos) /*!< Bit mask of REGION137 field. */
#define BPROT_CONFIG4_REGION137_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION137_Enabled (1UL) /*!< Protection enable */

/* Bit 8 : Enable protection for region 136. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION136_Pos (8UL) /*!< Position of REGION136 field. */
#define BPROT_CONFIG4_REGION136_Msk (0x1UL << BPROT_CONFIG4_REGION136_Pos) /*!< Bit mask of REGION136 field. */
#define BPROT_CONFIG4_REGION136_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION136_Enabled (1UL) /*!< Protection enable */

/* Bit 7 : Enable protection for region 135. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION135_Pos (7UL) /*!< Position of REGION135 field. */
#define BPROT_CONFIG4_REGION135_Msk (0x1UL << BPROT_CONFIG4_REGION135_Pos) /*!< Bit mask of REGION135 field. */
#define BPROT_CONFIG4_REGION135_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION135_Enabled (1UL) /*!< Protection enable */

/* Bit 6 : Enable protection for region 134. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION134_Pos (6UL) /*!< Position of REGION134 field. */
#define BPROT_CONFIG4_REGION134_Msk (0x1UL << BPROT_CONFIG4_REGION134_Pos) /*!< Bit mask of REGION134 field. */
#define BPROT_CONFIG4_REGION134_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION134_Enabled (1UL) /*!< Protection enable */

/* Bit 5 : Enable protection for region 133. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION133_Pos (5UL) /*!< Position of REGION133 field. */
#define BPROT_CONFIG4_REGION133_Msk (0x1UL << BPROT_CONFIG4_REGION133_Pos) /*!< Bit mask of REGION133 field. */
#define BPROT_CONFIG4_REGION133_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION133_Enabled (1UL) /*!< Protection enable */

/* Bit 4 : Enable protection for region 132. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION132_Pos (4UL) /*!< Position of REGION132 field. */
#define BPROT_CONFIG4_REGION132_Msk (0x1UL << BPROT_CONFIG4_REGION132_Pos) /*!< Bit mask of REGION132 field. */
#define BPROT_CONFIG4_REGION132_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION132_Enabled (1UL) /*!< Protection enable */

/* Bit 3 : Enable protection for region 131. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION131_Pos (3UL) /*!< Position of REGION131 field. */
#define BPROT_CONFIG4_REGION131_Msk (0x1UL << BPROT_CONFIG4_REGION131_Pos) /*!< Bit mask of REGION131 field. */
#define BPROT_CONFIG4_REGION131_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION131_Enabled (1UL) /*!< Protection enable */

/* Bit 2 : Enable protection for region 130. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION130_Pos (2UL) /*!< Position of REGION130 field. */
#define BPROT_CONFIG4_REGION130_Msk (0x1UL << BPROT_CONFIG4_REGION130_Pos) /*!< Bit mask of REGION130 field. */
#define BPROT_CONFIG4_REGION130_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION130_Enabled (1UL) /*!< Protection enable */

/* Bit 1 : Enable protection for region 129. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION129_Pos (1UL) /*!< Position of REGION129 field. */
#define BPROT_CONFIG4_REGION129_Msk (0x1UL << BPROT_CONFIG4_REGION129_Pos) /*!< Bit mask of REGION129 field. */
#define BPROT_CONFIG4_REGION129_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION129_Enabled (1UL) /*!< Protection enable */

