adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 0 : Enable protection for region 128. Write '0' has no effect. */
#define BPROT_CONFIG4_REGION128_Pos (0UL) /*!< Position of REGION128 field. */
#define BPROT_CONFIG4_REGION128_Msk (0x1UL << BPROT_CONFIG4_REGION128_Pos) /*!< Bit mask of REGION128 field. */
#define BPROT_CONFIG4_REGION128_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG4_REGION128_Enabled (1UL) /*!< Protection enable */

/* Register: BPROT_CONFIG5 */
/* Description: Block protect configuration register 0 */

/* Bit 31 : Enable protection for region 191. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION191_Pos (31UL) /*!< Position of REGION191 field. */
#define BPROT_CONFIG5_REGION191_Msk (0x1UL << BPROT_CONFIG5_REGION191_Pos) /*!< Bit mask of REGION191 field. */
#define BPROT_CONFIG5_REGION191_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION191_Enabled (1UL) /*!< Protection enable */

/* Bit 30 : Enable protection for region 190. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION190_Pos (30UL) /*!< Position of REGION190 field. */
#define BPROT_CONFIG5_REGION190_Msk (0x1UL << BPROT_CONFIG5_REGION190_Pos) /*!< Bit mask of REGION190 field. */
#define BPROT_CONFIG5_REGION190_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION190_Enabled (1UL) /*!< Protection enable */

/* Bit 29 : Enable protection for region 189. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION189_Pos (29UL) /*!< Position of REGION189 field. */
#define BPROT_CONFIG5_REGION189_Msk (0x1UL << BPROT_CONFIG5_REGION189_Pos) /*!< Bit mask of REGION189 field. */
#define BPROT_CONFIG5_REGION189_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION189_Enabled (1UL) /*!< Protection enable */

/* Bit 28 : Enable protection for region 188. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION188_Pos (28UL) /*!< Position of REGION188 field. */
#define BPROT_CONFIG5_REGION188_Msk (0x1UL << BPROT_CONFIG5_REGION188_Pos) /*!< Bit mask of REGION188 field. */
#define BPROT_CONFIG5_REGION188_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION188_Enabled (1UL) /*!< Protection enable */

/* Bit 27 : Enable protection for region 187. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION187_Pos (27UL) /*!< Position of REGION187 field. */
#define BPROT_CONFIG5_REGION187_Msk (0x1UL << BPROT_CONFIG5_REGION187_Pos) /*!< Bit mask of REGION187 field. */
#define BPROT_CONFIG5_REGION187_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION187_Enabled (1UL) /*!< Protection enable */

/* Bit 26 : Enable protection for region 186. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION186_Pos (26UL) /*!< Position of REGION186 field. */
#define BPROT_CONFIG5_REGION186_Msk (0x1UL << BPROT_CONFIG5_REGION186_Pos) /*!< Bit mask of REGION186 field. */
#define BPROT_CONFIG5_REGION186_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION186_Enabled (1UL) /*!< Protection enable */

/* Bit 25 : Enable protection for region 185. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION185_Pos (25UL) /*!< Position of REGION185 field. */
#define BPROT_CONFIG5_REGION185_Msk (0x1UL << BPROT_CONFIG5_REGION185_Pos) /*!< Bit mask of REGION185 field. */
#define BPROT_CONFIG5_REGION185_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION185_Enabled (1UL) /*!< Protection enable */

/* Bit 24 : Enable protection for region 184. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION184_Pos (24UL) /*!< Position of REGION184 field. */
#define BPROT_CONFIG5_REGION184_Msk (0x1UL << BPROT_CONFIG5_REGION184_Pos) /*!< Bit mask of REGION184 field. */
#define BPROT_CONFIG5_REGION184_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION184_Enabled (1UL) /*!< Protection enable */

/* Bit 23 : Enable protection for region 183. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION183_Pos (23UL) /*!< Position of REGION183 field. */
#define BPROT_CONFIG5_REGION183_Msk (0x1UL << BPROT_CONFIG5_REGION183_Pos) /*!< Bit mask of REGION183 field. */
#define BPROT_CONFIG5_REGION183_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION183_Enabled (1UL) /*!< Protection enable */

/* Bit 22 : Enable protection for region 182. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION182_Pos (22UL) /*!< Position of REGION182 field. */
#define BPROT_CONFIG5_REGION182_Msk (0x1UL << BPROT_CONFIG5_REGION182_Pos) /*!< Bit mask of REGION182 field. */
#define BPROT_CONFIG5_REGION182_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION182_Enabled (1UL) /*!< Protection enable */

/* Bit 21 : Enable protection for region 181. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION181_Pos (21UL) /*!< Position of REGION181 field. */
#define BPROT_CONFIG5_REGION181_Msk (0x1UL << BPROT_CONFIG5_REGION181_Pos) /*!< Bit mask of REGION181 field. */
#define BPROT_CONFIG5_REGION181_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION181_Enabled (1UL) /*!< Protection enable */

/* Bit 20 : Enable protection for region 180. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION180_Pos (20UL) /*!< Position of REGION180 field. */
#define BPROT_CONFIG5_REGION180_Msk (0x1UL << BPROT_CONFIG5_REGION180_Pos) /*!< Bit mask of REGION180 field. */
#define BPROT_CONFIG5_REGION180_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION180_Enabled (1UL) /*!< Protection enable */

/* Bit 19 : Enable protection for region 179. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION179_Pos (19UL) /*!< Position of REGION179 field. */
#define BPROT_CONFIG5_REGION179_Msk (0x1UL << BPROT_CONFIG5_REGION179_Pos) /*!< Bit mask of REGION179 field. */
#define BPROT_CONFIG5_REGION179_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION179_Enabled (1UL) /*!< Protection enable */

/* Bit 18 : Enable protection for region 178. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION178_Pos (18UL) /*!< Position of REGION178 field. */
#define BPROT_CONFIG5_REGION178_Msk (0x1UL << BPROT_CONFIG5_REGION178_Pos) /*!< Bit mask of REGION178 field. */
#define BPROT_CONFIG5_REGION178_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION178_Enabled (1UL) /*!< Protection enable */

/* Bit 17 : Enable protection for region 177. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION177_Pos (17UL) /*!< Position of REGION177 field. */
#define BPROT_CONFIG5_REGION177_Msk (0x1UL << BPROT_CONFIG5_REGION177_Pos) /*!< Bit mask of REGION177 field. */
#define BPROT_CONFIG5_REGION177_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION177_Enabled (1UL) /*!< Protection enable */

