adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 16 : Enable protection for region 176. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION176_Pos (16UL) /*!< Position of REGION176 field. */
#define BPROT_CONFIG5_REGION176_Msk (0x1UL << BPROT_CONFIG5_REGION176_Pos) /*!< Bit mask of REGION176 field. */
#define BPROT_CONFIG5_REGION176_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION176_Enabled (1UL) /*!< Protection enable */

/* Bit 15 : Enable protection for region 175. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION175_Pos (15UL) /*!< Position of REGION175 field. */
#define BPROT_CONFIG5_REGION175_Msk (0x1UL << BPROT_CONFIG5_REGION175_Pos) /*!< Bit mask of REGION175 field. */
#define BPROT_CONFIG5_REGION175_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION175_Enabled (1UL) /*!< Protection enable */

/* Bit 14 : Enable protection for region 174. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION174_Pos (14UL) /*!< Position of REGION174 field. */
#define BPROT_CONFIG5_REGION174_Msk (0x1UL << BPROT_CONFIG5_REGION174_Pos) /*!< Bit mask of REGION174 field. */
#define BPROT_CONFIG5_REGION174_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION174_Enabled (1UL) /*!< Protection enable */

/* Bit 13 : Enable protection for region 173. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION173_Pos (13UL) /*!< Position of REGION173 field. */
#define BPROT_CONFIG5_REGION173_Msk (0x1UL << BPROT_CONFIG5_REGION173_Pos) /*!< Bit mask of REGION173 field. */
#define BPROT_CONFIG5_REGION173_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION173_Enabled (1UL) /*!< Protection enable */

/* Bit 12 : Enable protection for region 172. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION172_Pos (12UL) /*!< Position of REGION172 field. */
#define BPROT_CONFIG5_REGION172_Msk (0x1UL << BPROT_CONFIG5_REGION172_Pos) /*!< Bit mask of REGION172 field. */
#define BPROT_CONFIG5_REGION172_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION172_Enabled (1UL) /*!< Protection enable */

/* Bit 11 : Enable protection for region 171. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION171_Pos (11UL) /*!< Position of REGION171 field. */
#define BPROT_CONFIG5_REGION171_Msk (0x1UL << BPROT_CONFIG5_REGION171_Pos) /*!< Bit mask of REGION171 field. */
#define BPROT_CONFIG5_REGION171_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION171_Enabled (1UL) /*!< Protection enable */

/* Bit 10 : Enable protection for region 170. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION170_Pos (10UL) /*!< Position of REGION170 field. */
#define BPROT_CONFIG5_REGION170_Msk (0x1UL << BPROT_CONFIG5_REGION170_Pos) /*!< Bit mask of REGION170 field. */
#define BPROT_CONFIG5_REGION170_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION170_Enabled (1UL) /*!< Protection enable */

/* Bit 9 : Enable protection for region 169. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION169_Pos (9UL) /*!< Position of REGION169 field. */
#define BPROT_CONFIG5_REGION169_Msk (0x1UL << BPROT_CONFIG5_REGION169_Pos) /*!< Bit mask of REGION169 field. */
#define BPROT_CONFIG5_REGION169_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION169_Enabled (1UL) /*!< Protection enable */

/* Bit 8 : Enable protection for region 168. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION168_Pos (8UL) /*!< Position of REGION168 field. */
#define BPROT_CONFIG5_REGION168_Msk (0x1UL << BPROT_CONFIG5_REGION168_Pos) /*!< Bit mask of REGION168 field. */
#define BPROT_CONFIG5_REGION168_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION168_Enabled (1UL) /*!< Protection enable */

/* Bit 7 : Enable protection for region 167. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION167_Pos (7UL) /*!< Position of REGION167 field. */
#define BPROT_CONFIG5_REGION167_Msk (0x1UL << BPROT_CONFIG5_REGION167_Pos) /*!< Bit mask of REGION167 field. */
#define BPROT_CONFIG5_REGION167_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION167_Enabled (1UL) /*!< Protection enable */

/* Bit 6 : Enable protection for region 166. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION166_Pos (6UL) /*!< Position of REGION166 field. */
#define BPROT_CONFIG5_REGION166_Msk (0x1UL << BPROT_CONFIG5_REGION166_Pos) /*!< Bit mask of REGION166 field. */
#define BPROT_CONFIG5_REGION166_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION166_Enabled (1UL) /*!< Protection enable */

/* Bit 5 : Enable protection for region 165. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION165_Pos (5UL) /*!< Position of REGION165 field. */
#define BPROT_CONFIG5_REGION165_Msk (0x1UL << BPROT_CONFIG5_REGION165_Pos) /*!< Bit mask of REGION165 field. */
#define BPROT_CONFIG5_REGION165_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION165_Enabled (1UL) /*!< Protection enable */

/* Bit 4 : Enable protection for region 164. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION164_Pos (4UL) /*!< Position of REGION164 field. */
#define BPROT_CONFIG5_REGION164_Msk (0x1UL << BPROT_CONFIG5_REGION164_Pos) /*!< Bit mask of REGION164 field. */
#define BPROT_CONFIG5_REGION164_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION164_Enabled (1UL) /*!< Protection enable */

/* Bit 3 : Enable protection for region 163. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION163_Pos (3UL) /*!< Position of REGION163 field. */
#define BPROT_CONFIG5_REGION163_Msk (0x1UL << BPROT_CONFIG5_REGION163_Pos) /*!< Bit mask of REGION163 field. */
#define BPROT_CONFIG5_REGION163_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION163_Enabled (1UL) /*!< Protection enable */

/* Bit 2 : Enable protection for region 162. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION162_Pos (2UL) /*!< Position of REGION162 field. */
#define BPROT_CONFIG5_REGION162_Msk (0x1UL << BPROT_CONFIG5_REGION162_Pos) /*!< Bit mask of REGION162 field. */
#define BPROT_CONFIG5_REGION162_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION162_Enabled (1UL) /*!< Protection enable */

/* Bit 1 : Enable protection for region 161. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION161_Pos (1UL) /*!< Position of REGION161 field. */
#define BPROT_CONFIG5_REGION161_Msk (0x1UL << BPROT_CONFIG5_REGION161_Pos) /*!< Bit mask of REGION161 field. */
#define BPROT_CONFIG5_REGION161_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION161_Enabled (1UL) /*!< Protection enable */

/* Bit 0 : Enable protection for region 160. Write '0' has no effect. */
#define BPROT_CONFIG5_REGION160_Pos (0UL) /*!< Position of REGION160 field. */
#define BPROT_CONFIG5_REGION160_Msk (0x1UL << BPROT_CONFIG5_REGION160_Pos) /*!< Bit mask of REGION160 field. */
#define BPROT_CONFIG5_REGION160_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG5_REGION160_Enabled (1UL) /*!< Protection enable */

/* Register: BPROT_CONFIG6 */
/* Description: Block protect configuration register 0 */

