adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 31 : Enable protection for region 223. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION223_Pos (31UL) /*!< Position of REGION223 field. */
#define BPROT_CONFIG6_REGION223_Msk (0x1UL << BPROT_CONFIG6_REGION223_Pos) /*!< Bit mask of REGION223 field. */
#define BPROT_CONFIG6_REGION223_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION223_Enabled (1UL) /*!< Protection enable */

/* Bit 30 : Enable protection for region 222. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION222_Pos (30UL) /*!< Position of REGION222 field. */
#define BPROT_CONFIG6_REGION222_Msk (0x1UL << BPROT_CONFIG6_REGION222_Pos) /*!< Bit mask of REGION222 field. */
#define BPROT_CONFIG6_REGION222_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION222_Enabled (1UL) /*!< Protection enable */

/* Bit 29 : Enable protection for region 221. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION221_Pos (29UL) /*!< Position of REGION221 field. */
#define BPROT_CONFIG6_REGION221_Msk (0x1UL << BPROT_CONFIG6_REGION221_Pos) /*!< Bit mask of REGION221 field. */
#define BPROT_CONFIG6_REGION221_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION221_Enabled (1UL) /*!< Protection enable */

/* Bit 28 : Enable protection for region 220. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION220_Pos (28UL) /*!< Position of REGION220 field. */
#define BPROT_CONFIG6_REGION220_Msk (0x1UL << BPROT_CONFIG6_REGION220_Pos) /*!< Bit mask of REGION220 field. */
#define BPROT_CONFIG6_REGION220_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION220_Enabled (1UL) /*!< Protection enable */

/* Bit 27 : Enable protection for region 219. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION219_Pos (27UL) /*!< Position of REGION219 field. */
#define BPROT_CONFIG6_REGION219_Msk (0x1UL << BPROT_CONFIG6_REGION219_Pos) /*!< Bit mask of REGION219 field. */
#define BPROT_CONFIG6_REGION219_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION219_Enabled (1UL) /*!< Protection enable */

/* Bit 26 : Enable protection for region 218. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION218_Pos (26UL) /*!< Position of REGION218 field. */
#define BPROT_CONFIG6_REGION218_Msk (0x1UL << BPROT_CONFIG6_REGION218_Pos) /*!< Bit mask of REGION218 field. */
#define BPROT_CONFIG6_REGION218_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION218_Enabled (1UL) /*!< Protection enable */

/* Bit 25 : Enable protection for region 217. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION217_Pos (25UL) /*!< Position of REGION217 field. */
#define BPROT_CONFIG6_REGION217_Msk (0x1UL << BPROT_CONFIG6_REGION217_Pos) /*!< Bit mask of REGION217 field. */
#define BPROT_CONFIG6_REGION217_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION217_Enabled (1UL) /*!< Protection enable */

/* Bit 24 : Enable protection for region 216. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION216_Pos (24UL) /*!< Position of REGION216 field. */
#define BPROT_CONFIG6_REGION216_Msk (0x1UL << BPROT_CONFIG6_REGION216_Pos) /*!< Bit mask of REGION216 field. */
#define BPROT_CONFIG6_REGION216_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION216_Enabled (1UL) /*!< Protection enable */

/* Bit 23 : Enable protection for region 215. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION215_Pos (23UL) /*!< Position of REGION215 field. */
#define BPROT_CONFIG6_REGION215_Msk (0x1UL << BPROT_CONFIG6_REGION215_Pos) /*!< Bit mask of REGION215 field. */
#define BPROT_CONFIG6_REGION215_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION215_Enabled (1UL) /*!< Protection enable */

/* Bit 22 : Enable protection for region 214. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION214_Pos (22UL) /*!< Position of REGION214 field. */
#define BPROT_CONFIG6_REGION214_Msk (0x1UL << BPROT_CONFIG6_REGION214_Pos) /*!< Bit mask of REGION214 field. */
#define BPROT_CONFIG6_REGION214_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION214_Enabled (1UL) /*!< Protection enable */

/* Bit 21 : Enable protection for region 213. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION213_Pos (21UL) /*!< Position of REGION213 field. */
#define BPROT_CONFIG6_REGION213_Msk (0x1UL << BPROT_CONFIG6_REGION213_Pos) /*!< Bit mask of REGION213 field. */
#define BPROT_CONFIG6_REGION213_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION213_Enabled (1UL) /*!< Protection enable */

/* Bit 20 : Enable protection for region 212. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION212_Pos (20UL) /*!< Position of REGION212 field. */
#define BPROT_CONFIG6_REGION212_Msk (0x1UL << BPROT_CONFIG6_REGION212_Pos) /*!< Bit mask of REGION212 field. */
#define BPROT_CONFIG6_REGION212_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION212_Enabled (1UL) /*!< Protection enable */

/* Bit 19 : Enable protection for region 211. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION211_Pos (19UL) /*!< Position of REGION211 field. */
#define BPROT_CONFIG6_REGION211_Msk (0x1UL << BPROT_CONFIG6_REGION211_Pos) /*!< Bit mask of REGION211 field. */
#define BPROT_CONFIG6_REGION211_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION211_Enabled (1UL) /*!< Protection enable */

/* Bit 18 : Enable protection for region 210. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION210_Pos (18UL) /*!< Position of REGION210 field. */
#define BPROT_CONFIG6_REGION210_Msk (0x1UL << BPROT_CONFIG6_REGION210_Pos) /*!< Bit mask of REGION210 field. */
#define BPROT_CONFIG6_REGION210_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION210_Enabled (1UL) /*!< Protection enable */

/* Bit 17 : Enable protection for region 209. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION209_Pos (17UL) /*!< Position of REGION209 field. */
#define BPROT_CONFIG6_REGION209_Msk (0x1UL << BPROT_CONFIG6_REGION209_Pos) /*!< Bit mask of REGION209 field. */
#define BPROT_CONFIG6_REGION209_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION209_Enabled (1UL) /*!< Protection enable */

/* Bit 16 : Enable protection for region 208. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION208_Pos (16UL) /*!< Position of REGION208 field. */
#define BPROT_CONFIG6_REGION208_Msk (0x1UL << BPROT_CONFIG6_REGION208_Pos) /*!< Bit mask of REGION208 field. */
#define BPROT_CONFIG6_REGION208_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION208_Enabled (1UL) /*!< Protection enable */

/* Bit 15 : Enable protection for region 207. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION207_Pos (15UL) /*!< Position of REGION207 field. */
#define BPROT_CONFIG6_REGION207_Msk (0x1UL << BPROT_CONFIG6_REGION207_Pos) /*!< Bit mask of REGION207 field. */
#define BPROT_CONFIG6_REGION207_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION207_Enabled (1UL) /*!< Protection enable */

/* Bit 14 : Enable protection for region 206. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION206_Pos (14UL) /*!< Position of REGION206 field. */
#define BPROT_CONFIG6_REGION206_Msk (0x1UL << BPROT_CONFIG6_REGION206_Pos) /*!< Bit mask of REGION206 field. */
#define BPROT_CONFIG6_REGION206_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION206_Enabled (1UL) /*!< Protection enable */

/* Bit 13 : Enable protection for region 205. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION205_Pos (13UL) /*!< Position of REGION205 field. */
#define BPROT_CONFIG6_REGION205_Msk (0x1UL << BPROT_CONFIG6_REGION205_Pos) /*!< Bit mask of REGION205 field. */
#define BPROT_CONFIG6_REGION205_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION205_Enabled (1UL) /*!< Protection enable */

/* Bit 12 : Enable protection for region 204. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION204_Pos (12UL) /*!< Position of REGION204 field. */
#define BPROT_CONFIG6_REGION204_Msk (0x1UL << BPROT_CONFIG6_REGION204_Pos) /*!< Bit mask of REGION204 field. */
#define BPROT_CONFIG6_REGION204_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION204_Enabled (1UL) /*!< Protection enable */

