adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 11 : Enable protection for region 203. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION203_Pos (11UL) /*!< Position of REGION203 field. */
#define BPROT_CONFIG6_REGION203_Msk (0x1UL << BPROT_CONFIG6_REGION203_Pos) /*!< Bit mask of REGION203 field. */
#define BPROT_CONFIG6_REGION203_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION203_Enabled (1UL) /*!< Protection enable */

/* Bit 10 : Enable protection for region 202. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION202_Pos (10UL) /*!< Position of REGION202 field. */
#define BPROT_CONFIG6_REGION202_Msk (0x1UL << BPROT_CONFIG6_REGION202_Pos) /*!< Bit mask of REGION202 field. */
#define BPROT_CONFIG6_REGION202_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION202_Enabled (1UL) /*!< Protection enable */

/* Bit 9 : Enable protection for region 201. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION201_Pos (9UL) /*!< Position of REGION201 field. */
#define BPROT_CONFIG6_REGION201_Msk (0x1UL << BPROT_CONFIG6_REGION201_Pos) /*!< Bit mask of REGION201 field. */
#define BPROT_CONFIG6_REGION201_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION201_Enabled (1UL) /*!< Protection enable */

/* Bit 8 : Enable protection for region 200. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION200_Pos (8UL) /*!< Position of REGION200 field. */
#define BPROT_CONFIG6_REGION200_Msk (0x1UL << BPROT_CONFIG6_REGION200_Pos) /*!< Bit mask of REGION200 field. */
#define BPROT_CONFIG6_REGION200_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION200_Enabled (1UL) /*!< Protection enable */

/* Bit 7 : Enable protection for region 199. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION199_Pos (7UL) /*!< Position of REGION199 field. */
#define BPROT_CONFIG6_REGION199_Msk (0x1UL << BPROT_CONFIG6_REGION199_Pos) /*!< Bit mask of REGION199 field. */
#define BPROT_CONFIG6_REGION199_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION199_Enabled (1UL) /*!< Protection enable */

/* Bit 6 : Enable protection for region 198. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION198_Pos (6UL) /*!< Position of REGION198 field. */
#define BPROT_CONFIG6_REGION198_Msk (0x1UL << BPROT_CONFIG6_REGION198_Pos) /*!< Bit mask of REGION198 field. */
#define BPROT_CONFIG6_REGION198_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION198_Enabled (1UL) /*!< Protection enable */

/* Bit 5 : Enable protection for region 197. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION197_Pos (5UL) /*!< Position of REGION197 field. */
#define BPROT_CONFIG6_REGION197_Msk (0x1UL << BPROT_CONFIG6_REGION197_Pos) /*!< Bit mask of REGION197 field. */
#define BPROT_CONFIG6_REGION197_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION197_Enabled (1UL) /*!< Protection enable */

/* Bit 4 : Enable protection for region 196. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION196_Pos (4UL) /*!< Position of REGION196 field. */
#define BPROT_CONFIG6_REGION196_Msk (0x1UL << BPROT_CONFIG6_REGION196_Pos) /*!< Bit mask of REGION196 field. */
#define BPROT_CONFIG6_REGION196_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION196_Enabled (1UL) /*!< Protection enable */

/* Bit 3 : Enable protection for region 195. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION195_Pos (3UL) /*!< Position of REGION195 field. */
#define BPROT_CONFIG6_REGION195_Msk (0x1UL << BPROT_CONFIG6_REGION195_Pos) /*!< Bit mask of REGION195 field. */
#define BPROT_CONFIG6_REGION195_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION195_Enabled (1UL) /*!< Protection enable */

/* Bit 2 : Enable protection for region 194. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION194_Pos (2UL) /*!< Position of REGION194 field. */
#define BPROT_CONFIG6_REGION194_Msk (0x1UL << BPROT_CONFIG6_REGION194_Pos) /*!< Bit mask of REGION194 field. */
#define BPROT_CONFIG6_REGION194_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION194_Enabled (1UL) /*!< Protection enable */

/* Bit 1 : Enable protection for region 193. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION193_Pos (1UL) /*!< Position of REGION193 field. */
#define BPROT_CONFIG6_REGION193_Msk (0x1UL << BPROT_CONFIG6_REGION193_Pos) /*!< Bit mask of REGION193 field. */
#define BPROT_CONFIG6_REGION193_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION193_Enabled (1UL) /*!< Protection enable */

/* Bit 0 : Enable protection for region 192. Write '0' has no effect. */
#define BPROT_CONFIG6_REGION192_Pos (0UL) /*!< Position of REGION192 field. */
#define BPROT_CONFIG6_REGION192_Msk (0x1UL << BPROT_CONFIG6_REGION192_Pos) /*!< Bit mask of REGION192 field. */
#define BPROT_CONFIG6_REGION192_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG6_REGION192_Enabled (1UL) /*!< Protection enable */

/* Register: BPROT_CONFIG7 */
/* Description: Block protect configuration register 0 */

/* Bit 31 : Enable protection for region 255. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION255_Pos (31UL) /*!< Position of REGION255 field. */
#define BPROT_CONFIG7_REGION255_Msk (0x1UL << BPROT_CONFIG7_REGION255_Pos) /*!< Bit mask of REGION255 field. */
#define BPROT_CONFIG7_REGION255_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION255_Enabled (1UL) /*!< Protection enable */

/* Bit 30 : Enable protection for region 254. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION254_Pos (30UL) /*!< Position of REGION254 field. */
#define BPROT_CONFIG7_REGION254_Msk (0x1UL << BPROT_CONFIG7_REGION254_Pos) /*!< Bit mask of REGION254 field. */
#define BPROT_CONFIG7_REGION254_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION254_Enabled (1UL) /*!< Protection enable */

/* Bit 29 : Enable protection for region 253. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION253_Pos (29UL) /*!< Position of REGION253 field. */
#define BPROT_CONFIG7_REGION253_Msk (0x1UL << BPROT_CONFIG7_REGION253_Pos) /*!< Bit mask of REGION253 field. */
#define BPROT_CONFIG7_REGION253_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION253_Enabled (1UL) /*!< Protection enable */

