adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 28 : Enable protection for region 252. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION252_Pos (28UL) /*!< Position of REGION252 field. */
#define BPROT_CONFIG7_REGION252_Msk (0x1UL << BPROT_CONFIG7_REGION252_Pos) /*!< Bit mask of REGION252 field. */
#define BPROT_CONFIG7_REGION252_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION252_Enabled (1UL) /*!< Protection enable */

/* Bit 27 : Enable protection for region 251. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION251_Pos (27UL) /*!< Position of REGION251 field. */
#define BPROT_CONFIG7_REGION251_Msk (0x1UL << BPROT_CONFIG7_REGION251_Pos) /*!< Bit mask of REGION251 field. */
#define BPROT_CONFIG7_REGION251_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION251_Enabled (1UL) /*!< Protection enable */

/* Bit 26 : Enable protection for region 250. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION250_Pos (26UL) /*!< Position of REGION250 field. */
#define BPROT_CONFIG7_REGION250_Msk (0x1UL << BPROT_CONFIG7_REGION250_Pos) /*!< Bit mask of REGION250 field. */
#define BPROT_CONFIG7_REGION250_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION250_Enabled (1UL) /*!< Protection enable */

/* Bit 25 : Enable protection for region 249. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION249_Pos (25UL) /*!< Position of REGION249 field. */
#define BPROT_CONFIG7_REGION249_Msk (0x1UL << BPROT_CONFIG7_REGION249_Pos) /*!< Bit mask of REGION249 field. */
#define BPROT_CONFIG7_REGION249_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION249_Enabled (1UL) /*!< Protection enable */

/* Bit 24 : Enable protection for region 248. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION248_Pos (24UL) /*!< Position of REGION248 field. */
#define BPROT_CONFIG7_REGION248_Msk (0x1UL << BPROT_CONFIG7_REGION248_Pos) /*!< Bit mask of REGION248 field. */
#define BPROT_CONFIG7_REGION248_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION248_Enabled (1UL) /*!< Protection enable */

/* Bit 23 : Enable protection for region 247. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION247_Pos (23UL) /*!< Position of REGION247 field. */
#define BPROT_CONFIG7_REGION247_Msk (0x1UL << BPROT_CONFIG7_REGION247_Pos) /*!< Bit mask of REGION247 field. */
#define BPROT_CONFIG7_REGION247_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION247_Enabled (1UL) /*!< Protection enable */

/* Bit 22 : Enable protection for region 246. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION246_Pos (22UL) /*!< Position of REGION246 field. */
#define BPROT_CONFIG7_REGION246_Msk (0x1UL << BPROT_CONFIG7_REGION246_Pos) /*!< Bit mask of REGION246 field. */
#define BPROT_CONFIG7_REGION246_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION246_Enabled (1UL) /*!< Protection enable */

/* Bit 21 : Enable protection for region 245. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION245_Pos (21UL) /*!< Position of REGION245 field. */
#define BPROT_CONFIG7_REGION245_Msk (0x1UL << BPROT_CONFIG7_REGION245_Pos) /*!< Bit mask of REGION245 field. */
#define BPROT_CONFIG7_REGION245_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION245_Enabled (1UL) /*!< Protection enable */

/* Bit 20 : Enable protection for region 244. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION244_Pos (20UL) /*!< Position of REGION244 field. */
#define BPROT_CONFIG7_REGION244_Msk (0x1UL << BPROT_CONFIG7_REGION244_Pos) /*!< Bit mask of REGION244 field. */
#define BPROT_CONFIG7_REGION244_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION244_Enabled (1UL) /*!< Protection enable */

/* Bit 19 : Enable protection for region 243. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION243_Pos (19UL) /*!< Position of REGION243 field. */
#define BPROT_CONFIG7_REGION243_Msk (0x1UL << BPROT_CONFIG7_REGION243_Pos) /*!< Bit mask of REGION243 field. */
#define BPROT_CONFIG7_REGION243_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION243_Enabled (1UL) /*!< Protection enable */

/* Bit 18 : Enable protection for region 242. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION242_Pos (18UL) /*!< Position of REGION242 field. */
#define BPROT_CONFIG7_REGION242_Msk (0x1UL << BPROT_CONFIG7_REGION242_Pos) /*!< Bit mask of REGION242 field. */
#define BPROT_CONFIG7_REGION242_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION242_Enabled (1UL) /*!< Protection enable */

/* Bit 17 : Enable protection for region 241. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION241_Pos (17UL) /*!< Position of REGION241 field. */
#define BPROT_CONFIG7_REGION241_Msk (0x1UL << BPROT_CONFIG7_REGION241_Pos) /*!< Bit mask of REGION241 field. */
#define BPROT_CONFIG7_REGION241_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION241_Enabled (1UL) /*!< Protection enable */

/* Bit 16 : Enable protection for region 240. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION240_Pos (16UL) /*!< Position of REGION240 field. */
#define BPROT_CONFIG7_REGION240_Msk (0x1UL << BPROT_CONFIG7_REGION240_Pos) /*!< Bit mask of REGION240 field. */
#define BPROT_CONFIG7_REGION240_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION240_Enabled (1UL) /*!< Protection enable */

/* Bit 15 : Enable protection for region 239. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION239_Pos (15UL) /*!< Position of REGION239 field. */
#define BPROT_CONFIG7_REGION239_Msk (0x1UL << BPROT_CONFIG7_REGION239_Pos) /*!< Bit mask of REGION239 field. */
#define BPROT_CONFIG7_REGION239_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION239_Enabled (1UL) /*!< Protection enable */

/* Bit 14 : Enable protection for region 238. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION238_Pos (14UL) /*!< Position of REGION238 field. */
#define BPROT_CONFIG7_REGION238_Msk (0x1UL << BPROT_CONFIG7_REGION238_Pos) /*!< Bit mask of REGION238 field. */
#define BPROT_CONFIG7_REGION238_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION238_Enabled (1UL) /*!< Protection enable */

/* Bit 13 : Enable protection for region 237. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION237_Pos (13UL) /*!< Position of REGION237 field. */
#define BPROT_CONFIG7_REGION237_Msk (0x1UL << BPROT_CONFIG7_REGION237_Pos) /*!< Bit mask of REGION237 field. */
#define BPROT_CONFIG7_REGION237_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION237_Enabled (1UL) /*!< Protection enable */

