adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 12 : Enable protection for region 236. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION236_Pos (12UL) /*!< Position of REGION236 field. */
#define BPROT_CONFIG7_REGION236_Msk (0x1UL << BPROT_CONFIG7_REGION236_Pos) /*!< Bit mask of REGION236 field. */
#define BPROT_CONFIG7_REGION236_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION236_Enabled (1UL) /*!< Protection enable */

/* Bit 11 : Enable protection for region 235. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION235_Pos (11UL) /*!< Position of REGION235 field. */
#define BPROT_CONFIG7_REGION235_Msk (0x1UL << BPROT_CONFIG7_REGION235_Pos) /*!< Bit mask of REGION235 field. */
#define BPROT_CONFIG7_REGION235_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION235_Enabled (1UL) /*!< Protection enable */

/* Bit 10 : Enable protection for region 234. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION234_Pos (10UL) /*!< Position of REGION234 field. */
#define BPROT_CONFIG7_REGION234_Msk (0x1UL << BPROT_CONFIG7_REGION234_Pos) /*!< Bit mask of REGION234 field. */
#define BPROT_CONFIG7_REGION234_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION234_Enabled (1UL) /*!< Protection enable */

/* Bit 9 : Enable protection for region 233. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION233_Pos (9UL) /*!< Position of REGION233 field. */
#define BPROT_CONFIG7_REGION233_Msk (0x1UL << BPROT_CONFIG7_REGION233_Pos) /*!< Bit mask of REGION233 field. */
#define BPROT_CONFIG7_REGION233_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION233_Enabled (1UL) /*!< Protection enable */

/* Bit 8 : Enable protection for region 232. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION232_Pos (8UL) /*!< Position of REGION232 field. */
#define BPROT_CONFIG7_REGION232_Msk (0x1UL << BPROT_CONFIG7_REGION232_Pos) /*!< Bit mask of REGION232 field. */
#define BPROT_CONFIG7_REGION232_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION232_Enabled (1UL) /*!< Protection enable */

/* Bit 7 : Enable protection for region 231. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION231_Pos (7UL) /*!< Position of REGION231 field. */
#define BPROT_CONFIG7_REGION231_Msk (0x1UL << BPROT_CONFIG7_REGION231_Pos) /*!< Bit mask of REGION231 field. */
#define BPROT_CONFIG7_REGION231_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION231_Enabled (1UL) /*!< Protection enable */

/* Bit 6 : Enable protection for region 230. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION230_Pos (6UL) /*!< Position of REGION230 field. */
#define BPROT_CONFIG7_REGION230_Msk (0x1UL << BPROT_CONFIG7_REGION230_Pos) /*!< Bit mask of REGION230 field. */
#define BPROT_CONFIG7_REGION230_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION230_Enabled (1UL) /*!< Protection enable */

/* Bit 5 : Enable protection for region 229. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION229_Pos (5UL) /*!< Position of REGION229 field. */
#define BPROT_CONFIG7_REGION229_Msk (0x1UL << BPROT_CONFIG7_REGION229_Pos) /*!< Bit mask of REGION229 field. */
#define BPROT_CONFIG7_REGION229_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION229_Enabled (1UL) /*!< Protection enable */

/* Bit 4 : Enable protection for region 228. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION228_Pos (4UL) /*!< Position of REGION228 field. */
#define BPROT_CONFIG7_REGION228_Msk (0x1UL << BPROT_CONFIG7_REGION228_Pos) /*!< Bit mask of REGION228 field. */
#define BPROT_CONFIG7_REGION228_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION228_Enabled (1UL) /*!< Protection enable */

/* Bit 3 : Enable protection for region 227. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION227_Pos (3UL) /*!< Position of REGION227 field. */
#define BPROT_CONFIG7_REGION227_Msk (0x1UL << BPROT_CONFIG7_REGION227_Pos) /*!< Bit mask of REGION227 field. */
#define BPROT_CONFIG7_REGION227_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION227_Enabled (1UL) /*!< Protection enable */

/* Bit 2 : Enable protection for region 226. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION226_Pos (2UL) /*!< Position of REGION226 field. */
#define BPROT_CONFIG7_REGION226_Msk (0x1UL << BPROT_CONFIG7_REGION226_Pos) /*!< Bit mask of REGION226 field. */
#define BPROT_CONFIG7_REGION226_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION226_Enabled (1UL) /*!< Protection enable */

/* Bit 1 : Enable protection for region 225. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION225_Pos (1UL) /*!< Position of REGION225 field. */
#define BPROT_CONFIG7_REGION225_Msk (0x1UL << BPROT_CONFIG7_REGION225_Pos) /*!< Bit mask of REGION225 field. */
#define BPROT_CONFIG7_REGION225_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION225_Enabled (1UL) /*!< Protection enable */

/* Bit 0 : Enable protection for region 224. Write '0' has no effect. */
#define BPROT_CONFIG7_REGION224_Pos (0UL) /*!< Position of REGION224 field. */
#define BPROT_CONFIG7_REGION224_Msk (0x1UL << BPROT_CONFIG7_REGION224_Pos) /*!< Bit mask of REGION224 field. */
#define BPROT_CONFIG7_REGION224_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG7_REGION224_Enabled (1UL) /*!< Protection enable */


/* Peripheral: DCLOCK */
/* Description: Clock Management */

/* Register: DCLOCK_TASKS_HFCLKSTART */
/* Description: Start HFCLK crystal oscillator */

/* Bit 0 : Start HFCLK crystal oscillator */
#define DCLOCK_TASKS_HFCLKSTART_TASKS_HFCLKSTART_Pos (0UL) /*!< Position of TASKS_HFCLKSTART field. */
#define DCLOCK_TASKS_HFCLKSTART_TASKS_HFCLKSTART_Msk (0x1UL << DCLOCK_TASKS_HFCLKSTART_TASKS_HFCLKSTART_Pos) /*!< Bit mask of TASKS_HFCLKSTART field. */
#define DCLOCK_TASKS_HFCLKSTART_TASKS_HFCLKSTART_Trigger (1UL) /*!< Trigger task */

/* Register: DCLOCK_TASKS_HFCLKSTOP */
/* Description: Stop HFCLK crystal oscillator */

/* Bit 0 : Stop HFCLK crystal oscillator */
#define DCLOCK_TASKS_HFCLKSTOP_TASKS_HFCLKSTOP_Pos (0UL) /*!< Position of TASKS_HFCLKSTOP field. */
#define DCLOCK_TASKS_HFCLKSTOP_TASKS_HFCLKSTOP_Msk (0x1UL << DCLOCK_TASKS_HFCLKSTOP_TASKS_HFCLKSTOP_Pos) /*!< Bit mask of TASKS_HFCLKSTOP field. */
#define DCLOCK_TASKS_HFCLKSTOP_TASKS_HFCLKSTOP_Trigger (1UL) /*!< Trigger task */

/* Register: DCLOCK_TASKS_LFCLKSTART */
/* Description: Start LFCLK source */

/* Bit 0 : Start LFCLK source */
#define DCLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Pos (0UL) /*!< Position of TASKS_LFCLKSTART field. */
#define DCLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Msk (0x1UL << DCLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Pos) /*!< Bit mask of TASKS_LFCLKSTART field. */
#define DCLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Trigger (1UL) /*!< Trigger task */

/* Register: DCLOCK_TASKS_LFCLKSTOP */
/* Description: Stop LFCLK source */

/* Bit 0 : Stop LFCLK source */
#define DCLOCK_TASKS_LFCLKSTOP_TASKS_LFCLKSTOP_Pos (0UL) /*!< Position of TASKS_LFCLKSTOP field. */
#define DCLOCK_TASKS_LFCLKSTOP_TASKS_LFCLKSTOP_Msk (0x1UL << DCLOCK_TASKS_LFCLKSTOP_TASKS_LFCLKSTOP_Pos) /*!< Bit mask of TASKS_LFCLKSTOP field. */
#define DCLOCK_TASKS_LFCLKSTOP_TASKS_LFCLKSTOP_Trigger (1UL) /*!< Trigger task */

/* Register: DCLOCK_EVENTS_HFCLKSTARTED */
/* Description: HFCLK oscillator started */

/* Bit 0 : HFCLK oscillator started */
#define DCLOCK_EVENTS_HFCLKSTARTED_EVENTS_HFCLKSTARTED_Pos (0UL) /*!< Position of EVENTS_HFCLKSTARTED field. */
#define DCLOCK_EVENTS_HFCLKSTARTED_EVENTS_HFCLKSTARTED_Msk (0x1UL << DCLOCK_EVENTS_HFCLKSTARTED_EVENTS_HFCLKSTARTED_Pos) /*!< Bit mask of EVENTS_HFCLKSTARTED field. */
#define DCLOCK_EVENTS_HFCLKSTARTED_EVENTS_HFCLKSTARTED_NotGenerated (0UL) /*!< Event not generated */
#define DCLOCK_EVENTS_HFCLKSTARTED_EVENTS_HFCLKSTARTED_Generated (1UL) /*!< Event generated */

/* Register: DCLOCK_EVENTS_LFCLKSTARTED */
/* Description: LFCLK started */

/* Bit 0 : LFCLK started */
#define DCLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Pos (0UL) /*!< Position of EVENTS_LFCLKSTARTED field. */
#define DCLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Msk (0x1UL << DCLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Pos) /*!< Bit mask of EVENTS_LFCLKSTARTED field. */
#define DCLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_NotGenerated (0UL) /*!< Event not generated */
#define DCLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Generated (1UL) /*!< Event generated */

/* Register: DCLOCK_INTEN */
/* Description: Enable or disable interrupt */

