adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 1 : Enable or disable interrupt for event LFCLKSTARTED */
#define DCLOCK_INTEN_LFCLKSTARTED_Pos (1UL) /*!< Position of LFCLKSTARTED field. */
#define DCLOCK_INTEN_LFCLKSTARTED_Msk (0x1UL << DCLOCK_INTEN_LFCLKSTARTED_Pos) /*!< Bit mask of LFCLKSTARTED field. */
#define DCLOCK_INTEN_LFCLKSTARTED_Disabled (0UL) /*!< Disable */
#define DCLOCK_INTEN_LFCLKSTARTED_Enabled (1UL) /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event HFCLKSTARTED */
#define DCLOCK_INTEN_HFCLKSTARTED_Pos (0UL) /*!< Position of HFCLKSTARTED field. */
#define DCLOCK_INTEN_HFCLKSTARTED_Msk (0x1UL << DCLOCK_INTEN_HFCLKSTARTED_Pos) /*!< Bit mask of HFCLKSTARTED field. */
#define DCLOCK_INTEN_HFCLKSTARTED_Disabled (0UL) /*!< Disable */
#define DCLOCK_INTEN_HFCLKSTARTED_Enabled (1UL) /*!< Enable */

/* Register: DCLOCK_INTENSET */
/* Description: Enable interrupt */

/* Bit 1 : Write '1' to enable interrupt for event LFCLKSTARTED */
#define DCLOCK_INTENSET_LFCLKSTARTED_Pos (1UL) /*!< Position of LFCLKSTARTED field. */
#define DCLOCK_INTENSET_LFCLKSTARTED_Msk (0x1UL << DCLOCK_INTENSET_LFCLKSTARTED_Pos) /*!< Bit mask of LFCLKSTARTED field. */
#define DCLOCK_INTENSET_LFCLKSTARTED_Disabled (0UL) /*!< Read: Disabled */
#define DCLOCK_INTENSET_LFCLKSTARTED_Enabled (1UL) /*!< Read: Enabled */
#define DCLOCK_INTENSET_LFCLKSTARTED_Set (1UL) /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event HFCLKSTARTED */
#define DCLOCK_INTENSET_HFCLKSTARTED_Pos (0UL) /*!< Position of HFCLKSTARTED field. */
#define DCLOCK_INTENSET_HFCLKSTARTED_Msk (0x1UL << DCLOCK_INTENSET_HFCLKSTARTED_Pos) /*!< Bit mask of HFCLKSTARTED field. */
#define DCLOCK_INTENSET_HFCLKSTARTED_Disabled (0UL) /*!< Read: Disabled */
#define DCLOCK_INTENSET_HFCLKSTARTED_Enabled (1UL) /*!< Read: Enabled */
#define DCLOCK_INTENSET_HFCLKSTARTED_Set (1UL) /*!< Enable */

/* Register: DCLOCK_INTENCLR */
/* Description: Disable interrupt */

/* Bit 1 : Write '1' to disable interrupt for event LFCLKSTARTED */
#define DCLOCK_INTENCLR_LFCLKSTARTED_Pos (1UL) /*!< Position of LFCLKSTARTED field. */
#define DCLOCK_INTENCLR_LFCLKSTARTED_Msk (0x1UL << DCLOCK_INTENCLR_LFCLKSTARTED_Pos) /*!< Bit mask of LFCLKSTARTED field. */
#define DCLOCK_INTENCLR_LFCLKSTARTED_Disabled (0UL) /*!< Read: Disabled */
#define DCLOCK_INTENCLR_LFCLKSTARTED_Enabled (1UL) /*!< Read: Enabled */
#define DCLOCK_INTENCLR_LFCLKSTARTED_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event HFCLKSTARTED */
#define DCLOCK_INTENCLR_HFCLKSTARTED_Pos (0UL) /*!< Position of HFCLKSTARTED field. */
#define DCLOCK_INTENCLR_HFCLKSTARTED_Msk (0x1UL << DCLOCK_INTENCLR_HFCLKSTARTED_Pos) /*!< Bit mask of HFCLKSTARTED field. */
#define DCLOCK_INTENCLR_HFCLKSTARTED_Disabled (0UL) /*!< Read: Disabled */
#define DCLOCK_INTENCLR_HFCLKSTARTED_Enabled (1UL) /*!< Read: Enabled */
#define DCLOCK_INTENCLR_HFCLKSTARTED_Clear (1UL) /*!< Disable */

/* Register: DCLOCK_INTPEND */
/* Description: Pending interrupts */

/* Bit 1 : Read pending status of interrupt for event LFCLKSTARTED */
#define DCLOCK_INTPEND_LFCLKSTARTED_Pos (1UL) /*!< Position of LFCLKSTARTED field. */
#define DCLOCK_INTPEND_LFCLKSTARTED_Msk (0x1UL << DCLOCK_INTPEND_LFCLKSTARTED_Pos) /*!< Bit mask of LFCLKSTARTED field. */
#define DCLOCK_INTPEND_LFCLKSTARTED_NotPending (0UL) /*!< Read: Not pending */
#define DCLOCK_INTPEND_LFCLKSTARTED_Pending (1UL) /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event HFCLKSTARTED */
#define DCLOCK_INTPEND_HFCLKSTARTED_Pos (0UL) /*!< Position of HFCLKSTARTED field. */
#define DCLOCK_INTPEND_HFCLKSTARTED_Msk (0x1UL << DCLOCK_INTPEND_HFCLKSTARTED_Pos) /*!< Bit mask of HFCLKSTARTED field. */
#define DCLOCK_INTPEND_HFCLKSTARTED_NotPending (0UL) /*!< Read: Not pending */
#define DCLOCK_INTPEND_HFCLKSTARTED_Pending (1UL) /*!< Read: Pending */

/* Register: DCLOCK_HFCLKRUN */
/* Description: Status indicating that HFCLKSTART task has been triggered */

/* Bit 0 : HFCLKSTART task triggered or not */
#define DCLOCK_HFCLKRUN_STATUS_Pos (0UL) /*!< Position of STATUS field. */
#define DCLOCK_HFCLKRUN_STATUS_Msk (0x1UL << DCLOCK_HFCLKRUN_STATUS_Pos) /*!< Bit mask of STATUS field. */
#define DCLOCK_HFCLKRUN_STATUS_NotTriggered (0UL) /*!< Task not triggered */
#define DCLOCK_HFCLKRUN_STATUS_Triggered (1UL) /*!< Task triggered */

/* Register: DCLOCK_HFCLKSTAT */
/* Description: Which HFCLK source is running */

/* Bit 16 : HFCLK state */
#define DCLOCK_HFCLKSTAT_STATE_Pos (16UL) /*!< Position of STATE field. */
#define DCLOCK_HFCLKSTAT_STATE_Msk (0x1UL << DCLOCK_HFCLKSTAT_STATE_Pos) /*!< Bit mask of STATE field. */
#define DCLOCK_HFCLKSTAT_STATE_NotRunning (0UL) /*!< HFCLK not running */
#define DCLOCK_HFCLKSTAT_STATE_Running (1UL) /*!< HFCLK running */

/* Bit 0 : Active clock source */
#define DCLOCK_HFCLKSTAT_SRC_Pos (0UL) /*!< Position of SRC field. */
#define DCLOCK_HFCLKSTAT_SRC_Msk (0x1UL << DCLOCK_HFCLKSTAT_SRC_Pos) /*!< Bit mask of SRC field. */
#define DCLOCK_HFCLKSTAT_SRC_HFINT (0UL) /*!< HFCLK clock source: HFINT - 64 MHz on-chip oscillator */
#define DCLOCK_HFCLKSTAT_SRC_HFXO (1UL) /*!< HFCLK clock source: HFXO - 64 MHz clock derived from external 32 MHz crystal oscillator */

/* Register: DCLOCK_LFCLKRUN */
/* Description: Status indicating that LFCLKSTART task has been triggered */

/* Bit 0 : LFCLKSTART task triggered or not */
#define DCLOCK_LFCLKRUN_STATUS_Pos (0UL) /*!< Position of STATUS field. */
#define DCLOCK_LFCLKRUN_STATUS_Msk (0x1UL << DCLOCK_LFCLKRUN_STATUS_Pos) /*!< Bit mask of STATUS field. */
#define DCLOCK_LFCLKRUN_STATUS_NotTriggered (0UL) /*!< Task not triggered */
#define DCLOCK_LFCLKRUN_STATUS_Triggered (1UL) /*!< Task triggered */

/* Register: DCLOCK_LFCLKSTAT */
/* Description: Which LFCLK source is running */

/* Bit 16 : LFCLK state */
#define DCLOCK_LFCLKSTAT_STATE_Pos (16UL) /*!< Position of STATE field. */
#define DCLOCK_LFCLKSTAT_STATE_Msk (0x1UL << DCLOCK_LFCLKSTAT_STATE_Pos) /*!< Bit mask of STATE field. */
#define DCLOCK_LFCLKSTAT_STATE_NotRunning (0UL) /*!< LFCLK not running */
#define DCLOCK_LFCLKSTAT_STATE_Running (1UL) /*!< LFCLK running */

/* Bits 1..0 : Active clock source */
#define DCLOCK_LFCLKSTAT_SRC_Pos (0UL) /*!< Position of SRC field. */
#define DCLOCK_LFCLKSTAT_SRC_Msk (0x3UL << DCLOCK_LFCLKSTAT_SRC_Pos) /*!< Bit mask of SRC field. */
#define DCLOCK_LFCLKSTAT_SRC_LFULP (0UL) /*!< 32.768 kHz ultra low power RC oscillator */
#define DCLOCK_LFCLKSTAT_SRC_LFRC (1UL) /*!< 32.768 kHz RC oscillator */
#define DCLOCK_LFCLKSTAT_SRC_LFXO (2UL) /*!< 32.768 kHz crystal oscillator */
#define DCLOCK_LFCLKSTAT_SRC_LFSYNT (3UL) /*!< 32.768 kHz synthesized from HFCLK */

