adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Register: DES_TASKS_DES_DECRYPT_2 */
/* Description: Starts DES decryption with keyset 2 (output -&gt; output) */

/* Bit 0 : Starts DES decryption with keyset 2 (output -&gt; output) */
#define DES_TASKS_DES_DECRYPT_2_TASKS_DES_DECRYPT_2_Pos (0UL) /*!< Position of TASKS_DES_DECRYPT_2 field. */
#define DES_TASKS_DES_DECRYPT_2_TASKS_DES_DECRYPT_2_Msk (0x1UL << DES_TASKS_DES_DECRYPT_2_TASKS_DES_DECRYPT_2_Pos) /*!< Bit mask of TASKS_DES_DECRYPT_2 field. */
#define DES_TASKS_DES_DECRYPT_2_TASKS_DES_DECRYPT_2_Trigger (1UL) /*!< Trigger task */

/* Register: DES_TASKS_DES_ENCRYPT_3 */
/* Description: Starts DES encryption with keyset 3 (output -&gt; output) */

/* Bit 0 : Starts DES encryption with keyset 3 (output -&gt; output) */
#define DES_TASKS_DES_ENCRYPT_3_TASKS_DES_ENCRYPT_3_Pos (0UL) /*!< Position of TASKS_DES_ENCRYPT_3 field. */
#define DES_TASKS_DES_ENCRYPT_3_TASKS_DES_ENCRYPT_3_Msk (0x1UL << DES_TASKS_DES_ENCRYPT_3_TASKS_DES_ENCRYPT_3_Pos) /*!< Bit mask of TASKS_DES_ENCRYPT_3 field. */
#define DES_TASKS_DES_ENCRYPT_3_TASKS_DES_ENCRYPT_3_Trigger (1UL) /*!< Trigger task */

/* Register: DES_TASKS_DES_DECRYPT_3 */
/* Description: Starts DES decryption with keyset 3 (output -&gt; output) */

/* Bit 0 : Starts DES decryption with keyset 3 (output -&gt; output) */
#define DES_TASKS_DES_DECRYPT_3_TASKS_DES_DECRYPT_3_Pos (0UL) /*!< Position of TASKS_DES_DECRYPT_3 field. */
#define DES_TASKS_DES_DECRYPT_3_TASKS_DES_DECRYPT_3_Msk (0x1UL << DES_TASKS_DES_DECRYPT_3_TASKS_DES_DECRYPT_3_Pos) /*!< Bit mask of TASKS_DES_DECRYPT_3 field. */
#define DES_TASKS_DES_DECRYPT_3_TASKS_DES_DECRYPT_3_Trigger (1UL) /*!< Trigger task */

/* Register: DES_TASKS_DRAIN_DES_OUTPUT */
/* Description: Transfer 8 bytes of output from DES core to DMA */

/* Bit 0 : Transfer 8 bytes of output from DES core to DMA */
#define DES_TASKS_DRAIN_DES_OUTPUT_TASKS_DRAIN_DES_OUTPUT_Pos (0UL) /*!< Position of TASKS_DRAIN_DES_OUTPUT field. */
#define DES_TASKS_DRAIN_DES_OUTPUT_TASKS_DRAIN_DES_OUTPUT_Msk (0x1UL << DES_TASKS_DRAIN_DES_OUTPUT_TASKS_DRAIN_DES_OUTPUT_Pos) /*!< Bit mask of TASKS_DRAIN_DES_OUTPUT field. */
#define DES_TASKS_DRAIN_DES_OUTPUT_TASKS_DRAIN_DES_OUTPUT_Trigger (1UL) /*!< Trigger task */

/* Register: DES_TASKS_RESET */
/* Description: Stop all transfers and crypto operations (software reset) */

/* Bit 0 : Stop all transfers and crypto operations (software reset) */
#define DES_TASKS_RESET_TASKS_RESET_Pos (0UL) /*!< Position of TASKS_RESET field. */
#define DES_TASKS_RESET_TASKS_RESET_Msk (0x1UL << DES_TASKS_RESET_TASKS_RESET_Pos) /*!< Bit mask of TASKS_RESET field. */
#define DES_TASKS_RESET_TASKS_RESET_Trigger (1UL) /*!< Trigger task */

/* Register: DES_TASKZEROPENALTY_PCP_1 */
/* Description: TaskZeroPenalty register for PCP 1 */

/* Bit 0 :   */
#define DES_TASKZEROPENALTY_PCP_1_ZERO_PENALTY_Pos (0UL) /*!< Position of ZERO_PENALTY field. */
#define DES_TASKZEROPENALTY_PCP_1_ZERO_PENALTY_Msk (0x1UL << DES_TASKZEROPENALTY_PCP_1_ZERO_PENALTY_Pos) /*!< Bit mask of ZERO_PENALTY field. */
#define DES_TASKZEROPENALTY_PCP_1_ZERO_PENALTY_SET_ZERO_PENALTY (1UL) /*!< Set Zero Penalty */

/* Register: DES_TASKFULLPENALTY_PCP_1 */
/* Description: TaskFullPenalty register for PCP 1 */

/* Bit 0 :   */
#define DES_TASKFULLPENALTY_PCP_1_FULL_PENALTY_Pos (0UL) /*!< Position of FULL_PENALTY field. */
#define DES_TASKFULLPENALTY_PCP_1_FULL_PENALTY_Msk (0x1UL << DES_TASKFULLPENALTY_PCP_1_FULL_PENALTY_Pos) /*!< Bit mask of FULL_PENALTY field. */
#define DES_TASKFULLPENALTY_PCP_1_FULL_PENALTY_SET_FULL_PENALTY (1UL) /*!< Set Full Penalty */

/* Register: DES_TASKZEROPENALTY_PCP_0 */
/* Description: TaskZeroPenalty register for PCP 0 */

/* Bit 0 :   */
#define DES_TASKZEROPENALTY_PCP_0_ZERO_PENALTY_Pos (0UL) /*!< Position of ZERO_PENALTY field. */
#define DES_TASKZEROPENALTY_PCP_0_ZERO_PENALTY_Msk (0x1UL << DES_TASKZEROPENALTY_PCP_0_ZERO_PENALTY_Pos) /*!< Bit mask of ZERO_PENALTY field. */
#define DES_TASKZEROPENALTY_PCP_0_ZERO_PENALTY_SET_ZERO_PENALTY (1UL) /*!< Set Zero Penalty */

/* Register: DES_TASKFULLPENALTY_PCP_0 */
/* Description: TaskFullPenalty register for PCP 0 */

/* Bit 0 :   */
#define DES_TASKFULLPENALTY_PCP_0_FULL_PENALTY_Pos (0UL) /*!< Position of FULL_PENALTY field. */
#define DES_TASKFULLPENALTY_PCP_0_FULL_PENALTY_Msk (0x1UL << DES_TASKFULLPENALTY_PCP_0_FULL_PENALTY_Pos) /*!< Bit mask of FULL_PENALTY field. */
#define DES_TASKFULLPENALTY_PCP_0_FULL_PENALTY_SET_FULL_PENALTY (1UL) /*!< Set Full Penalty */

/* Register: DES_EVENTS_GATHER_STARTED */
/* Description: Input DMA started */

/* Bit 0 : Input DMA started */
#define DES_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Pos (0UL) /*!< Position of EVENTS_GATHER_STARTED field. */
#define DES_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Msk (0x1UL << DES_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Pos) /*!< Bit mask of EVENTS_GATHER_STARTED field. */
#define DES_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_NotGenerated (0UL) /*!< Event not generated */
#define DES_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Generated (1UL) /*!< Event generated */

/* Register: DES_EVENTS_GATHER_DONE */
/* Description: Input DMA done */

/* Bit 0 : Input DMA done */
#define DES_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Pos (0UL) /*!< Position of EVENTS_GATHER_DONE field. */
#define DES_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Msk (0x1UL << DES_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Pos) /*!< Bit mask of EVENTS_GATHER_DONE field. */
#define DES_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_NotGenerated (0UL) /*!< Event not generated */
#define DES_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Generated (1UL) /*!< Event generated */

/* Register: DES_EVENTS_SCATTER_STARTED */
/* Description: Output DMA started */

/* Bit 0 : Output DMA started */
#define DES_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_Pos (0UL) /*!< Position of EVENTS_SCATTER_STARTED field. */
#define DES_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_Msk (0x1UL << DES_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_Pos) /*!< Bit mask of EVENTS_SCATTER_STARTED field. */
#define DES_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_NotGenerated (0UL) /*!< Event not generated */
#define DES_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_Generated (1UL) /*!< Event generated */

/* Register: DES_EVENTS_SCATTER_DONE */
/* Description: Output DMA done */

