adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 12 : Shortcut between event KEY_3_READY and task INITIALIZE_DES */
#define DES_SHORTS_KEY_3_READY_INITIALIZE_DES_Pos (12UL) /*!< Position of KEY_3_READY_INITIALIZE_DES field. */
#define DES_SHORTS_KEY_3_READY_INITIALIZE_DES_Msk (0x1UL << DES_SHORTS_KEY_3_READY_INITIALIZE_DES_Pos) /*!< Bit mask of KEY_3_READY_INITIALIZE_DES field. */
#define DES_SHORTS_KEY_3_READY_INITIALIZE_DES_Disabled (0UL) /*!< Disable shortcut */
#define DES_SHORTS_KEY_3_READY_INITIALIZE_DES_Enabled (1UL) /*!< Enable shortcut */

/* Bit 11 : Shortcut between event KEY_1_READY and task INITIALIZE_DES */
#define DES_SHORTS_KEY_1_READY_INITIALIZE_DES_Pos (11UL) /*!< Position of KEY_1_READY_INITIALIZE_DES field. */
#define DES_SHORTS_KEY_1_READY_INITIALIZE_DES_Msk (0x1UL << DES_SHORTS_KEY_1_READY_INITIALIZE_DES_Pos) /*!< Bit mask of KEY_1_READY_INITIALIZE_DES field. */
#define DES_SHORTS_KEY_1_READY_INITIALIZE_DES_Disabled (0UL) /*!< Disable shortcut */
#define DES_SHORTS_KEY_1_READY_INITIALIZE_DES_Enabled (1UL) /*!< Enable shortcut */

/* Bit 10 : Shortcut between event IV_READY and task INITIALIZE_DES */
#define DES_SHORTS_IV_READY_INITIALIZE_DES_Pos (10UL) /*!< Position of IV_READY_INITIALIZE_DES field. */
#define DES_SHORTS_IV_READY_INITIALIZE_DES_Msk (0x1UL << DES_SHORTS_IV_READY_INITIALIZE_DES_Pos) /*!< Bit mask of IV_READY_INITIALIZE_DES field. */
#define DES_SHORTS_IV_READY_INITIALIZE_DES_Disabled (0UL) /*!< Disable shortcut */
#define DES_SHORTS_IV_READY_INITIALIZE_DES_Enabled (1UL) /*!< Enable shortcut */

/* Bit 9 : Shortcut between event GATHER_STARTED and task START_SCATTER */
#define DES_SHORTS_GATHER_STARTED_START_SCATTER_Pos (9UL) /*!< Position of GATHER_STARTED_START_SCATTER field. */
#define DES_SHORTS_GATHER_STARTED_START_SCATTER_Msk (0x1UL << DES_SHORTS_GATHER_STARTED_START_SCATTER_Pos) /*!< Bit mask of GATHER_STARTED_START_SCATTER field. */
#define DES_SHORTS_GATHER_STARTED_START_SCATTER_Disabled (0UL) /*!< Disable shortcut */
#define DES_SHORTS_GATHER_STARTED_START_SCATTER_Enabled (1UL) /*!< Enable shortcut */

/* Bit 8 : Shortcut between event DES_OUTPUT_EMPTY and task FILL_DES_INPUT */
#define DES_SHORTS_DES_OUTPUT_EMPTY_FILL_DES_INPUT_Pos (8UL) /*!< Position of DES_OUTPUT_EMPTY_FILL_DES_INPUT field. */
#define DES_SHORTS_DES_OUTPUT_EMPTY_FILL_DES_INPUT_Msk (0x1UL << DES_SHORTS_DES_OUTPUT_EMPTY_FILL_DES_INPUT_Pos) /*!< Bit mask of DES_OUTPUT_EMPTY_FILL_DES_INPUT field. */
#define DES_SHORTS_DES_OUTPUT_EMPTY_FILL_DES_INPUT_Disabled (0UL) /*!< Disable shortcut */
#define DES_SHORTS_DES_OUTPUT_EMPTY_FILL_DES_INPUT_Enabled (1UL) /*!< Enable shortcut */

/* Bit 7 : Shortcut between event DES_DONE_3 and task DRAIN_DES_OUTPUT */
#define DES_SHORTS_DES_DONE_3_DRAIN_DES_OUTPUT_Pos (7UL) /*!< Position of DES_DONE_3_DRAIN_DES_OUTPUT field. */
#define DES_SHORTS_DES_DONE_3_DRAIN_DES_OUTPUT_Msk (0x1UL << DES_SHORTS_DES_DONE_3_DRAIN_DES_OUTPUT_Pos) /*!< Bit mask of DES_DONE_3_DRAIN_DES_OUTPUT field. */
#define DES_SHORTS_DES_DONE_3_DRAIN_DES_OUTPUT_Disabled (0UL) /*!< Disable shortcut */
#define DES_SHORTS_DES_DONE_3_DRAIN_DES_OUTPUT_Enabled (1UL) /*!< Enable shortcut */

/* Bit 6 : Shortcut between event DES_DONE_2 and task DES_DECRYPT_3 */
#define DES_SHORTS_DES_DONE_2_DES_DECRYPT_3_Pos (6UL) /*!< Position of DES_DONE_2_DES_DECRYPT_3 field. */
#define DES_SHORTS_DES_DONE_2_DES_DECRYPT_3_Msk (0x1UL << DES_SHORTS_DES_DONE_2_DES_DECRYPT_3_Pos) /*!< Bit mask of DES_DONE_2_DES_DECRYPT_3 field. */
#define DES_SHORTS_DES_DONE_2_DES_DECRYPT_3_Disabled (0UL) /*!< Disable shortcut */
#define DES_SHORTS_DES_DONE_2_DES_DECRYPT_3_Enabled (1UL) /*!< Enable shortcut */

/* Bit 5 : Shortcut between event DES_DONE_2 and task DES_ENCRYPT_3 */
#define DES_SHORTS_DES_DONE_2_DES_ENCRYPT_3_Pos (5UL) /*!< Position of DES_DONE_2_DES_ENCRYPT_3 field. */
#define DES_SHORTS_DES_DONE_2_DES_ENCRYPT_3_Msk (0x1UL << DES_SHORTS_DES_DONE_2_DES_ENCRYPT_3_Pos) /*!< Bit mask of DES_DONE_2_DES_ENCRYPT_3 field. */
#define DES_SHORTS_DES_DONE_2_DES_ENCRYPT_3_Disabled (0UL) /*!< Disable shortcut */
#define DES_SHORTS_DES_DONE_2_DES_ENCRYPT_3_Enabled (1UL) /*!< Enable shortcut */

/* Bit 4 : Shortcut between event DES_DONE_1 and task DRAIN_DES_OUTPUT */
#define DES_SHORTS_DES_DONE_1_DRAIN_DES_OUTPUT_Pos (4UL) /*!< Position of DES_DONE_1_DRAIN_DES_OUTPUT field. */
#define DES_SHORTS_DES_DONE_1_DRAIN_DES_OUTPUT_Msk (0x1UL << DES_SHORTS_DES_DONE_1_DRAIN_DES_OUTPUT_Pos) /*!< Bit mask of DES_DONE_1_DRAIN_DES_OUTPUT field. */
#define DES_SHORTS_DES_DONE_1_DRAIN_DES_OUTPUT_Disabled (0UL) /*!< Disable shortcut */
#define DES_SHORTS_DES_DONE_1_DRAIN_DES_OUTPUT_Enabled (1UL) /*!< Enable shortcut */

/* Bit 3 : Shortcut between event DES_DONE_1 and task DES_DECRYPT_2 */
#define DES_SHORTS_DES_DONE_1_DES_DECRYPT_2_Pos (3UL) /*!< Position of DES_DONE_1_DES_DECRYPT_2 field. */
#define DES_SHORTS_DES_DONE_1_DES_DECRYPT_2_Msk (0x1UL << DES_SHORTS_DES_DONE_1_DES_DECRYPT_2_Pos) /*!< Bit mask of DES_DONE_1_DES_DECRYPT_2 field. */
#define DES_SHORTS_DES_DONE_1_DES_DECRYPT_2_Disabled (0UL) /*!< Disable shortcut */
#define DES_SHORTS_DES_DONE_1_DES_DECRYPT_2_Enabled (1UL) /*!< Enable shortcut */

/* Bit 2 : Shortcut between event DES_DONE_1 and task DES_ENCRYPT_2 */
#define DES_SHORTS_DES_DONE_1_DES_ENCRYPT_2_Pos (2UL) /*!< Position of DES_DONE_1_DES_ENCRYPT_2 field. */
#define DES_SHORTS_DES_DONE_1_DES_ENCRYPT_2_Msk (0x1UL << DES_SHORTS_DES_DONE_1_DES_ENCRYPT_2_Pos) /*!< Bit mask of DES_DONE_1_DES_ENCRYPT_2 field. */
#define DES_SHORTS_DES_DONE_1_DES_ENCRYPT_2_Disabled (0UL) /*!< Disable shortcut */
#define DES_SHORTS_DES_DONE_1_DES_ENCRYPT_2_Enabled (1UL) /*!< Enable shortcut */

/* Bit 1 : Shortcut between event DES_INPUT_FULL and task DES_DECRYPT_1 */
#define DES_SHORTS_DES_INPUT_FULL_DES_DECRYPT_1_Pos (1UL) /*!< Position of DES_INPUT_FULL_DES_DECRYPT_1 field. */
#define DES_SHORTS_DES_INPUT_FULL_DES_DECRYPT_1_Msk (0x1UL << DES_SHORTS_DES_INPUT_FULL_DES_DECRYPT_1_Pos) /*!< Bit mask of DES_INPUT_FULL_DES_DECRYPT_1 field. */
#define DES_SHORTS_DES_INPUT_FULL_DES_DECRYPT_1_Disabled (0UL) /*!< Disable shortcut */
#define DES_SHORTS_DES_INPUT_FULL_DES_DECRYPT_1_Enabled (1UL) /*!< Enable shortcut */

/* Bit 0 : Shortcut between event DES_INPUT_FULL and task DES_ENCRYPT_1 */
#define DES_SHORTS_DES_INPUT_FULL_DES_ENCRYPT_1_Pos (0UL) /*!< Position of DES_INPUT_FULL_DES_ENCRYPT_1 field. */
#define DES_SHORTS_DES_INPUT_FULL_DES_ENCRYPT_1_Msk (0x1UL << DES_SHORTS_DES_INPUT_FULL_DES_ENCRYPT_1_Pos) /*!< Bit mask of DES_INPUT_FULL_DES_ENCRYPT_1 field. */
#define DES_SHORTS_DES_INPUT_FULL_DES_ENCRYPT_1_Disabled (0UL) /*!< Disable shortcut */
#define DES_SHORTS_DES_INPUT_FULL_DES_ENCRYPT_1_Enabled (1UL) /*!< Enable shortcut */

/* Register: DES_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 14 : Enable or disable interrupt for event RESETTED */
#define DES_INTEN_RESETTED_Pos (14UL) /*!< Position of RESETTED field. */
#define DES_INTEN_RESETTED_Msk (0x1UL << DES_INTEN_RESETTED_Pos) /*!< Bit mask of RESETTED field. */
#define DES_INTEN_RESETTED_Disabled (0UL) /*!< Disable */
#define DES_INTEN_RESETTED_Enabled (1UL) /*!< Enable */

/* Bit 13 : Enable or disable interrupt for event MESSAGE_READY */
#define DES_INTEN_MESSAGE_READY_Pos (13UL) /*!< Position of MESSAGE_READY field. */
#define DES_INTEN_MESSAGE_READY_Msk (0x1UL << DES_INTEN_MESSAGE_READY_Pos) /*!< Bit mask of MESSAGE_READY field. */
#define DES_INTEN_MESSAGE_READY_Disabled (0UL) /*!< Disable */
#define DES_INTEN_MESSAGE_READY_Enabled (1UL) /*!< Enable */

/* Bit 12 : Enable or disable interrupt for event DES_OUTPUT_EMPTY */
#define DES_INTEN_DES_OUTPUT_EMPTY_Pos (12UL) /*!< Position of DES_OUTPUT_EMPTY field. */
#define DES_INTEN_DES_OUTPUT_EMPTY_Msk (0x1UL << DES_INTEN_DES_OUTPUT_EMPTY_Pos) /*!< Bit mask of DES_OUTPUT_EMPTY field. */
#define DES_INTEN_DES_OUTPUT_EMPTY_Disabled (0UL) /*!< Disable */
#define DES_INTEN_DES_OUTPUT_EMPTY_Enabled (1UL) /*!< Enable */

