adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 6 : Read pending status of interrupt for event IV_READY */
#define DES_INTPEND_IV_READY_Pos (6UL) /*!< Position of IV_READY field. */
#define DES_INTPEND_IV_READY_Msk (0x1UL << DES_INTPEND_IV_READY_Pos) /*!< Bit mask of IV_READY field. */
#define DES_INTPEND_IV_READY_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_IV_READY_Pending (1UL) /*!< Read: Pending */

/* Bit 5 : Read pending status of interrupt for event KEY_3_READY */
#define DES_INTPEND_KEY_3_READY_Pos (5UL) /*!< Position of KEY_3_READY field. */
#define DES_INTPEND_KEY_3_READY_Msk (0x1UL << DES_INTPEND_KEY_3_READY_Pos) /*!< Bit mask of KEY_3_READY field. */
#define DES_INTPEND_KEY_3_READY_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_KEY_3_READY_Pending (1UL) /*!< Read: Pending */

/* Bit 4 : Read pending status of interrupt for event KEY_1_READY */
#define DES_INTPEND_KEY_1_READY_Pos (4UL) /*!< Position of KEY_1_READY field. */
#define DES_INTPEND_KEY_1_READY_Msk (0x1UL << DES_INTPEND_KEY_1_READY_Pos) /*!< Bit mask of KEY_1_READY field. */
#define DES_INTPEND_KEY_1_READY_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_KEY_1_READY_Pending (1UL) /*!< Read: Pending */

/* Bit 3 : Read pending status of interrupt for event SCATTER_DONE */
#define DES_INTPEND_SCATTER_DONE_Pos (3UL) /*!< Position of SCATTER_DONE field. */
#define DES_INTPEND_SCATTER_DONE_Msk (0x1UL << DES_INTPEND_SCATTER_DONE_Pos) /*!< Bit mask of SCATTER_DONE field. */
#define DES_INTPEND_SCATTER_DONE_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_SCATTER_DONE_Pending (1UL) /*!< Read: Pending */

/* Bit 2 : Read pending status of interrupt for event SCATTER_STARTED */
#define DES_INTPEND_SCATTER_STARTED_Pos (2UL) /*!< Position of SCATTER_STARTED field. */
#define DES_INTPEND_SCATTER_STARTED_Msk (0x1UL << DES_INTPEND_SCATTER_STARTED_Pos) /*!< Bit mask of SCATTER_STARTED field. */
#define DES_INTPEND_SCATTER_STARTED_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_SCATTER_STARTED_Pending (1UL) /*!< Read: Pending */

/* Bit 1 : Read pending status of interrupt for event GATHER_DONE */
#define DES_INTPEND_GATHER_DONE_Pos (1UL) /*!< Position of GATHER_DONE field. */
#define DES_INTPEND_GATHER_DONE_Msk (0x1UL << DES_INTPEND_GATHER_DONE_Pos) /*!< Bit mask of GATHER_DONE field. */
#define DES_INTPEND_GATHER_DONE_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_GATHER_DONE_Pending (1UL) /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event GATHER_STARTED */
#define DES_INTPEND_GATHER_STARTED_Pos (0UL) /*!< Position of GATHER_STARTED field. */
#define DES_INTPEND_GATHER_STARTED_Msk (0x1UL << DES_INTPEND_GATHER_STARTED_Pos) /*!< Bit mask of GATHER_STARTED field. */
#define DES_INTPEND_GATHER_STARTED_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_GATHER_STARTED_Pending (1UL) /*!< Read: Pending */

/* Register: DES_LENGTH */
/* Description: Data length in bytes */

/* Bits 31..0 : Data length in bytes */
#define DES_LENGTH_LENGTH_Pos (0UL) /*!< Position of LENGTH field. */
#define DES_LENGTH_LENGTH_Msk (0xFFFFFFFFUL << DES_LENGTH_LENGTH_Pos) /*!< Bit mask of LENGTH field. */

/* Register: DES_MODE */
/* Description: Mode: 0 == ECB, 1 == CBC */

/* Bit 0 : Selects ECB or CBC block cipher mode */
#define DES_MODE_MODE_Pos (0UL) /*!< Position of MODE field. */
#define DES_MODE_MODE_Msk (0x1UL << DES_MODE_MODE_Pos) /*!< Bit mask of MODE field. */
#define DES_MODE_MODE_ECB (0UL) /*!< Electronic Codebook mode */
#define DES_MODE_MODE_CBC (1UL) /*!< Cipher Block Chaining mode */

/* Register: DES_ENABLE */
/* Description: Enable/disable block */

/* Bit 0 : Enable or disable DES module */
#define DES_ENABLE_ENABLE_Pos (0UL) /*!< Position of ENABLE field. */
#define DES_ENABLE_ENABLE_Msk (0x1UL << DES_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define DES_ENABLE_ENABLE_Disabled (0UL) /*!< Disabled */
#define DES_ENABLE_ENABLE_Enabled (1UL) /*!< Enabled */

/* Register: DES_INJOBPTR */
/* Description: Input DMA job pointer register */

/* Bits 31..0 : Input DMA job pointer */
#define DES_INJOBPTR_INJOBPTR_Pos (0UL) /*!< Position of INJOBPTR field. */
#define DES_INJOBPTR_INJOBPTR_Msk (0xFFFFFFFFUL << DES_INJOBPTR_INJOBPTR_Pos) /*!< Bit mask of INJOBPTR field. */

/* Register: DES_OUTJOBPTR */
/* Description: Output DMA job pointer register */

/* Bits 31..0 : Output DMA job pointer */
#define DES_OUTJOBPTR_OUTJOBPTR_Pos (0UL) /*!< Position of OUTJOBPTR field. */
#define DES_OUTJOBPTR_OUTJOBPTR_Msk (0xFFFFFFFFUL << DES_OUTJOBPTR_OUTJOBPTR_Pos) /*!< Bit mask of OUTJOBPTR field. */

/* Register: DES_PENALTY_REG */
/* Description: Description collection: Penalty register for PCP n */

/* Bits 1..0 : Penalty Level */
#define DES_PENALTY_REG_PENALTY_Pos (0UL) /*!< Position of PENALTY field. */
#define DES_PENALTY_REG_PENALTY_Msk (0x3UL << DES_PENALTY_REG_PENALTY_Pos) /*!< Bit mask of PENALTY field. */
#define DES_PENALTY_REG_PENALTY_Full (0UL) /*!< Auto 0) Full penalty) */
#define DES_PENALTY_REG_PENALTY_Semi1 (1UL) /*!< (Auto 1)  Semi (power on, clock off) */
#define DES_PENALTY_REG_PENALTY_Semi0 (2UL) /*!< (Auto 2) Semi (power on, clock core on, clock buffer off) */
#define DES_PENALTY_REG_PENALTY_Zero (3UL) /*!< (Auto 3)  Zero penalty */

/* Register: DES_FORCE_OVERRIDE */
/* Description: Description collection: Force override register for PCP n */

/* Bit 15 :   */
#define DES_FORCE_OVERRIDE_DISABLE_Pos (15UL) /*!< Position of DISABLE field. */
#define DES_FORCE_OVERRIDE_DISABLE_Msk (0x1UL << DES_FORCE_OVERRIDE_DISABLE_Pos) /*!< Bit mask of DISABLE field. */
#define DES_FORCE_OVERRIDE_DISABLE_Zero (0UL) /*!< all forcing disabled */
#define DES_FORCE_OVERRIDE_DISABLE_One (1UL) /*!< all forcing enabled */

/* Bit 9 :   */
#define DES_FORCE_OVERRIDE_PWRREQ_CORE_Pos (9UL) /*!< Position of PWRREQ_CORE field. */
#define DES_FORCE_OVERRIDE_PWRREQ_CORE_Msk (0x1UL << DES_FORCE_OVERRIDE_PWRREQ_CORE_Pos) /*!< Bit mask of PWRREQ_CORE field. */
#define DES_FORCE_OVERRIDE_PWRREQ_CORE_Zero (0UL) /*!< powerRequest.core = 0 */
#define DES_FORCE_OVERRIDE_PWRREQ_CORE_One (1UL) /*!< powerRequest.core = 1 */

/* Bit 8 :   */
#define DES_FORCE_OVERRIDE_PWRREQ_SW_Pos (8UL) /*!< Position of PWRREQ_SW field. */
#define DES_FORCE_OVERRIDE_PWRREQ_SW_Msk (0x1UL << DES_FORCE_OVERRIDE_PWRREQ_SW_Pos) /*!< Bit mask of PWRREQ_SW field. */
#define DES_FORCE_OVERRIDE_PWRREQ_SW_Zero (0UL) /*!< powerRequest.switch = 0 */
#define DES_FORCE_OVERRIDE_PWRREQ_SW_One (1UL) /*!< powerRequest.switch = 1 */

/* Bit 7 :   */
#define DES_FORCE_OVERRIDE_PWRREQ_ALL_Pos (7UL) /*!< Position of PWRREQ_ALL field. */
#define DES_FORCE_OVERRIDE_PWRREQ_ALL_Msk (0x1UL << DES_FORCE_OVERRIDE_PWRREQ_ALL_Pos) /*!< Bit mask of PWRREQ_ALL field. */
#define DES_FORCE_OVERRIDE_PWRREQ_ALL_Zero (0UL) /*!< All clock forcing  disabled */
#define DES_FORCE_OVERRIDE_PWRREQ_ALL_One (1UL) /*!< All clock forcing  enabled */

/* Bit 3 :   */
#define DES_FORCE_OVERRIDE_CLKREQ_CORE_Pos (3UL) /*!< Position of CLKREQ_CORE field. */
#define DES_FORCE_OVERRIDE_CLKREQ_CORE_Msk (0x1UL << DES_FORCE_OVERRIDE_CLKREQ_CORE_Pos) /*!< Bit mask of CLKREQ_CORE field. */
#define DES_FORCE_OVERRIDE_CLKREQ_CORE_Zero (0UL) /*!< clockRequest.core = 0 */
#define DES_FORCE_OVERRIDE_CLKREQ_CORE_One (1UL) /*!< clockRequest.core = 1 */

/* Bit 2 :   */
#define DES_FORCE_OVERRIDE_CLKREQ_BUFF_Pos (2UL) /*!< Position of CLKREQ_BUFF field. */
#define DES_FORCE_OVERRIDE_CLKREQ_BUFF_Msk (0x1UL << DES_FORCE_OVERRIDE_CLKREQ_BUFF_Pos) /*!< Bit mask of CLKREQ_BUFF field. */
#define DES_FORCE_OVERRIDE_CLKREQ_BUFF_Zero (0UL) /*!< clockRequest.buff = 0 */
#define DES_FORCE_OVERRIDE_CLKREQ_BUFF_One (1UL) /*!< clockRequest.buff = 1 */

/* Bit 1 :   */
#define DES_FORCE_OVERRIDE_CLKREQ_ALL_Pos (1UL) /*!< Position of CLKREQ_ALL field. */
#define DES_FORCE_OVERRIDE_CLKREQ_ALL_Msk (0x1UL << DES_FORCE_OVERRIDE_CLKREQ_ALL_Pos) /*!< Bit mask of CLKREQ_ALL field. */
#define DES_FORCE_OVERRIDE_CLKREQ_ALL_Zero (0UL) /*!< clockRequest.switch = 0 */
#define DES_FORCE_OVERRIDE_CLKREQ_ALL_One (1UL) /*!< clockRequest.switch = 1 */

