adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 0 :   */
#define DES_FORCE_OVERRIDE_CHANGE_ME_TOO_Pos (0UL) /*!< Position of CHANGE_ME_TOO field. */
#define DES_FORCE_OVERRIDE_CHANGE_ME_TOO_Msk (0x1UL << DES_FORCE_OVERRIDE_CHANGE_ME_TOO_Pos) /*!< Bit mask of CHANGE_ME_TOO field. */
#define DES_FORCE_OVERRIDE_CHANGE_ME_TOO_Zero (0UL) /*!< clockRequest.switch_a = 0 */
#define DES_FORCE_OVERRIDE_CHANGE_ME_TOO_One (1UL) /*!< clockRequest.switch_a = 1 */

/* Register: DES_TURN_OFF_AUTO_CLOCKSOURCE_REQ */
/* Description: Turn of the automatic clock request. */

/* Bit 1 :   */
#define DES_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_1_Pos (1UL) /*!< Position of CLOCK_START_1 field. */
#define DES_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_1_Msk (0x1UL << DES_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_1_Pos) /*!< Bit mask of CLOCK_START_1 field. */
#define DES_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_1_Zero (0UL) /*!< normal clock start for PCP 1 */
#define DES_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_1_One (1UL) /*!< turn off normal clock start for PCP 1 */

/* Bit 0 :   */
#define DES_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_0_Pos (0UL) /*!< Position of CLOCK_START_0 field. */
#define DES_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_0_Msk (0x1UL << DES_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_0_Pos) /*!< Bit mask of CLOCK_START_0 field. */
#define DES_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_0_Zero (0UL) /*!< normal clock start for PCP 0 */
#define DES_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_0_One (1UL) /*!< turn off normal clock start for PCP 0 */


/* Peripheral: DPOWER */
/* Description: Power Control */

/* Register: DPOWER_TASKS_CONSTLAT */
/* Description: Enable constant latency mode. When going to sleep: CPU is clock gated, but regulators, oscillators and clock tree is kept on. */

/* Bit 0 : Enable constant latency mode. When going to sleep: CPU is clock gated, but regulators, oscillators and clock tree is kept on. */
#define DPOWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Pos (0UL) /*!< Position of TASKS_CONSTLAT field. */
#define DPOWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Msk (0x1UL << DPOWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Pos) /*!< Bit mask of TASKS_CONSTLAT field. */
#define DPOWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Trigger (1UL) /*!< Trigger task */

/* Register: DPOWER_TASKS_LOWPWR */
/* Description: Enable low power mode (variable latency) When going to sleep: Oscillators are switched off (if nothing else is requesting clocks). Regulators are switched off (if nothing else is requesting power). */

/* Bit 0 : Enable low power mode (variable latency) When going to sleep: Oscillators are switched off (if nothing else is requesting clocks). Regulators are switched off (if nothing else is requesting power). */
#define DPOWER_TASKS_LOWPWR_TASKS_LOWPWR_Pos (0UL) /*!< Position of TASKS_LOWPWR field. */
#define DPOWER_TASKS_LOWPWR_TASKS_LOWPWR_Msk (0x1UL << DPOWER_TASKS_LOWPWR_TASKS_LOWPWR_Pos) /*!< Bit mask of TASKS_LOWPWR field. */
#define DPOWER_TASKS_LOWPWR_TASKS_LOWPWR_Trigger (1UL) /*!< Trigger task */

/* Register: DPOWER_EVENTS_POFWARN */
/* Description: Power failure warning */

/* Bit 0 : Power failure warning */
#define DPOWER_EVENTS_POFWARN_EVENTS_POFWARN_Pos (0UL) /*!< Position of EVENTS_POFWARN field. */
#define DPOWER_EVENTS_POFWARN_EVENTS_POFWARN_Msk (0x1UL << DPOWER_EVENTS_POFWARN_EVENTS_POFWARN_Pos) /*!< Bit mask of EVENTS_POFWARN field. */
#define DPOWER_EVENTS_POFWARN_EVENTS_POFWARN_NotGenerated (0UL) /*!< Event not generated */
#define DPOWER_EVENTS_POFWARN_EVENTS_POFWARN_Generated (1UL) /*!< Event generated */

/* Register: DPOWER_EVENTS_SLEEPENTER */
/* Description: CPU entered WFI/WFE sleep */

/* Bit 0 : CPU entered WFI/WFE sleep */
#define DPOWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Pos (0UL) /*!< Position of EVENTS_SLEEPENTER field. */
#define DPOWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Msk (0x1UL << DPOWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Pos) /*!< Bit mask of EVENTS_SLEEPENTER field. */
#define DPOWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_NotGenerated (0UL) /*!< Event not generated */
#define DPOWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Generated (1UL) /*!< Event generated */

/* Register: DPOWER_EVENTS_SLEEPEXIT */
/* Description: CPU exited WFI/WFE sleep */

/* Bit 0 : CPU exited WFI/WFE sleep */
#define DPOWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Pos (0UL) /*!< Position of EVENTS_SLEEPEXIT field. */
#define DPOWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Msk (0x1UL << DPOWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Pos) /*!< Bit mask of EVENTS_SLEEPEXIT field. */
#define DPOWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_NotGenerated (0UL) /*!< Event not generated */
#define DPOWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Generated (1UL) /*!< Event generated */

/* Register: DPOWER_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 6 : Enable or disable interrupt for event SLEEPEXIT */
#define DPOWER_INTEN_SLEEPEXIT_Pos (6UL) /*!< Position of SLEEPEXIT field. */
#define DPOWER_INTEN_SLEEPEXIT_Msk (0x1UL << DPOWER_INTEN_SLEEPEXIT_Pos) /*!< Bit mask of SLEEPEXIT field. */
#define DPOWER_INTEN_SLEEPEXIT_Disabled (0UL) /*!< Disable */
#define DPOWER_INTEN_SLEEPEXIT_Enabled (1UL) /*!< Enable */

/* Bit 5 : Enable or disable interrupt for event SLEEPENTER */
#define DPOWER_INTEN_SLEEPENTER_Pos (5UL) /*!< Position of SLEEPENTER field. */
#define DPOWER_INTEN_SLEEPENTER_Msk (0x1UL << DPOWER_INTEN_SLEEPENTER_Pos) /*!< Bit mask of SLEEPENTER field. */
#define DPOWER_INTEN_SLEEPENTER_Disabled (0UL) /*!< Disable */
#define DPOWER_INTEN_SLEEPENTER_Enabled (1UL) /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event POFWARN */
#define DPOWER_INTEN_POFWARN_Pos (2UL) /*!< Position of POFWARN field. */
#define DPOWER_INTEN_POFWARN_Msk (0x1UL << DPOWER_INTEN_POFWARN_Pos) /*!< Bit mask of POFWARN field. */
#define DPOWER_INTEN_POFWARN_Disabled (0UL) /*!< Disable */
#define DPOWER_INTEN_POFWARN_Enabled (1UL) /*!< Enable */

/* Register: DPOWER_INTENSET */
/* Description: Enable interrupt */

/* Bit 6 : Write '1' to enable interrupt for event SLEEPEXIT */
#define DPOWER_INTENSET_SLEEPEXIT_Pos (6UL) /*!< Position of SLEEPEXIT field. */
#define DPOWER_INTENSET_SLEEPEXIT_Msk (0x1UL << DPOWER_INTENSET_SLEEPEXIT_Pos) /*!< Bit mask of SLEEPEXIT field. */
#define DPOWER_INTENSET_SLEEPEXIT_Disabled (0UL) /*!< Read: Disabled */
#define DPOWER_INTENSET_SLEEPEXIT_Enabled (1UL) /*!< Read: Enabled */
#define DPOWER_INTENSET_SLEEPEXIT_Set (1UL) /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event SLEEPENTER */
#define DPOWER_INTENSET_SLEEPENTER_Pos (5UL) /*!< Position of SLEEPENTER field. */
#define DPOWER_INTENSET_SLEEPENTER_Msk (0x1UL << DPOWER_INTENSET_SLEEPENTER_Pos) /*!< Bit mask of SLEEPENTER field. */
#define DPOWER_INTENSET_SLEEPENTER_Disabled (0UL) /*!< Read: Disabled */
#define DPOWER_INTENSET_SLEEPENTER_Enabled (1UL) /*!< Read: Enabled */
#define DPOWER_INTENSET_SLEEPENTER_Set (1UL) /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event POFWARN */
#define DPOWER_INTENSET_POFWARN_Pos (2UL) /*!< Position of POFWARN field. */
#define DPOWER_INTENSET_POFWARN_Msk (0x1UL << DPOWER_INTENSET_POFWARN_Pos) /*!< Bit mask of POFWARN field. */
#define DPOWER_INTENSET_POFWARN_Disabled (0UL) /*!< Read: Disabled */
#define DPOWER_INTENSET_POFWARN_Enabled (1UL) /*!< Read: Enabled */
#define DPOWER_INTENSET_POFWARN_Set (1UL) /*!< Enable */

