adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Register: DPOWER_INTENCLR */
/* Description: Disable interrupt */

/* Bit 6 : Write '1' to disable interrupt for event SLEEPEXIT */
#define DPOWER_INTENCLR_SLEEPEXIT_Pos (6UL) /*!< Position of SLEEPEXIT field. */
#define DPOWER_INTENCLR_SLEEPEXIT_Msk (0x1UL << DPOWER_INTENCLR_SLEEPEXIT_Pos) /*!< Bit mask of SLEEPEXIT field. */
#define DPOWER_INTENCLR_SLEEPEXIT_Disabled (0UL) /*!< Read: Disabled */
#define DPOWER_INTENCLR_SLEEPEXIT_Enabled (1UL) /*!< Read: Enabled */
#define DPOWER_INTENCLR_SLEEPEXIT_Clear (1UL) /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event SLEEPENTER */
#define DPOWER_INTENCLR_SLEEPENTER_Pos (5UL) /*!< Position of SLEEPENTER field. */
#define DPOWER_INTENCLR_SLEEPENTER_Msk (0x1UL << DPOWER_INTENCLR_SLEEPENTER_Pos) /*!< Bit mask of SLEEPENTER field. */
#define DPOWER_INTENCLR_SLEEPENTER_Disabled (0UL) /*!< Read: Disabled */
#define DPOWER_INTENCLR_SLEEPENTER_Enabled (1UL) /*!< Read: Enabled */
#define DPOWER_INTENCLR_SLEEPENTER_Clear (1UL) /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event POFWARN */
#define DPOWER_INTENCLR_POFWARN_Pos (2UL) /*!< Position of POFWARN field. */
#define DPOWER_INTENCLR_POFWARN_Msk (0x1UL << DPOWER_INTENCLR_POFWARN_Pos) /*!< Bit mask of POFWARN field. */
#define DPOWER_INTENCLR_POFWARN_Disabled (0UL) /*!< Read: Disabled */
#define DPOWER_INTENCLR_POFWARN_Enabled (1UL) /*!< Read: Enabled */
#define DPOWER_INTENCLR_POFWARN_Clear (1UL) /*!< Disable */

/* Register: DPOWER_RESETREAS */
/* Description: Reset reason */

/* Bit 22 : Force off reset from MCUMASTER detected */
#define DPOWER_RESETREAS_MFORCEOFF_Pos (22UL) /*!< Position of MFORCEOFF field. */
#define DPOWER_RESETREAS_MFORCEOFF_Msk (0x1UL << DPOWER_RESETREAS_MFORCEOFF_Pos) /*!< Bit mask of MFORCEOFF field. */
#define DPOWER_RESETREAS_MFORCEOFF_NotDetected (0UL) /*!< Not detected */
#define DPOWER_RESETREAS_MFORCEOFF_Detected (1UL) /*!< Detected */

/* Bit 21 : CPU reset from MCUMASTER detected */
#define DPOWER_RESETREAS_MRST_Pos (21UL) /*!< Position of MRST field. */
#define DPOWER_RESETREAS_MRST_Msk (0x1UL << DPOWER_RESETREAS_MRST_Pos) /*!< Bit mask of MRST field. */
#define DPOWER_RESETREAS_MRST_NotDetected (0UL) /*!< Not detected */
#define DPOWER_RESETREAS_MRST_Detected (1UL) /*!< Detected */

/* Bit 20 : Reset from secure control detected */
#define DPOWER_RESETREAS_SCTRL_Pos (20UL) /*!< Position of SCTRL field. */
#define DPOWER_RESETREAS_SCTRL_Msk (0x1UL << DPOWER_RESETREAS_SCTRL_Pos) /*!< Bit mask of SCTRL field. */
#define DPOWER_RESETREAS_SCTRL_NotDetected (0UL) /*!< Not detected */
#define DPOWER_RESETREAS_SCTRL_Detected (1UL) /*!< Detected */

/* Bit 19 : Reset from secure watchdog detected */
#define DPOWER_RESETREAS_SDOG_Pos (19UL) /*!< Position of SDOG field. */
#define DPOWER_RESETREAS_SDOG_Msk (0x1UL << DPOWER_RESETREAS_SDOG_Pos) /*!< Bit mask of SDOG field. */
#define DPOWER_RESETREAS_SDOG_NotDetected (0UL) /*!< Not detected */
#define DPOWER_RESETREAS_SDOG_Detected (1UL) /*!< Detected */

/* Bit 18 : Reset from local watchdog detected */
#define DPOWER_RESETREAS_LDOG_Pos (18UL) /*!< Position of LDOG field. */
#define DPOWER_RESETREAS_LDOG_Msk (0x1UL << DPOWER_RESETREAS_LDOG_Pos) /*!< Bit mask of LDOG field. */
#define DPOWER_RESETREAS_LDOG_NotDetected (0UL) /*!< Not detected */
#define DPOWER_RESETREAS_LDOG_Detected (1UL) /*!< Detected */

/* Bit 17 : Reset from CPU lock-up detected */
#define DPOWER_RESETREAS_LOCKUP_Pos (17UL) /*!< Position of LOCKUP field. */
#define DPOWER_RESETREAS_LOCKUP_Msk (0x1UL << DPOWER_RESETREAS_LOCKUP_Pos) /*!< Bit mask of LOCKUP field. */
#define DPOWER_RESETREAS_LOCKUP_NotDetected (0UL) /*!< Not detected */
#define DPOWER_RESETREAS_LOCKUP_Detected (1UL) /*!< Detected */

/* Bit 16 : Reset from AIRCR.SYSRESETREQ detected */
#define DPOWER_RESETREAS_SREQ_Pos (16UL) /*!< Position of SREQ field. */
#define DPOWER_RESETREAS_SREQ_Msk (0x1UL << DPOWER_RESETREAS_SREQ_Pos) /*!< Bit mask of SREQ field. */
#define DPOWER_RESETREAS_SREQ_NotDetected (0UL) /*!< Not detected */
#define DPOWER_RESETREAS_SREQ_Detected (1UL) /*!< Detected */

/* Bit 5 : Reset due to wake up from System OFF mode by NFC field detect */
#define DPOWER_RESETREAS_NFC_Pos (5UL) /*!< Position of NFC field. */
#define DPOWER_RESETREAS_NFC_Msk (0x1UL << DPOWER_RESETREAS_NFC_Pos) /*!< Bit mask of NFC field. */
#define DPOWER_RESETREAS_NFC_NotDetected (0UL) /*!< Not detected */
#define DPOWER_RESETREAS_NFC_Detected (1UL) /*!< Detected */

/* Bit 4 : Reset due to wake up from System OFF mode when wakeup is triggered from entering into debug interface mode */
#define DPOWER_RESETREAS_DIF_Pos (4UL) /*!< Position of DIF field. */
#define DPOWER_RESETREAS_DIF_Msk (0x1UL << DPOWER_RESETREAS_DIF_Pos) /*!< Bit mask of DIF field. */
#define DPOWER_RESETREAS_DIF_NotDetected (0UL) /*!< Not detected */
#define DPOWER_RESETREAS_DIF_Detected (1UL) /*!< Detected */

/* Bit 3 : Reset due to wake up from System OFF mode when wakeup is triggered from ANADETECT signal from LPCOMP */
#define DPOWER_RESETREAS_LPCOMP_Pos (3UL) /*!< Position of LPCOMP field. */
#define DPOWER_RESETREAS_LPCOMP_Msk (0x1UL << DPOWER_RESETREAS_LPCOMP_Pos) /*!< Bit mask of LPCOMP field. */
#define DPOWER_RESETREAS_LPCOMP_NotDetected (0UL) /*!< Not detected */
#define DPOWER_RESETREAS_LPCOMP_Detected (1UL) /*!< Detected */

/* Bit 2 : Reset due to wake up from System OFF mode when wakeup is triggered from DETECT signal from GPIO */
#define DPOWER_RESETREAS_OFF_Pos (2UL) /*!< Position of OFF field. */
#define DPOWER_RESETREAS_OFF_Msk (0x1UL << DPOWER_RESETREAS_OFF_Pos) /*!< Bit mask of OFF field. */
#define DPOWER_RESETREAS_OFF_NotDetected (0UL) /*!< Not detected */
#define DPOWER_RESETREAS_OFF_Detected (1UL) /*!< Detected */

/* Bit 1 : Reset from global watchdog detected */
#define DPOWER_RESETREAS_DOG_Pos (1UL) /*!< Position of DOG field. */
#define DPOWER_RESETREAS_DOG_Msk (0x1UL << DPOWER_RESETREAS_DOG_Pos) /*!< Bit mask of DOG field. */
#define DPOWER_RESETREAS_DOG_NotDetected (0UL) /*!< Not detected */
#define DPOWER_RESETREAS_DOG_Detected (1UL) /*!< Detected */

/* Bit 0 : Reset from pin-reset detected */
#define DPOWER_RESETREAS_RESETPIN_Pos (0UL) /*!< Position of RESETPIN field. */
#define DPOWER_RESETREAS_RESETPIN_Msk (0x1UL << DPOWER_RESETREAS_RESETPIN_Pos) /*!< Bit mask of RESETPIN field. */
#define DPOWER_RESETREAS_RESETPIN_NotDetected (0UL) /*!< Not detected */
#define DPOWER_RESETREAS_RESETPIN_Detected (1UL) /*!< Detected */

/* Register: DPOWER_SLEEPCNF */
/* Description: Sleep configuration */

/* Bit 0 : Sleep mode */
#define DPOWER_SLEEPCNF_SLEEPMODE_Pos (0UL) /*!< Position of SLEEPMODE field. */
#define DPOWER_SLEEPCNF_SLEEPMODE_Msk (0x1UL << DPOWER_SLEEPCNF_SLEEPMODE_Pos) /*!< Bit mask of SLEEPMODE field. */
#define DPOWER_SLEEPCNF_SLEEPMODE_LIGHTSLEEP (0UL) /*!< Light sleep FF retention mode will be used if available. Otherwise FFs are kept powered. */
#define DPOWER_SLEEPCNF_SLEEPMODE_DEEPSLEEP (1UL) /*!< Deep sleep (wake from reset) No FF retention (needs wake from reset). */

/* Register: DPOWER_GPREGRET */
/* Description: Description collection: General purpose retention register */

/* Bits 7..0 : General purpose retention register */
#define DPOWER_GPREGRET_GPREGRET_Pos (0UL) /*!< Position of GPREGRET field. */
#define DPOWER_GPREGRET_GPREGRET_Msk (0xFFUL << DPOWER_GPREGRET_GPREGRET_Pos) /*!< Bit mask of GPREGRET field. */

/* Register: DPOWER_DSP_RESET */
/* Description: Reset DSP subsystem */

/* Bit 0 : RESET */
#define DPOWER_DSP_RESET_RESET_Pos (0UL) /*!< Position of RESET field. */
#define DPOWER_DSP_RESET_RESET_Msk (0x1UL << DPOWER_DSP_RESET_RESET_Pos) /*!< Bit mask of RESET field. */
#define DPOWER_DSP_RESET_RESET_Release (0UL) /*!< Release CPU reset signal. */
#define DPOWER_DSP_RESET_RESET_Hold (1UL) /*!< Hold CPU reset signal. */

/* Register: DPOWER_DSP_FORCEOFF */
/* Description: Force off power and clock in DSP subsystem */

/* Bit 0 : RESET */
#define DPOWER_DSP_FORCEOFF_FORCEOFF_Pos (0UL) /*!< Position of FORCEOFF field. */
#define DPOWER_DSP_FORCEOFF_FORCEOFF_Msk (0x1UL << DPOWER_DSP_FORCEOFF_FORCEOFF_Pos) /*!< Bit mask of FORCEOFF field. */
#define DPOWER_DSP_FORCEOFF_FORCEOFF_Release (0UL) /*!< Release force off signal. */
#define DPOWER_DSP_FORCEOFF_FORCEOFF_Hold (1UL) /*!< Hold force off signal. */

