adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Register: DPOWER_DSP_FORCEON */
/* Description: Force on power and clock in DSP subsystem */

/* Bit 0 : Forces on power and clock in DSP subsystem */
#define DPOWER_DSP_FORCEON_FORCEON_Pos (0UL) /*!< Position of FORCEON field. */
#define DPOWER_DSP_FORCEON_FORCEON_Msk (0x1UL << DPOWER_DSP_FORCEON_FORCEON_Pos) /*!< Bit mask of FORCEON field. */
#define DPOWER_DSP_FORCEON_FORCEON_Release (0UL) /*!< Release force on signal. */
#define DPOWER_DSP_FORCEON_FORCEON_Hold (1UL) /*!< Hold force on signal. */

/* Register: DPOWER_DSP_HALT */
/* Description: Halt DSP subsystem */

/* Bit 0 : Halt DSP subsystem */
#define DPOWER_DSP_HALT_HALT_Pos (0UL) /*!< Position of HALT field. */
#define DPOWER_DSP_HALT_HALT_Msk (0x1UL << DPOWER_DSP_HALT_HALT_Pos) /*!< Bit mask of HALT field. */
#define DPOWER_DSP_HALT_HALT_Release (0UL) /*!< Release halt signal. */
#define DPOWER_DSP_HALT_HALT_Hold (1UL) /*!< Hold halt signal. */

/* Register: DPOWER_LYNX_RESET */
/* Description: Reset Lynx RF subsystem */

/* Bit 0 : CPU soft reset */
#define DPOWER_LYNX_RESET_RESET_Pos (0UL) /*!< Position of RESET field. */
#define DPOWER_LYNX_RESET_RESET_Msk (0x1UL << DPOWER_LYNX_RESET_RESET_Pos) /*!< Bit mask of RESET field. */
#define DPOWER_LYNX_RESET_RESET_Release (0UL) /*!< Release CPU reset signal. */
#define DPOWER_LYNX_RESET_RESET_Hold (1UL) /*!< Hold CPU reset signal. */

/* Register: DPOWER_LYNX_FORCEOFF */
/* Description: Force off power and clock in Lynx RF subsystem */

/* Bit 0 : RESET */
#define DPOWER_LYNX_FORCEOFF_FORCEOFF_Pos (0UL) /*!< Position of FORCEOFF field. */
#define DPOWER_LYNX_FORCEOFF_FORCEOFF_Msk (0x1UL << DPOWER_LYNX_FORCEOFF_FORCEOFF_Pos) /*!< Bit mask of FORCEOFF field. */
#define DPOWER_LYNX_FORCEOFF_FORCEOFF_Release (0UL) /*!< Release force off signal. */
#define DPOWER_LYNX_FORCEOFF_FORCEOFF_Hold (1UL) /*!< Hold force off signal. */

/* Register: DPOWER_LYNX_FORCEON */
/* Description: Force on Lynx RF subsystem */

/* Bit 0 : Forces an power and clock DSP subsystem */
#define DPOWER_LYNX_FORCEON_FORCEON_Pos (0UL) /*!< Position of FORCEON field. */
#define DPOWER_LYNX_FORCEON_FORCEON_Msk (0x1UL << DPOWER_LYNX_FORCEON_FORCEON_Pos) /*!< Bit mask of FORCEON field. */
#define DPOWER_LYNX_FORCEON_FORCEON_Release (0UL) /*!< Release force on signal. */
#define DPOWER_LYNX_FORCEON_FORCEON_Hold (1UL) /*!< Hold force on signal. */


/* Peripheral: FICR */
/* Description: Factory Information Configuration Registers */

/* Register: FICR_TESTSTATUS */
/* Description: Code memory test status. Will be set during production test. */

/* Bits 31..0 : Code memory test status. Will be set during production test. */
#define FICR_TESTSTATUS_TESTSTATUS_Pos (0UL) /*!< Position of TESTSTATUS field. */
#define FICR_TESTSTATUS_TESTSTATUS_Msk (0xFFFFFFFFUL << FICR_TESTSTATUS_TESTSTATUS_Pos) /*!< Bit mask of TESTSTATUS field. */

/* Register: FICR_CPTEST0 */
/* Description: Result from Circuit Probe test */

/* Bits 31..0 : Result from Circuit Probe test */
#define FICR_CPTEST0_CP1_Pos (0UL) /*!< Position of CP1 field. */
#define FICR_CPTEST0_CP1_Msk (0xFFFFFFFFUL << FICR_CPTEST0_CP1_Pos) /*!< Bit mask of CP1 field. */

/* Register: FICR_CPTEST00 */
/* Description: Result from Circuit Probe test */

/* Bits 31..0 : Result from Circuit Probe test */
#define FICR_CPTEST00_CP2_Pos (0UL) /*!< Position of CP2 field. */
#define FICR_CPTEST00_CP2_Msk (0xFFFFFFFFUL << FICR_CPTEST00_CP2_Pos) /*!< Bit mask of CP2 field. */

/* Register: FICR_CPTEST1 */
/* Description: Result from Circuit Probe test */

/* Bits 31..24 : 4th ascii byte of Lot ID character */
#define FICR_CPTEST1_LOTID4_Pos (24UL) /*!< Position of LOTID4 field. */
#define FICR_CPTEST1_LOTID4_Msk (0xFFUL << FICR_CPTEST1_LOTID4_Pos) /*!< Bit mask of LOTID4 field. */

/* Bits 23..16 : 3rd ascii byte of Lot ID character */
#define FICR_CPTEST1_LOTID3_Pos (16UL) /*!< Position of LOTID3 field. */
#define FICR_CPTEST1_LOTID3_Msk (0xFFUL << FICR_CPTEST1_LOTID3_Pos) /*!< Bit mask of LOTID3 field. */

/* Bits 15..8 : 2nd ascii byte of Lot ID character */
#define FICR_CPTEST1_LOTID2_Pos (8UL) /*!< Position of LOTID2 field. */
#define FICR_CPTEST1_LOTID2_Msk (0xFFUL << FICR_CPTEST1_LOTID2_Pos) /*!< Bit mask of LOTID2 field. */

/* Bits 7..0 : 1st ascii byte of Lot ID character */
#define FICR_CPTEST1_LOTID1_Pos (0UL) /*!< Position of LOTID1 field. */
#define FICR_CPTEST1_LOTID1_Msk (0xFFUL << FICR_CPTEST1_LOTID1_Pos) /*!< Bit mask of LOTID1 field. */

/* Register: FICR_CPTEST2 */
/* Description: Result from Circuit Probe test */

/* Bits 31..24 : Device X-coordinate, always &gt;=0, offset so that the leftmost value on wafer is 0 */
#define FICR_CPTEST2_XCOORD_Pos (24UL) /*!< Position of XCOORD field. */
#define FICR_CPTEST2_XCOORD_Msk (0xFFUL << FICR_CPTEST2_XCOORD_Pos) /*!< Bit mask of XCOORD field. */

/* Bits 23..16 : Wafer number, 1 byte integer */
#define FICR_CPTEST2_WAFER_Pos (16UL) /*!< Position of WAFER field. */
#define FICR_CPTEST2_WAFER_Msk (0xFFUL << FICR_CPTEST2_WAFER_Pos) /*!< Bit mask of WAFER field. */

/* Bits 15..8 : 6th ascii byte of Lot ID character */
#define FICR_CPTEST2_LOTID6_Pos (8UL) /*!< Position of LOTID6 field. */
#define FICR_CPTEST2_LOTID6_Msk (0xFFUL << FICR_CPTEST2_LOTID6_Pos) /*!< Bit mask of LOTID6 field. */

/* Bits 7..0 : 5th ascii byte of Lot ID character */
#define FICR_CPTEST2_LOTID5_Pos (0UL) /*!< Position of LOTID5 field. */
#define FICR_CPTEST2_LOTID5_Msk (0xFFUL << FICR_CPTEST2_LOTID5_Pos) /*!< Bit mask of LOTID5 field. */

/* Register: FICR_CPTEST3 */
/* Description: Result from Circuit Probe test */

/* Bits 31..24 : Data Retention (DR) flag */
#define FICR_CPTEST3_DR3_Pos (24UL) /*!< Position of DR3 field. */
#define FICR_CPTEST3_DR3_Msk (0xFFUL << FICR_CPTEST3_DR3_Pos) /*!< Bit mask of DR3 field. */

/* Bits 23..16 : Data Retention (DR) flag */
#define FICR_CPTEST3_DR2_Pos (16UL) /*!< Position of DR2 field. */
#define FICR_CPTEST3_DR2_Msk (0xFFUL << FICR_CPTEST3_DR2_Pos) /*!< Bit mask of DR2 field. */

/* Bits 15..8 : Data Retention (DR) flag */
#define FICR_CPTEST3_DR1_Pos (8UL) /*!< Position of DR1 field. */
#define FICR_CPTEST3_DR1_Msk (0xFFUL << FICR_CPTEST3_DR1_Pos) /*!< Bit mask of DR1 field. */

/* Bits 7..0 : Device Y-coordinate, always &gt;=0, offset so that the bottom value on wafer is 0 */
#define FICR_CPTEST3_YCOORD_Pos (0UL) /*!< Position of YCOORD field. */
#define FICR_CPTEST3_YCOORD_Msk (0xFFUL << FICR_CPTEST3_YCOORD_Pos) /*!< Bit mask of YCOORD field. */

/* Register: FICR_CPTEST4 */
/* Description: Result from Circuit Probe test */

/* Bits 7..0 : Data Retention (DR) flag */
#define FICR_CPTEST4_DR4_Pos (0UL) /*!< Position of DR4 field. */
#define FICR_CPTEST4_DR4_Msk (0xFFUL << FICR_CPTEST4_DR4_Pos) /*!< Bit mask of DR4 field. */

/* Register: FICR_CPTEST5 */
/* Description: Result from Circuit Probe test, flash repair information */

/* Bits 31..0 : flash repair information */
#define FICR_CPTEST5_CPTEST5_Pos (0UL) /*!< Position of CPTEST5 field. */
#define FICR_CPTEST5_CPTEST5_Msk (0xFFFFFFFFUL << FICR_CPTEST5_CPTEST5_Pos) /*!< Bit mask of CPTEST5 field. */

