adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bits 31..0 : Address */
#define FICR_TRIMCNF_ADDR_Address_Pos (0UL) /*!< Position of Address field. */
#define FICR_TRIMCNF_ADDR_Address_Msk (0xFFFFFFFFUL << FICR_TRIMCNF_ADDR_Address_Pos) /*!< Bit mask of Address field. */

/* Register: FICR_TRIMCNF_DATA */
/* Description: Description cluster: Data */

/* Bits 31..0 : Data */
#define FICR_TRIMCNF_DATA_Data_Pos (0UL) /*!< Position of Data field. */
#define FICR_TRIMCNF_DATA_Data_Msk (0xFFFFFFFFUL << FICR_TRIMCNF_DATA_Data_Pos) /*!< Bit mask of Data field. */

/* Register: FICR_PRODTEST */
/* Description: Description collection: Production test control n */

/* Bits 31..0 : Production test control (majority vote done for each bit over all three fields to get the used value) */
#define FICR_PRODTEST_PRODTEST_Pos (0UL) /*!< Position of PRODTEST field. */
#define FICR_PRODTEST_PRODTEST_Msk (0xFFFFFFFFUL << FICR_PRODTEST_PRODTEST_Pos) /*!< Bit mask of PRODTEST field. */
#define FICR_PRODTEST_PRODTEST_Done (0xBB42319FUL) /*!< Production tests done */
#define FICR_PRODTEST_PRODTEST_NotDone (0xFFFFFFFFUL) /*!< Production tests not done, SoC is in Virgin mode (with any other value than 0xBB42319F) */

/* Register: FICR_BPROTINIT */
/* Description: BPROT initialization data */

/* Bits 31..0 : BPROT CONFIG0 initialization data, covering 32 lowest 4kbyte blocks of Flash */
#define FICR_BPROTINIT_BPROTINIT_Pos (0UL) /*!< Position of BPROTINIT field. */
#define FICR_BPROTINIT_BPROTINIT_Msk (0xFFFFFFFFUL << FICR_BPROTINIT_BPROTINIT_Pos) /*!< Bit mask of BPROTINIT field. */

/* Register: FICR_PUBLICID */
/* Description: Description collection: Public ID n */

/* Bits 31..0 : Public ID (32 bits of a 128 bit field) */
#define FICR_PUBLICID_PUBLICID_Pos (0UL) /*!< Position of PUBLICID field. */
#define FICR_PUBLICID_PUBLICID_Msk (0xFFFFFFFFUL << FICR_PUBLICID_PUBLICID_Pos) /*!< Bit mask of PUBLICID field. */

/* Register: FICR_IMEI */
/* Description: Description collection: IMEI n */

/* Bits 31..0 : IMEI in BCD decoded nibbles */
#define FICR_IMEI_IMEI_Pos (0UL) /*!< Position of IMEI field. */
#define FICR_IMEI_IMEI_Msk (0xFFFFFFFFUL << FICR_IMEI_IMEI_Pos) /*!< Bit mask of IMEI field. */

/* Register: FICR_MAC0 */
/* Description: Description collection: MAC0 n */

/* Bits 31..0 : MAC0 value */
#define FICR_MAC0_MAC0_Pos (0UL) /*!< Position of MAC0 field. */
#define FICR_MAC0_MAC0_Msk (0xFFFFFFFFUL << FICR_MAC0_MAC0_Pos) /*!< Bit mask of MAC0 field. */

/* Register: FICR_MAC1 */
/* Description: Description collection: MAC1 n */

/* Bits 31..0 : MAC1 value */
#define FICR_MAC1_MAC1_Pos (0UL) /*!< Position of MAC1 field. */
#define FICR_MAC1_MAC1_Msk (0xFFFFFFFFUL << FICR_MAC1_MAC1_Pos) /*!< Bit mask of MAC1 field. */

/* Register: FICR_MAC2 */
/* Description: Description collection: MAC2 n */

/* Bits 31..0 : MAC2 value */
#define FICR_MAC2_MAC2_Pos (0UL) /*!< Position of MAC2 field. */
#define FICR_MAC2_MAC2_Msk (0xFFFFFFFFUL << FICR_MAC2_MAC2_Pos) /*!< Bit mask of MAC2 field. */

/* Register: FICR_MAC3 */
/* Description: Description collection: MAC3 n */

/* Bits 31..0 : MAC3 value */
#define FICR_MAC3_MAC3_Pos (0UL) /*!< Position of MAC3 field. */
#define FICR_MAC3_MAC3_Msk (0xFFFFFFFFUL << FICR_MAC3_MAC3_Pos) /*!< Bit mask of MAC3 field. */

/* Register: FICR_DEVCONF */
/* Description: Description collection: Device configuration n */

/* Bits 31..0 : Device configuration data, contents defined in SW */
#define FICR_DEVCONF_DEVCONF_Pos (0UL) /*!< Position of DEVCONF field. */
#define FICR_DEVCONF_DEVCONF_Msk (0xFFFFFFFFUL << FICR_DEVCONF_DEVCONF_Pos) /*!< Bit mask of DEVCONF field. */

/* Register: FICR_DOWNGRADEPREV */
/* Description: Downgrade prevention control. Totally 128 bits within 256 bytes,
                located in groups of 8 bits per 128 bit word (distributed due to 
                Flash write count limit) */

/* Bits 7..0 : Downgrade prevention control bits */
#define FICR_DOWNGRADEPREV_DOWNGRADEPREV_Pos (0UL) /*!< Position of DOWNGRADEPREV field. */
#define FICR_DOWNGRADEPREV_DOWNGRADEPREV_Msk (0xFFUL << FICR_DOWNGRADEPREV_DOWNGRADEPREV_Pos) /*!< Bit mask of DOWNGRADEPREV field. */

/* Register: FICR_KEYREVOCATION */
/* Description: Key revocation control */

/* Bit 3 : Root key 3 (this key shall always be enabled, regardless of the value) */
#define FICR_KEYREVOCATION_KEY3_Pos (3UL) /*!< Position of KEY3 field. */
#define FICR_KEYREVOCATION_KEY3_Msk (0x1UL << FICR_KEYREVOCATION_KEY3_Pos) /*!< Bit mask of KEY3 field. */
#define FICR_KEYREVOCATION_KEY3_Disabled (0UL) /*!< Key disabled */
#define FICR_KEYREVOCATION_KEY3_Enabled (1UL) /*!< Key enabled */

/* Bit 2 : Root key 2 */
#define FICR_KEYREVOCATION_KEY2_Pos (2UL) /*!< Position of KEY2 field. */
#define FICR_KEYREVOCATION_KEY2_Msk (0x1UL << FICR_KEYREVOCATION_KEY2_Pos) /*!< Bit mask of KEY2 field. */
#define FICR_KEYREVOCATION_KEY2_Disabled (0UL) /*!< Key disabled */
#define FICR_KEYREVOCATION_KEY2_Enabled (1UL) /*!< Key enabled */

/* Bit 1 : Root key 1 */
#define FICR_KEYREVOCATION_KEY1_Pos (1UL) /*!< Position of KEY1 field. */
#define FICR_KEYREVOCATION_KEY1_Msk (0x1UL << FICR_KEYREVOCATION_KEY1_Pos) /*!< Bit mask of KEY1 field. */
#define FICR_KEYREVOCATION_KEY1_Disabled (0UL) /*!< Key disabled */
#define FICR_KEYREVOCATION_KEY1_Enabled (1UL) /*!< Key enabled */

/* Bit 0 : Root key 0 */
#define FICR_KEYREVOCATION_KEY0_Pos (0UL) /*!< Position of KEY0 field. */
#define FICR_KEYREVOCATION_KEY0_Msk (0x1UL << FICR_KEYREVOCATION_KEY0_Pos) /*!< Bit mask of KEY0 field. */
#define FICR_KEYREVOCATION_KEY0_Disabled (0UL) /*!< Key disabled */
#define FICR_KEYREVOCATION_KEY0_Enabled (1UL) /*!< Key enabled */

/* Register: FICR_LIFECYCLESTATE */
/* Description: Lifecycle state [7:0] */

/* Bit 7 : Secure Control reset request mask */
#define FICR_LIFECYCLESTATE_MASKRESETREQUEST_Pos (7UL) /*!< Position of MASKRESETREQUEST field. */
#define FICR_LIFECYCLESTATE_MASKRESETREQUEST_Msk (0x1UL << FICR_LIFECYCLESTATE_MASKRESETREQUEST_Pos) /*!< Bit mask of MASKRESETREQUEST field. */
#define FICR_LIFECYCLESTATE_MASKRESETREQUEST_Disabled (0UL) /*!< Reset request mask disabled */
#define FICR_LIFECYCLESTATE_MASKRESETREQUEST_Enabled (1UL) /*!< Reset request mask enabled */

/* Bits 3..0 : Lifecycle state */
#define FICR_LIFECYCLESTATE_LIFECYCLESTATE_Pos (0UL) /*!< Position of LIFECYCLESTATE field. */
#define FICR_LIFECYCLESTATE_LIFECYCLESTATE_Msk (0xFUL << FICR_LIFECYCLESTATE_LIFECYCLESTATE_Pos) /*!< Bit mask of LIFECYCLESTATE field. */
#define FICR_LIFECYCLESTATE_LIFECYCLESTATE_DIS (0x0UL) /*!< Disabled chip (Other bit combinations) */
#define FICR_LIFECYCLESTATE_LIFECYCLESTATE_FFR (0x4UL) /*!< Field failure return chip (b'01XX) */
#define FICR_LIFECYCLESTATE_LIFECYCLESTATE_RD (0xBUL) /*!< R&amp;D chip (b'1011) */
#define FICR_LIFECYCLESTATE_LIFECYCLESTATE_SEC (0xCUL) /*!< Secure chip (b'110X) */
#define FICR_LIFECYCLESTATE_LIFECYCLESTATE_MF (0xEUL) /*!< Manufactured chip (b'1110) */
#define FICR_LIFECYCLESTATE_LIFECYCLESTATE_VIR (0xFUL) /*!< Virgin chip (b'1111) */

