adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Register: FICR_DEBUGCNTRL0 */
/* Description: Debug control bits [7:0] */

/* Bit 7 : DSP non-invasive debug control */
#define FICR_DEBUGCNTRL0_OTP_DSP_NIDEN_Pos (7UL) /*!< Position of OTP_DSP_NIDEN field. */
#define FICR_DEBUGCNTRL0_OTP_DSP_NIDEN_Msk (0x1UL << FICR_DEBUGCNTRL0_OTP_DSP_NIDEN_Pos) /*!< Bit mask of OTP_DSP_NIDEN field. */
#define FICR_DEBUGCNTRL0_OTP_DSP_NIDEN_Disabled (0UL) /*!< Debug disabled (DSP NIDEN=0) */
#define FICR_DEBUGCNTRL0_OTP_DSP_NIDEN_Enabled (1UL) /*!< Debug enabled (DSP NIDEN=1) */

/* Bit 6 : DSP invasive debug control */
#define FICR_DEBUGCNTRL0_OTP_DSP_DBGEN_Pos (6UL) /*!< Position of OTP_DSP_DBGEN field. */
#define FICR_DEBUGCNTRL0_OTP_DSP_DBGEN_Msk (0x1UL << FICR_DEBUGCNTRL0_OTP_DSP_DBGEN_Pos) /*!< Bit mask of OTP_DSP_DBGEN field. */
#define FICR_DEBUGCNTRL0_OTP_DSP_DBGEN_Disabled (0UL) /*!< Debug disabled (DSP DBGEN=0) */
#define FICR_DEBUGCNTRL0_OTP_DSP_DBGEN_Enabled (1UL) /*!< Debug enabled (DSP DBGEN=1) */

/* Bit 5 : M0 non-invasive debug control */
#define FICR_DEBUGCNTRL0_OTP_M0_NIDEN_Pos (5UL) /*!< Position of OTP_M0_NIDEN field. */
#define FICR_DEBUGCNTRL0_OTP_M0_NIDEN_Msk (0x1UL << FICR_DEBUGCNTRL0_OTP_M0_NIDEN_Pos) /*!< Bit mask of OTP_M0_NIDEN field. */
#define FICR_DEBUGCNTRL0_OTP_M0_NIDEN_Disabled (0UL) /*!< Debug disabled (M0 NIDEN=0) */
#define FICR_DEBUGCNTRL0_OTP_M0_NIDEN_Enabled (1UL) /*!< Debug enabled (M0 NIDEN=1) */

/* Bit 4 : M0 invasive debug control */
#define FICR_DEBUGCNTRL0_OTP_M0_DBGEN_Pos (4UL) /*!< Position of OTP_M0_DBGEN field. */
#define FICR_DEBUGCNTRL0_OTP_M0_DBGEN_Msk (0x1UL << FICR_DEBUGCNTRL0_OTP_M0_DBGEN_Pos) /*!< Bit mask of OTP_M0_DBGEN field. */
#define FICR_DEBUGCNTRL0_OTP_M0_DBGEN_Disabled (0UL) /*!< Debug disabled (M0 DBGEN=0) */
#define FICR_DEBUGCNTRL0_OTP_M0_DBGEN_Enabled (1UL) /*!< Debug enabled (M0 DBGEN=1) */

/* Bit 3 : M4 secure non-invasive debug control */
#define FICR_DEBUGCNTRL0_OTP_M4_SPNIDEN_Pos (3UL) /*!< Position of OTP_M4_SPNIDEN field. */
#define FICR_DEBUGCNTRL0_OTP_M4_SPNIDEN_Msk (0x1UL << FICR_DEBUGCNTRL0_OTP_M4_SPNIDEN_Pos) /*!< Bit mask of OTP_M4_SPNIDEN field. */
#define FICR_DEBUGCNTRL0_OTP_M4_SPNIDEN_Disabled (0UL) /*!< Secure debug disabled (M4 NIDEN=0 while M4 is in secure mode) */
#define FICR_DEBUGCNTRL0_OTP_M4_SPNIDEN_Enabled (1UL) /*!< Secure debug enabled (M4 NIDEN=1 while M4 is in secure mode) */

/* Bit 2 : M4 secure invasive debug control */
#define FICR_DEBUGCNTRL0_OTP_M4_SPIDEN_Pos (2UL) /*!< Position of OTP_M4_SPIDEN field. */
#define FICR_DEBUGCNTRL0_OTP_M4_SPIDEN_Msk (0x1UL << FICR_DEBUGCNTRL0_OTP_M4_SPIDEN_Pos) /*!< Bit mask of OTP_M4_SPIDEN field. */
#define FICR_DEBUGCNTRL0_OTP_M4_SPIDEN_Disabled (0UL) /*!< Secure debug disabled (M4 DBGEN=0 while M4 is in secure mode) */
#define FICR_DEBUGCNTRL0_OTP_M4_SPIDEN_Enabled (1UL) /*!< Secure debug enabled (M4 DBGEN=1 while M4 is in secure mode) */

/* Bit 1 : M4 non-invasive debug control */
#define FICR_DEBUGCNTRL0_OTP_M4_NIDEN_Pos (1UL) /*!< Position of OTP_M4_NIDEN field. */
#define FICR_DEBUGCNTRL0_OTP_M4_NIDEN_Msk (0x1UL << FICR_DEBUGCNTRL0_OTP_M4_NIDEN_Pos) /*!< Bit mask of OTP_M4_NIDEN field. */
#define FICR_DEBUGCNTRL0_OTP_M4_NIDEN_Disabled (0UL) /*!< Debug disabled (M4 NIDEN=0) */
#define FICR_DEBUGCNTRL0_OTP_M4_NIDEN_Enabled (1UL) /*!< Debug enabled (M4 NIDEN=1) */

/* Bit 0 : M4 invasive debug control */
#define FICR_DEBUGCNTRL0_OTP_M4_DBGEN_Pos (0UL) /*!< Position of OTP_M4_DBGEN field. */
#define FICR_DEBUGCNTRL0_OTP_M4_DBGEN_Msk (0x1UL << FICR_DEBUGCNTRL0_OTP_M4_DBGEN_Pos) /*!< Bit mask of OTP_M4_DBGEN field. */
#define FICR_DEBUGCNTRL0_OTP_M4_DBGEN_Disabled (0UL) /*!< Debug disabled (M4 DBGEN=0) */
#define FICR_DEBUGCNTRL0_OTP_M4_DBGEN_Enabled (1UL) /*!< Debug enabled (M4 DBGEN=1) */

/* Register: FICR_DEBUGCNTRL1 */
/* Description: Debug control bits [13:8] */

/* Bit 5 : M4F non-invasive debug control */
#define FICR_DEBUGCNTRL1_OTP_M4F_NIDEN_Pos (5UL) /*!< Position of OTP_M4F_NIDEN field. */
#define FICR_DEBUGCNTRL1_OTP_M4F_NIDEN_Msk (0x1UL << FICR_DEBUGCNTRL1_OTP_M4F_NIDEN_Pos) /*!< Bit mask of OTP_M4F_NIDEN field. */
#define FICR_DEBUGCNTRL1_OTP_M4F_NIDEN_Disabled (0UL) /*!< Debug disabled (M4F NIDEN=0) */
#define FICR_DEBUGCNTRL1_OTP_M4F_NIDEN_Enabled (1UL) /*!< Debug enabled (M4F NIDEN=1) */

/* Bit 4 : M4F invasive debug control */
#define FICR_DEBUGCNTRL1_OTP_M4F_DBGEN_Pos (4UL) /*!< Position of OTP_M4F_DBGEN field. */
#define FICR_DEBUGCNTRL1_OTP_M4F_DBGEN_Msk (0x1UL << FICR_DEBUGCNTRL1_OTP_M4F_DBGEN_Pos) /*!< Bit mask of OTP_M4F_DBGEN field. */
#define FICR_DEBUGCNTRL1_OTP_M4F_DBGEN_Disabled (0UL) /*!< Debug disabled (M4F DBGEN=0) */
#define FICR_DEBUGCNTRL1_OTP_M4F_DBGEN_Enabled (1UL) /*!< Debug enabled (M4F DBGEN=1) */

/* Bit 3 : Coresight secure non-invasive debug control */
#define FICR_DEBUGCNTRL1_OTP_CS_SPNIDEN_Pos (3UL) /*!< Position of OTP_CS_SPNIDEN field. */
#define FICR_DEBUGCNTRL1_OTP_CS_SPNIDEN_Msk (0x1UL << FICR_DEBUGCNTRL1_OTP_CS_SPNIDEN_Pos) /*!< Bit mask of OTP_CS_SPNIDEN field. */
#define FICR_DEBUGCNTRL1_OTP_CS_SPNIDEN_Disabled (0UL) /*!< Secure debug disabled (Coresight SPNIDEN=0) */
#define FICR_DEBUGCNTRL1_OTP_CS_SPNIDEN_Enabled (1UL) /*!< Secure debug enabled (Coresight SPNIDEN=1) */

/* Bit 2 : Coresight secure invasive debug control */
#define FICR_DEBUGCNTRL1_OTP_CS_SPIDEN_Pos (2UL) /*!< Position of OTP_CS_SPIDEN field. */
#define FICR_DEBUGCNTRL1_OTP_CS_SPIDEN_Msk (0x1UL << FICR_DEBUGCNTRL1_OTP_CS_SPIDEN_Pos) /*!< Bit mask of OTP_CS_SPIDEN field. */
#define FICR_DEBUGCNTRL1_OTP_CS_SPIDEN_Disabled (0UL) /*!< Secure debug disabled (Coresight SPIDEN=0) */
#define FICR_DEBUGCNTRL1_OTP_CS_SPIDEN_Enabled (1UL) /*!< Secure debug enabled (Coresight SPIDEN=1) */

/* Bit 1 : Coresight non-invasive debug control */
#define FICR_DEBUGCNTRL1_OTP_CS_NIDEN_Pos (1UL) /*!< Position of OTP_CS_NIDEN field. */
#define FICR_DEBUGCNTRL1_OTP_CS_NIDEN_Msk (0x1UL << FICR_DEBUGCNTRL1_OTP_CS_NIDEN_Pos) /*!< Bit mask of OTP_CS_NIDEN field. */
#define FICR_DEBUGCNTRL1_OTP_CS_NIDEN_Disabled (0UL) /*!< Debug disabled (Coresight NIDEN=0) */
#define FICR_DEBUGCNTRL1_OTP_CS_NIDEN_Enabled (1UL) /*!< Debug enabled (Coresight NIDEN=1) */

/* Bit 0 : Coresight invasive debug control */
#define FICR_DEBUGCNTRL1_OTP_CS_DBGEN_Pos (0UL) /*!< Position of OTP_CS_DBGEN field. */
#define FICR_DEBUGCNTRL1_OTP_CS_DBGEN_Msk (0x1UL << FICR_DEBUGCNTRL1_OTP_CS_DBGEN_Pos) /*!< Bit mask of OTP_CS_DBGEN field. */
#define FICR_DEBUGCNTRL1_OTP_CS_DBGEN_Disabled (0UL) /*!< Debug disabled (Coresight DBGEN=0) */
#define FICR_DEBUGCNTRL1_OTP_CS_DBGEN_Enabled (1UL) /*!< Debug enabled (Coresight DBGEN=1) */

/* Register: FICR_UNLOCKCODESTATE */
/* Description: SIM unlock code state for each lock level */

