adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 5 : State of master unlock code */
#define FICR_UNLOCKCODESTATE_MASTERCODESTATE_Pos (5UL) /*!< Position of MASTERCODESTATE field. */
#define FICR_UNLOCKCODESTATE_MASTERCODESTATE_Msk (0x1UL << FICR_UNLOCKCODESTATE_MASTERCODESTATE_Pos) /*!< Bit mask of MASTERCODESTATE field. */
#define FICR_UNLOCKCODESTATE_MASTERCODESTATE_Active (0UL) /*!< Unlock code activated */
#define FICR_UNLOCKCODESTATE_MASTERCODESTATE_NotActive (1UL) /*!< Unlock code not activated */

/* Bit 4 : State of SIM/USIM unlock code */
#define FICR_UNLOCKCODESTATE_PCKSTATE_Pos (4UL) /*!< Position of PCKSTATE field. */
#define FICR_UNLOCKCODESTATE_PCKSTATE_Msk (0x1UL << FICR_UNLOCKCODESTATE_PCKSTATE_Pos) /*!< Bit mask of PCKSTATE field. */
#define FICR_UNLOCKCODESTATE_PCKSTATE_Active (0UL) /*!< Unlock code activated */
#define FICR_UNLOCKCODESTATE_PCKSTATE_NotActive (1UL) /*!< Unlock code not activated */

/* Bit 3 : State of corporate unlock code */
#define FICR_UNLOCKCODESTATE_CCKSTATE_Pos (3UL) /*!< Position of CCKSTATE field. */
#define FICR_UNLOCKCODESTATE_CCKSTATE_Msk (0x1UL << FICR_UNLOCKCODESTATE_CCKSTATE_Pos) /*!< Bit mask of CCKSTATE field. */
#define FICR_UNLOCKCODESTATE_CCKSTATE_Active (0UL) /*!< Unlock code activated */
#define FICR_UNLOCKCODESTATE_CCKSTATE_NotActive (1UL) /*!< Unlock code not activated */

/* Bit 2 : State of service provider unlock code */
#define FICR_UNLOCKCODESTATE_SPCKSTATE_Pos (2UL) /*!< Position of SPCKSTATE field. */
#define FICR_UNLOCKCODESTATE_SPCKSTATE_Msk (0x1UL << FICR_UNLOCKCODESTATE_SPCKSTATE_Pos) /*!< Bit mask of SPCKSTATE field. */
#define FICR_UNLOCKCODESTATE_SPCKSTATE_Active (0UL) /*!< Unlock code activated */
#define FICR_UNLOCKCODESTATE_SPCKSTATE_NotActive (1UL) /*!< Unlock code not activated */

/* Bit 1 : State of network subset unlock code */
#define FICR_UNLOCKCODESTATE_NSCKSTATE_Pos (1UL) /*!< Position of NSCKSTATE field. */
#define FICR_UNLOCKCODESTATE_NSCKSTATE_Msk (0x1UL << FICR_UNLOCKCODESTATE_NSCKSTATE_Pos) /*!< Bit mask of NSCKSTATE field. */
#define FICR_UNLOCKCODESTATE_NSCKSTATE_Active (0UL) /*!< Unlock code activated */
#define FICR_UNLOCKCODESTATE_NSCKSTATE_NotActive (1UL) /*!< Unlock code not activated */

/* Bit 0 : State of network unlock code */
#define FICR_UNLOCKCODESTATE_NCKSTATE_Pos (0UL) /*!< Position of NCKSTATE field. */
#define FICR_UNLOCKCODESTATE_NCKSTATE_Msk (0x1UL << FICR_UNLOCKCODESTATE_NCKSTATE_Pos) /*!< Bit mask of NCKSTATE field. */
#define FICR_UNLOCKCODESTATE_NCKSTATE_Active (0UL) /*!< Unlock code activated */
#define FICR_UNLOCKCODESTATE_NCKSTATE_NotActive (1UL) /*!< Unlock code not activated */

/* Register: FICR_SIMLOCKDISABLE */
/* Description: SIM lock controls for each lock level. 
                Disabling removes lock permanently */

/* Bit 4 : SIM/USIM lock control */
#define FICR_SIMLOCKDISABLE_PCKDISABLING_Pos (4UL) /*!< Position of PCKDISABLING field. */
#define FICR_SIMLOCKDISABLE_PCKDISABLING_Msk (0x1UL << FICR_SIMLOCKDISABLE_PCKDISABLING_Pos) /*!< Bit mask of PCKDISABLING field. */
#define FICR_SIMLOCKDISABLE_PCKDISABLING_Disabled (0UL) /*!< Lock disabled */
#define FICR_SIMLOCKDISABLE_PCKDISABLING_NotDisabled (1UL) /*!< Lock not disabled */

/* Bit 3 : Corporate lock control */
#define FICR_SIMLOCKDISABLE_CCKDISABLING_Pos (3UL) /*!< Position of CCKDISABLING field. */
#define FICR_SIMLOCKDISABLE_CCKDISABLING_Msk (0x1UL << FICR_SIMLOCKDISABLE_CCKDISABLING_Pos) /*!< Bit mask of CCKDISABLING field. */
#define FICR_SIMLOCKDISABLE_CCKDISABLING_Disabled (0UL) /*!< Lock disabled */
#define FICR_SIMLOCKDISABLE_CCKDISABLING_NotDisabled (1UL) /*!< Lock not disabled */

/* Bit 2 : Service provider lock control */
#define FICR_SIMLOCKDISABLE_SPCKDISABLING_Pos (2UL) /*!< Position of SPCKDISABLING field. */
#define FICR_SIMLOCKDISABLE_SPCKDISABLING_Msk (0x1UL << FICR_SIMLOCKDISABLE_SPCKDISABLING_Pos) /*!< Bit mask of SPCKDISABLING field. */
#define FICR_SIMLOCKDISABLE_SPCKDISABLING_Disabled (0UL) /*!< Lock disabled */
#define FICR_SIMLOCKDISABLE_SPCKDISABLING_NotDisabled (1UL) /*!< Lock not disabled */

/* Bit 1 : Network subset lock control */
#define FICR_SIMLOCKDISABLE_NSCKDISABLING_Pos (1UL) /*!< Position of NSCKDISABLING field. */
#define FICR_SIMLOCKDISABLE_NSCKDISABLING_Msk (0x1UL << FICR_SIMLOCKDISABLE_NSCKDISABLING_Pos) /*!< Bit mask of NSCKDISABLING field. */
#define FICR_SIMLOCKDISABLE_NSCKDISABLING_Disabled (0UL) /*!< Lock disabled */
#define FICR_SIMLOCKDISABLE_NSCKDISABLING_NotDisabled (1UL) /*!< Lock not disabled */

/* Bit 0 : Network lock control */
#define FICR_SIMLOCKDISABLE_NCKDISABLING_Pos (0UL) /*!< Position of NCKDISABLING field. */
#define FICR_SIMLOCKDISABLE_NCKDISABLING_Msk (0x1UL << FICR_SIMLOCKDISABLE_NCKDISABLING_Pos) /*!< Bit mask of NCKDISABLING field. */
#define FICR_SIMLOCKDISABLE_NCKDISABLING_Disabled (0UL) /*!< Lock disabled */
#define FICR_SIMLOCKDISABLE_NCKDISABLING_NotDisabled (1UL) /*!< Lock not disabled */

/* Register: FICR_SECMASTERKEY */
/* Description: Description collection: Secure master key n */

/* Bits 31..0 : Unique secure master key, word n, readable only by HW */
#define FICR_SECMASTERKEY_SECMASTERKEY_Pos (0UL) /*!< Position of SECMASTERKEY field. */
#define FICR_SECMASTERKEY_SECMASTERKEY_Msk (0xFFFFFFFFUL << FICR_SECMASTERKEY_SECMASTERKEY_Pos) /*!< Bit mask of SECMASTERKEY field. */


/* Peripheral: GPIOTE */
/* Description: GPIO Tasks and Events 0 */

/* Register: GPIOTE_TASKS_OUT */
/* Description: Description collection: Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is configured in CONFIG[n].POLARITY. */

/* Bit 0 : Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is configured in CONFIG[n].POLARITY. */
#define GPIOTE_TASKS_OUT_TASKS_OUT_Pos (0UL) /*!< Position of TASKS_OUT field. */
#define GPIOTE_TASKS_OUT_TASKS_OUT_Msk (0x1UL << GPIOTE_TASKS_OUT_TASKS_OUT_Pos) /*!< Bit mask of TASKS_OUT field. */
#define GPIOTE_TASKS_OUT_TASKS_OUT_Trigger (1UL) /*!< Trigger task */

/* Register: GPIOTE_TASKS_SET */
/* Description: Description collection: Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it high. */

