adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 4 : Write '1' to enable interrupt for event RECEIVE[4] */
#define IPC_INTENSET1_RECEIVE4_Pos (4UL) /*!< Position of RECEIVE4 field. */
#define IPC_INTENSET1_RECEIVE4_Msk (0x1UL << IPC_INTENSET1_RECEIVE4_Pos) /*!< Bit mask of RECEIVE4 field. */
#define IPC_INTENSET1_RECEIVE4_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENSET1_RECEIVE4_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENSET1_RECEIVE4_Set (1UL) /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event RECEIVE[3] */
#define IPC_INTENSET1_RECEIVE3_Pos (3UL) /*!< Position of RECEIVE3 field. */
#define IPC_INTENSET1_RECEIVE3_Msk (0x1UL << IPC_INTENSET1_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field. */
#define IPC_INTENSET1_RECEIVE3_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENSET1_RECEIVE3_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENSET1_RECEIVE3_Set (1UL) /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event RECEIVE[2] */
#define IPC_INTENSET1_RECEIVE2_Pos (2UL) /*!< Position of RECEIVE2 field. */
#define IPC_INTENSET1_RECEIVE2_Msk (0x1UL << IPC_INTENSET1_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field. */
#define IPC_INTENSET1_RECEIVE2_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENSET1_RECEIVE2_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENSET1_RECEIVE2_Set (1UL) /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event RECEIVE[1] */
#define IPC_INTENSET1_RECEIVE1_Pos (1UL) /*!< Position of RECEIVE1 field. */
#define IPC_INTENSET1_RECEIVE1_Msk (0x1UL << IPC_INTENSET1_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field. */
#define IPC_INTENSET1_RECEIVE1_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENSET1_RECEIVE1_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENSET1_RECEIVE1_Set (1UL) /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event RECEIVE[0] */
#define IPC_INTENSET1_RECEIVE0_Pos (0UL) /*!< Position of RECEIVE0 field. */
#define IPC_INTENSET1_RECEIVE0_Msk (0x1UL << IPC_INTENSET1_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field. */
#define IPC_INTENSET1_RECEIVE0_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENSET1_RECEIVE0_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENSET1_RECEIVE0_Set (1UL) /*!< Enable */

/* Register: IPC_INTENCLR1 */
/* Description: Disable interrupt */

/* Bit 4 : Write '1' to disable interrupt for event RECEIVE[4] */
#define IPC_INTENCLR1_RECEIVE4_Pos (4UL) /*!< Position of RECEIVE4 field. */
#define IPC_INTENCLR1_RECEIVE4_Msk (0x1UL << IPC_INTENCLR1_RECEIVE4_Pos) /*!< Bit mask of RECEIVE4 field. */
#define IPC_INTENCLR1_RECEIVE4_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENCLR1_RECEIVE4_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENCLR1_RECEIVE4_Clear (1UL) /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event RECEIVE[3] */
#define IPC_INTENCLR1_RECEIVE3_Pos (3UL) /*!< Position of RECEIVE3 field. */
#define IPC_INTENCLR1_RECEIVE3_Msk (0x1UL << IPC_INTENCLR1_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field. */
#define IPC_INTENCLR1_RECEIVE3_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENCLR1_RECEIVE3_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENCLR1_RECEIVE3_Clear (1UL) /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event RECEIVE[2] */
#define IPC_INTENCLR1_RECEIVE2_Pos (2UL) /*!< Position of RECEIVE2 field. */
#define IPC_INTENCLR1_RECEIVE2_Msk (0x1UL << IPC_INTENCLR1_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field. */
#define IPC_INTENCLR1_RECEIVE2_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENCLR1_RECEIVE2_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENCLR1_RECEIVE2_Clear (1UL) /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event RECEIVE[1] */
#define IPC_INTENCLR1_RECEIVE1_Pos (1UL) /*!< Position of RECEIVE1 field. */
#define IPC_INTENCLR1_RECEIVE1_Msk (0x1UL << IPC_INTENCLR1_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field. */
#define IPC_INTENCLR1_RECEIVE1_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENCLR1_RECEIVE1_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENCLR1_RECEIVE1_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event RECEIVE[0] */
#define IPC_INTENCLR1_RECEIVE0_Pos (0UL) /*!< Position of RECEIVE0 field. */
#define IPC_INTENCLR1_RECEIVE0_Msk (0x1UL << IPC_INTENCLR1_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field. */
#define IPC_INTENCLR1_RECEIVE0_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENCLR1_RECEIVE0_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENCLR1_RECEIVE0_Clear (1UL) /*!< Disable */

/* Register: IPC_INTPEND1 */
/* Description: Pending interrupts */

/* Bit 4 : Read pending status of interrupt for event RECEIVE[4] */
#define IPC_INTPEND1_RECEIVE4_Pos (4UL) /*!< Position of RECEIVE4 field. */
#define IPC_INTPEND1_RECEIVE4_Msk (0x1UL << IPC_INTPEND1_RECEIVE4_Pos) /*!< Bit mask of RECEIVE4 field. */
#define IPC_INTPEND1_RECEIVE4_NotPending (0UL) /*!< Read: Not pending */
#define IPC_INTPEND1_RECEIVE4_Pending (1UL) /*!< Read: Pending */

/* Bit 3 : Read pending status of interrupt for event RECEIVE[3] */
#define IPC_INTPEND1_RECEIVE3_Pos (3UL) /*!< Position of RECEIVE3 field. */
#define IPC_INTPEND1_RECEIVE3_Msk (0x1UL << IPC_INTPEND1_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field. */
#define IPC_INTPEND1_RECEIVE3_NotPending (0UL) /*!< Read: Not pending */
#define IPC_INTPEND1_RECEIVE3_Pending (1UL) /*!< Read: Pending */

/* Bit 2 : Read pending status of interrupt for event RECEIVE[2] */
#define IPC_INTPEND1_RECEIVE2_Pos (2UL) /*!< Position of RECEIVE2 field. */
#define IPC_INTPEND1_RECEIVE2_Msk (0x1UL << IPC_INTPEND1_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field. */
#define IPC_INTPEND1_RECEIVE2_NotPending (0UL) /*!< Read: Not pending */
#define IPC_INTPEND1_RECEIVE2_Pending (1UL) /*!< Read: Pending */

/* Bit 1 : Read pending status of interrupt for event RECEIVE[1] */
#define IPC_INTPEND1_RECEIVE1_Pos (1UL) /*!< Position of RECEIVE1 field. */
#define IPC_INTPEND1_RECEIVE1_Msk (0x1UL << IPC_INTPEND1_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field. */
#define IPC_INTPEND1_RECEIVE1_NotPending (0UL) /*!< Read: Not pending */
#define IPC_INTPEND1_RECEIVE1_Pending (1UL) /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event RECEIVE[0] */
#define IPC_INTPEND1_RECEIVE0_Pos (0UL) /*!< Position of RECEIVE0 field. */
#define IPC_INTPEND1_RECEIVE0_Msk (0x1UL << IPC_INTPEND1_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field. */
#define IPC_INTPEND1_RECEIVE0_NotPending (0UL) /*!< Read: Not pending */
#define IPC_INTPEND1_RECEIVE0_Pending (1UL) /*!< Read: Pending */

/* Register: IPC_INTEN2 */
/* Description: Enable or disable interrupt */

/* Bit 4 : Enable or disable interrupt for event RECEIVE[4] */
#define IPC_INTEN2_RECEIVE4_Pos (4UL) /*!< Position of RECEIVE4 field. */
#define IPC_INTEN2_RECEIVE4_Msk (0x1UL << IPC_INTEN2_RECEIVE4_Pos) /*!< Bit mask of RECEIVE4 field. */
#define IPC_INTEN2_RECEIVE4_Disabled (0UL) /*!< Disable */
#define IPC_INTEN2_RECEIVE4_Enabled (1UL) /*!< Enable */

/* Bit 3 : Enable or disable interrupt for event RECEIVE[3] */
#define IPC_INTEN2_RECEIVE3_Pos (3UL) /*!< Position of RECEIVE3 field. */
#define IPC_INTEN2_RECEIVE3_Msk (0x1UL << IPC_INTEN2_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field. */
#define IPC_INTEN2_RECEIVE3_Disabled (0UL) /*!< Disable */
#define IPC_INTEN2_RECEIVE3_Enabled (1UL) /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event RECEIVE[2] */
#define IPC_INTEN2_RECEIVE2_Pos (2UL) /*!< Position of RECEIVE2 field. */
#define IPC_INTEN2_RECEIVE2_Msk (0x1UL << IPC_INTEN2_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field. */
#define IPC_INTEN2_RECEIVE2_Disabled (0UL) /*!< Disable */
#define IPC_INTEN2_RECEIVE2_Enabled (1UL) /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event RECEIVE[1] */
#define IPC_INTEN2_RECEIVE1_Pos (1UL) /*!< Position of RECEIVE1 field. */
#define IPC_INTEN2_RECEIVE1_Msk (0x1UL << IPC_INTEN2_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field. */
#define IPC_INTEN2_RECEIVE1_Disabled (0UL) /*!< Disable */
#define IPC_INTEN2_RECEIVE1_Enabled (1UL) /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event RECEIVE[0] */
#define IPC_INTEN2_RECEIVE0_Pos (0UL) /*!< Position of RECEIVE0 field. */
#define IPC_INTEN2_RECEIVE0_Msk (0x1UL << IPC_INTEN2_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field. */
#define IPC_INTEN2_RECEIVE0_Disabled (0UL) /*!< Disable */
#define IPC_INTEN2_RECEIVE0_Enabled (1UL) /*!< Enable */

/* Register: IPC_INTENSET2 */
/* Description: Enable interrupt */

