adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 4 : Write '1' to enable interrupt for event RECEIVE[4] */
#define IPC_INTENSET2_RECEIVE4_Pos (4UL) /*!< Position of RECEIVE4 field. */
#define IPC_INTENSET2_RECEIVE4_Msk (0x1UL << IPC_INTENSET2_RECEIVE4_Pos) /*!< Bit mask of RECEIVE4 field. */
#define IPC_INTENSET2_RECEIVE4_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENSET2_RECEIVE4_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENSET2_RECEIVE4_Set (1UL) /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event RECEIVE[3] */
#define IPC_INTENSET2_RECEIVE3_Pos (3UL) /*!< Position of RECEIVE3 field. */
#define IPC_INTENSET2_RECEIVE3_Msk (0x1UL << IPC_INTENSET2_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field. */
#define IPC_INTENSET2_RECEIVE3_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENSET2_RECEIVE3_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENSET2_RECEIVE3_Set (1UL) /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event RECEIVE[2] */
#define IPC_INTENSET2_RECEIVE2_Pos (2UL) /*!< Position of RECEIVE2 field. */
#define IPC_INTENSET2_RECEIVE2_Msk (0x1UL << IPC_INTENSET2_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field. */
#define IPC_INTENSET2_RECEIVE2_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENSET2_RECEIVE2_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENSET2_RECEIVE2_Set (1UL) /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event RECEIVE[1] */
#define IPC_INTENSET2_RECEIVE1_Pos (1UL) /*!< Position of RECEIVE1 field. */
#define IPC_INTENSET2_RECEIVE1_Msk (0x1UL << IPC_INTENSET2_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field. */
#define IPC_INTENSET2_RECEIVE1_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENSET2_RECEIVE1_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENSET2_RECEIVE1_Set (1UL) /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event RECEIVE[0] */
#define IPC_INTENSET2_RECEIVE0_Pos (0UL) /*!< Position of RECEIVE0 field. */
#define IPC_INTENSET2_RECEIVE0_Msk (0x1UL << IPC_INTENSET2_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field. */
#define IPC_INTENSET2_RECEIVE0_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENSET2_RECEIVE0_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENSET2_RECEIVE0_Set (1UL) /*!< Enable */

/* Register: IPC_INTENCLR2 */
/* Description: Disable interrupt */

/* Bit 4 : Write '1' to disable interrupt for event RECEIVE[4] */
#define IPC_INTENCLR2_RECEIVE4_Pos (4UL) /*!< Position of RECEIVE4 field. */
#define IPC_INTENCLR2_RECEIVE4_Msk (0x1UL << IPC_INTENCLR2_RECEIVE4_Pos) /*!< Bit mask of RECEIVE4 field. */
#define IPC_INTENCLR2_RECEIVE4_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENCLR2_RECEIVE4_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENCLR2_RECEIVE4_Clear (1UL) /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event RECEIVE[3] */
#define IPC_INTENCLR2_RECEIVE3_Pos (3UL) /*!< Position of RECEIVE3 field. */
#define IPC_INTENCLR2_RECEIVE3_Msk (0x1UL << IPC_INTENCLR2_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field. */
#define IPC_INTENCLR2_RECEIVE3_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENCLR2_RECEIVE3_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENCLR2_RECEIVE3_Clear (1UL) /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event RECEIVE[2] */
#define IPC_INTENCLR2_RECEIVE2_Pos (2UL) /*!< Position of RECEIVE2 field. */
#define IPC_INTENCLR2_RECEIVE2_Msk (0x1UL << IPC_INTENCLR2_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field. */
#define IPC_INTENCLR2_RECEIVE2_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENCLR2_RECEIVE2_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENCLR2_RECEIVE2_Clear (1UL) /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event RECEIVE[1] */
#define IPC_INTENCLR2_RECEIVE1_Pos (1UL) /*!< Position of RECEIVE1 field. */
#define IPC_INTENCLR2_RECEIVE1_Msk (0x1UL << IPC_INTENCLR2_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field. */
#define IPC_INTENCLR2_RECEIVE1_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENCLR2_RECEIVE1_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENCLR2_RECEIVE1_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event RECEIVE[0] */
#define IPC_INTENCLR2_RECEIVE0_Pos (0UL) /*!< Position of RECEIVE0 field. */
#define IPC_INTENCLR2_RECEIVE0_Msk (0x1UL << IPC_INTENCLR2_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field. */
#define IPC_INTENCLR2_RECEIVE0_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENCLR2_RECEIVE0_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENCLR2_RECEIVE0_Clear (1UL) /*!< Disable */

/* Register: IPC_INTPEND2 */
/* Description: Pending interrupts */

/* Bit 4 : Read pending status of interrupt for event RECEIVE[4] */
#define IPC_INTPEND2_RECEIVE4_Pos (4UL) /*!< Position of RECEIVE4 field. */
#define IPC_INTPEND2_RECEIVE4_Msk (0x1UL << IPC_INTPEND2_RECEIVE4_Pos) /*!< Bit mask of RECEIVE4 field. */
#define IPC_INTPEND2_RECEIVE4_NotPending (0UL) /*!< Read: Not pending */
#define IPC_INTPEND2_RECEIVE4_Pending (1UL) /*!< Read: Pending */

/* Bit 3 : Read pending status of interrupt for event RECEIVE[3] */
#define IPC_INTPEND2_RECEIVE3_Pos (3UL) /*!< Position of RECEIVE3 field. */
#define IPC_INTPEND2_RECEIVE3_Msk (0x1UL << IPC_INTPEND2_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field. */
#define IPC_INTPEND2_RECEIVE3_NotPending (0UL) /*!< Read: Not pending */
#define IPC_INTPEND2_RECEIVE3_Pending (1UL) /*!< Read: Pending */

/* Bit 2 : Read pending status of interrupt for event RECEIVE[2] */
#define IPC_INTPEND2_RECEIVE2_Pos (2UL) /*!< Position of RECEIVE2 field. */
#define IPC_INTPEND2_RECEIVE2_Msk (0x1UL << IPC_INTPEND2_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field. */
#define IPC_INTPEND2_RECEIVE2_NotPending (0UL) /*!< Read: Not pending */
#define IPC_INTPEND2_RECEIVE2_Pending (1UL) /*!< Read: Pending */

/* Bit 1 : Read pending status of interrupt for event RECEIVE[1] */
#define IPC_INTPEND2_RECEIVE1_Pos (1UL) /*!< Position of RECEIVE1 field. */
#define IPC_INTPEND2_RECEIVE1_Msk (0x1UL << IPC_INTPEND2_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field. */
#define IPC_INTPEND2_RECEIVE1_NotPending (0UL) /*!< Read: Not pending */
#define IPC_INTPEND2_RECEIVE1_Pending (1UL) /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event RECEIVE[0] */
#define IPC_INTPEND2_RECEIVE0_Pos (0UL) /*!< Position of RECEIVE0 field. */
#define IPC_INTPEND2_RECEIVE0_Msk (0x1UL << IPC_INTPEND2_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field. */
#define IPC_INTPEND2_RECEIVE0_NotPending (0UL) /*!< Read: Not pending */
#define IPC_INTPEND2_RECEIVE0_Pending (1UL) /*!< Read: Pending */

/* Register: IPC_SEND_CNF */
/* Description: Description collection: Send event configuration for TASKS_SEND[n]. */

/* Bit 16 : Enable broadcasting on channel 16. */
#define IPC_SEND_CNF_CHEN16_Pos (16UL) /*!< Position of CHEN16 field. */
#define IPC_SEND_CNF_CHEN16_Msk (0x1UL << IPC_SEND_CNF_CHEN16_Pos) /*!< Bit mask of CHEN16 field. */
#define IPC_SEND_CNF_CHEN16_Disable (0UL) /*!< Disable broadcast. */
#define IPC_SEND_CNF_CHEN16_Enable (1UL) /*!< Enable broadcast. */

/* Bit 15 : Enable broadcasting on channel 15. */
#define IPC_SEND_CNF_CHEN15_Pos (15UL) /*!< Position of CHEN15 field. */
#define IPC_SEND_CNF_CHEN15_Msk (0x1UL << IPC_SEND_CNF_CHEN15_Pos) /*!< Bit mask of CHEN15 field. */
#define IPC_SEND_CNF_CHEN15_Disable (0UL) /*!< Disable broadcast. */
#define IPC_SEND_CNF_CHEN15_Enable (1UL) /*!< Enable broadcast. */

/* Bit 14 : Enable broadcasting on channel 14. */
#define IPC_SEND_CNF_CHEN14_Pos (14UL) /*!< Position of CHEN14 field. */
#define IPC_SEND_CNF_CHEN14_Msk (0x1UL << IPC_SEND_CNF_CHEN14_Pos) /*!< Bit mask of CHEN14 field. */
#define IPC_SEND_CNF_CHEN14_Disable (0UL) /*!< Disable broadcast. */
#define IPC_SEND_CNF_CHEN14_Enable (1UL) /*!< Enable broadcast. */

/* Bit 13 : Enable broadcasting on channel 13. */
#define IPC_SEND_CNF_CHEN13_Pos (13UL) /*!< Position of CHEN13 field. */
#define IPC_SEND_CNF_CHEN13_Msk (0x1UL << IPC_SEND_CNF_CHEN13_Pos) /*!< Bit mask of CHEN13 field. */
#define IPC_SEND_CNF_CHEN13_Disable (0UL) /*!< Disable broadcast. */
#define IPC_SEND_CNF_CHEN13_Enable (1UL) /*!< Enable broadcast. */

/* Bit 12 : Enable broadcasting on channel 12. */
#define IPC_SEND_CNF_CHEN12_Pos (12UL) /*!< Position of CHEN12 field. */
#define IPC_SEND_CNF_CHEN12_Msk (0x1UL << IPC_SEND_CNF_CHEN12_Pos) /*!< Bit mask of CHEN12 field. */
#define IPC_SEND_CNF_CHEN12_Disable (0UL) /*!< Disable broadcast. */
#define IPC_SEND_CNF_CHEN12_Enable (1UL) /*!< Enable broadcast. */

/* Bit 11 : Enable broadcasting on channel 11. */
#define IPC_SEND_CNF_CHEN11_Pos (11UL) /*!< Position of CHEN11 field. */
#define IPC_SEND_CNF_CHEN11_Msk (0x1UL << IPC_SEND_CNF_CHEN11_Pos) /*!< Bit mask of CHEN11 field. */
#define IPC_SEND_CNF_CHEN11_Disable (0UL) /*!< Disable broadcast. */
#define IPC_SEND_CNF_CHEN11_Enable (1UL) /*!< Enable broadcast. */

