adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 9 : Enable subscription to channel 9. */
#define IPC_RECEIVE_CNF_CHEN9_Pos (9UL) /*!< Position of CHEN9 field. */
#define IPC_RECEIVE_CNF_CHEN9_Msk (0x1UL << IPC_RECEIVE_CNF_CHEN9_Pos) /*!< Bit mask of CHEN9 field. */
#define IPC_RECEIVE_CNF_CHEN9_Disable (0UL) /*!< Disable events. */
#define IPC_RECEIVE_CNF_CHEN9_Enable (1UL) /*!< Enable events. */

/* Bit 8 : Enable subscription to channel 8. */
#define IPC_RECEIVE_CNF_CHEN8_Pos (8UL) /*!< Position of CHEN8 field. */
#define IPC_RECEIVE_CNF_CHEN8_Msk (0x1UL << IPC_RECEIVE_CNF_CHEN8_Pos) /*!< Bit mask of CHEN8 field. */
#define IPC_RECEIVE_CNF_CHEN8_Disable (0UL) /*!< Disable events. */
#define IPC_RECEIVE_CNF_CHEN8_Enable (1UL) /*!< Enable events. */

/* Bit 7 : Enable subscription to channel 7. */
#define IPC_RECEIVE_CNF_CHEN7_Pos (7UL) /*!< Position of CHEN7 field. */
#define IPC_RECEIVE_CNF_CHEN7_Msk (0x1UL << IPC_RECEIVE_CNF_CHEN7_Pos) /*!< Bit mask of CHEN7 field. */
#define IPC_RECEIVE_CNF_CHEN7_Disable (0UL) /*!< Disable events. */
#define IPC_RECEIVE_CNF_CHEN7_Enable (1UL) /*!< Enable events. */

/* Bit 6 : Enable subscription to channel 6. */
#define IPC_RECEIVE_CNF_CHEN6_Pos (6UL) /*!< Position of CHEN6 field. */
#define IPC_RECEIVE_CNF_CHEN6_Msk (0x1UL << IPC_RECEIVE_CNF_CHEN6_Pos) /*!< Bit mask of CHEN6 field. */
#define IPC_RECEIVE_CNF_CHEN6_Disable (0UL) /*!< Disable events. */
#define IPC_RECEIVE_CNF_CHEN6_Enable (1UL) /*!< Enable events. */

/* Bit 5 : Enable subscription to channel 5. */
#define IPC_RECEIVE_CNF_CHEN5_Pos (5UL) /*!< Position of CHEN5 field. */
#define IPC_RECEIVE_CNF_CHEN5_Msk (0x1UL << IPC_RECEIVE_CNF_CHEN5_Pos) /*!< Bit mask of CHEN5 field. */
#define IPC_RECEIVE_CNF_CHEN5_Disable (0UL) /*!< Disable events. */
#define IPC_RECEIVE_CNF_CHEN5_Enable (1UL) /*!< Enable events. */

/* Bit 4 : Enable subscription to channel 4. */
#define IPC_RECEIVE_CNF_CHEN4_Pos (4UL) /*!< Position of CHEN4 field. */
#define IPC_RECEIVE_CNF_CHEN4_Msk (0x1UL << IPC_RECEIVE_CNF_CHEN4_Pos) /*!< Bit mask of CHEN4 field. */
#define IPC_RECEIVE_CNF_CHEN4_Disable (0UL) /*!< Disable events. */
#define IPC_RECEIVE_CNF_CHEN4_Enable (1UL) /*!< Enable events. */

/* Bit 3 : Enable subscription to channel 3. */
#define IPC_RECEIVE_CNF_CHEN3_Pos (3UL) /*!< Position of CHEN3 field. */
#define IPC_RECEIVE_CNF_CHEN3_Msk (0x1UL << IPC_RECEIVE_CNF_CHEN3_Pos) /*!< Bit mask of CHEN3 field. */
#define IPC_RECEIVE_CNF_CHEN3_Disable (0UL) /*!< Disable events. */
#define IPC_RECEIVE_CNF_CHEN3_Enable (1UL) /*!< Enable events. */

/* Bit 2 : Enable subscription to channel 2. */
#define IPC_RECEIVE_CNF_CHEN2_Pos (2UL) /*!< Position of CHEN2 field. */
#define IPC_RECEIVE_CNF_CHEN2_Msk (0x1UL << IPC_RECEIVE_CNF_CHEN2_Pos) /*!< Bit mask of CHEN2 field. */
#define IPC_RECEIVE_CNF_CHEN2_Disable (0UL) /*!< Disable events. */
#define IPC_RECEIVE_CNF_CHEN2_Enable (1UL) /*!< Enable events. */

/* Bit 1 : Enable subscription to channel 1. */
#define IPC_RECEIVE_CNF_CHEN1_Pos (1UL) /*!< Position of CHEN1 field. */
#define IPC_RECEIVE_CNF_CHEN1_Msk (0x1UL << IPC_RECEIVE_CNF_CHEN1_Pos) /*!< Bit mask of CHEN1 field. */
#define IPC_RECEIVE_CNF_CHEN1_Disable (0UL) /*!< Disable events. */
#define IPC_RECEIVE_CNF_CHEN1_Enable (1UL) /*!< Enable events. */

/* Bit 0 : Enable subscription to channel 0. */
#define IPC_RECEIVE_CNF_CHEN0_Pos (0UL) /*!< Position of CHEN0 field. */
#define IPC_RECEIVE_CNF_CHEN0_Msk (0x1UL << IPC_RECEIVE_CNF_CHEN0_Pos) /*!< Bit mask of CHEN0 field. */
#define IPC_RECEIVE_CNF_CHEN0_Disable (0UL) /*!< Disable events. */
#define IPC_RECEIVE_CNF_CHEN0_Enable (1UL) /*!< Enable events. */

/* Register: IPC_GPMEM */
/* Description: Description collection: General purpose memory. */

/* Bits 31..0 : General purpose memory */
#define IPC_GPMEM_GPMEM_Pos (0UL) /*!< Position of GPMEM field. */
#define IPC_GPMEM_GPMEM_Msk (0xFFFFFFFFUL << IPC_GPMEM_GPMEM_Pos) /*!< Bit mask of GPMEM field. */


/* Peripheral: L2CIPHER */
/* Description: L2 Cipher Registers */

/* Register: L2CIPHER_TASKZEROPENALTY_PCP_1 */
/* Description: TaskZeroPenalty register for PCP 1 */

/* Bit 0 :   */
#define L2CIPHER_TASKZEROPENALTY_PCP_1_ZERO_PENALTY_Pos (0UL) /*!< Position of ZERO_PENALTY field. */
#define L2CIPHER_TASKZEROPENALTY_PCP_1_ZERO_PENALTY_Msk (0x1UL << L2CIPHER_TASKZEROPENALTY_PCP_1_ZERO_PENALTY_Pos) /*!< Bit mask of ZERO_PENALTY field. */
#define L2CIPHER_TASKZEROPENALTY_PCP_1_ZERO_PENALTY_SET_ZERO_PENALTY (1UL) /*!< Set Zero Penalty */

/* Register: L2CIPHER_TASKFULLPENALTY_PCP_1 */
/* Description: TaskFullPenalty register for PCP 1 */

/* Bit 0 :   */
#define L2CIPHER_TASKFULLPENALTY_PCP_1_FULL_PENALTY_Pos (0UL) /*!< Position of FULL_PENALTY field. */
#define L2CIPHER_TASKFULLPENALTY_PCP_1_FULL_PENALTY_Msk (0x1UL << L2CIPHER_TASKFULLPENALTY_PCP_1_FULL_PENALTY_Pos) /*!< Bit mask of FULL_PENALTY field. */
#define L2CIPHER_TASKFULLPENALTY_PCP_1_FULL_PENALTY_SET_FULL_PENALTY (1UL) /*!< Set Full Penalty */

/* Register: L2CIPHER_TASKZEROPENALTY_PCP_0 */
/* Description: TaskZeroPenalty register for PCP 0 */

/* Bit 0 :   */
#define L2CIPHER_TASKZEROPENALTY_PCP_0_ZERO_PENALTY_Pos (0UL) /*!< Position of ZERO_PENALTY field. */
#define L2CIPHER_TASKZEROPENALTY_PCP_0_ZERO_PENALTY_Msk (0x1UL << L2CIPHER_TASKZEROPENALTY_PCP_0_ZERO_PENALTY_Pos) /*!< Bit mask of ZERO_PENALTY field. */
#define L2CIPHER_TASKZEROPENALTY_PCP_0_ZERO_PENALTY_SET_ZERO_PENALTY (1UL) /*!< Set Zero Penalty */

/* Register: L2CIPHER_TASKFULLPENALTY_PCP_0 */
/* Description: TaskFullPenalty register for PCP 0 */

/* Bit 0 :   */
#define L2CIPHER_TASKFULLPENALTY_PCP_0_FULL_PENALTY_Pos (0UL) /*!< Position of FULL_PENALTY field. */
#define L2CIPHER_TASKFULLPENALTY_PCP_0_FULL_PENALTY_Msk (0x1UL << L2CIPHER_TASKFULLPENALTY_PCP_0_FULL_PENALTY_Pos) /*!< Bit mask of FULL_PENALTY field. */
#define L2CIPHER_TASKFULLPENALTY_PCP_0_FULL_PENALTY_SET_FULL_PENALTY (1UL) /*!< Set Full Penalty */

/* Register: L2CIPHER_PENALTY_REG */
/* Description: Description collection: Penalty register for PCP n */

/* Bits 1..0 : Penalty Level */
#define L2CIPHER_PENALTY_REG_Penalty_Pos (0UL) /*!< Position of Penalty field. */
#define L2CIPHER_PENALTY_REG_Penalty_Msk (0x3UL << L2CIPHER_PENALTY_REG_Penalty_Pos) /*!< Bit mask of Penalty field. */
#define L2CIPHER_PENALTY_REG_Penalty_Full (0UL) /*!< Auto 0) Full penalty) */
#define L2CIPHER_PENALTY_REG_Penalty_Semi1 (1UL) /*!< (Auto 1)  Semi (power on, clock off) */
#define L2CIPHER_PENALTY_REG_Penalty_Semi0 (2UL) /*!< (Auto 2) Semi (power on, clock core on, clock buffer off) */
#define L2CIPHER_PENALTY_REG_Penalty_Zero (3UL) /*!< (Auto 3)  Zero penalty */

/* Register: L2CIPHER_FORCE_OVERRIDE */
/* Description: Description collection: Force override register for PCP n */

/* Bit 15 :   */
#define L2CIPHER_FORCE_OVERRIDE_DISABLE_Pos (15UL) /*!< Position of DISABLE field. */
#define L2CIPHER_FORCE_OVERRIDE_DISABLE_Msk (0x1UL << L2CIPHER_FORCE_OVERRIDE_DISABLE_Pos) /*!< Bit mask of DISABLE field. */
#define L2CIPHER_FORCE_OVERRIDE_DISABLE_DISABLE (0UL) /*!< all forcing disabled */
#define L2CIPHER_FORCE_OVERRIDE_DISABLE_ENABLE (1UL) /*!< all forcing enabled */

/* Bit 9 :   */
#define L2CIPHER_FORCE_OVERRIDE_CORE_POWER_REQUEST_Pos (9UL) /*!< Position of CORE_POWER_REQUEST field. */
#define L2CIPHER_FORCE_OVERRIDE_CORE_POWER_REQUEST_Msk (0x1UL << L2CIPHER_FORCE_OVERRIDE_CORE_POWER_REQUEST_Pos) /*!< Bit mask of CORE_POWER_REQUEST field. */
#define L2CIPHER_FORCE_OVERRIDE_CORE_POWER_REQUEST_REQ0 (0UL) /*!< powerRequest.core = 0 */
#define L2CIPHER_FORCE_OVERRIDE_CORE_POWER_REQUEST_REQ1 (1UL) /*!< powerRequest.core = 1 */

/* Bit 8 :   */
#define L2CIPHER_FORCE_OVERRIDE_POWER_SWITCH_REQUEST_Pos (8UL) /*!< Position of POWER_SWITCH_REQUEST field. */
#define L2CIPHER_FORCE_OVERRIDE_POWER_SWITCH_REQUEST_Msk (0x1UL << L2CIPHER_FORCE_OVERRIDE_POWER_SWITCH_REQUEST_Pos) /*!< Bit mask of POWER_SWITCH_REQUEST field. */
#define L2CIPHER_FORCE_OVERRIDE_POWER_SWITCH_REQUEST_REQ0 (0UL) /*!< powerRequest.switch = 0 */
#define L2CIPHER_FORCE_OVERRIDE_POWER_SWITCH_REQUEST_REQ1 (1UL) /*!< powerRequest.switch = 1 */

/* Bit 7 :   */
#define L2CIPHER_FORCE_OVERRIDE_CLOCK_FORCING_Pos (7UL) /*!< Position of CLOCK_FORCING field. */
#define L2CIPHER_FORCE_OVERRIDE_CLOCK_FORCING_Msk (0x1UL << L2CIPHER_FORCE_OVERRIDE_CLOCK_FORCING_Pos) /*!< Bit mask of CLOCK_FORCING field. */
#define L2CIPHER_FORCE_OVERRIDE_CLOCK_FORCING_FORCE0 (0UL) /*!< All clock forcing  disabled */
#define L2CIPHER_FORCE_OVERRIDE_CLOCK_FORCING_FORCE1 (1UL) /*!< All clock forcing  enabled */

/* Bit 3 :   */
#define L2CIPHER_FORCE_OVERRIDE_CORE_CLOCK_REQUEST_Pos (3UL) /*!< Position of CORE_CLOCK_REQUEST field. */
#define L2CIPHER_FORCE_OVERRIDE_CORE_CLOCK_REQUEST_Msk (0x1UL << L2CIPHER_FORCE_OVERRIDE_CORE_CLOCK_REQUEST_Pos) /*!< Bit mask of CORE_CLOCK_REQUEST field. */
#define L2CIPHER_FORCE_OVERRIDE_CORE_CLOCK_REQUEST_REQ0 (0UL) /*!< clockRequest.core = 0 */
#define L2CIPHER_FORCE_OVERRIDE_CORE_CLOCK_REQUEST_REQ1 (1UL) /*!< clockRequest.core = 1 */

/* Bit 2 :   */
#define L2CIPHER_FORCE_OVERRIDE_CLOCK_BUFFER_REQUEST_Pos (2UL) /*!< Position of CLOCK_BUFFER_REQUEST field. */
#define L2CIPHER_FORCE_OVERRIDE_CLOCK_BUFFER_REQUEST_Msk (0x1UL << L2CIPHER_FORCE_OVERRIDE_CLOCK_BUFFER_REQUEST_Pos) /*!< Bit mask of CLOCK_BUFFER_REQUEST field. */
#define L2CIPHER_FORCE_OVERRIDE_CLOCK_BUFFER_REQUEST_REQ0 (0UL) /*!< clockRequest.buff = 0 */
#define L2CIPHER_FORCE_OVERRIDE_CLOCK_BUFFER_REQUEST_REQ1 (1UL) /*!< clockRequest.buff = 1 */

/* Bit 1 :   */
#define L2CIPHER_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_Pos (1UL) /*!< Position of CLOCK_SWITCH_REQUEST field. */
#define L2CIPHER_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_Msk (0x1UL << L2CIPHER_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_Pos) /*!< Bit mask of CLOCK_SWITCH_REQUEST field. */
#define L2CIPHER_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_REQ0 (0UL) /*!< clockRequest.switch = 0 */
#define L2CIPHER_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_REQ1 (1UL) /*!< clockRequest.switch = 1 */

