adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 0 : DMA transfer complete */
#define M2M_EVENTS_END_EVENTS_END_Pos (0UL) /*!< Position of EVENTS_END field. */
#define M2M_EVENTS_END_EVENTS_END_Msk (0x1UL << M2M_EVENTS_END_EVENTS_END_Pos) /*!< Bit mask of EVENTS_END field. */
#define M2M_EVENTS_END_EVENTS_END_NotGenerated (0UL) /*!< Event not generated */
#define M2M_EVENTS_END_EVENTS_END_Generated (1UL) /*!< Event generated */

/* Register: M2M_EVENTS_STARTED */
/* Description: DMA transfer started */

/* Bit 0 : DMA transfer started */
#define M2M_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL) /*!< Position of EVENTS_STARTED field. */
#define M2M_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << M2M_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of EVENTS_STARTED field. */
#define M2M_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0UL) /*!< Event not generated */
#define M2M_EVENTS_STARTED_EVENTS_STARTED_Generated (1UL) /*!< Event generated */

/* Register: M2M_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 1 : Enable or disable interrupt for event STARTED */
#define M2M_INTEN_STARTED_Pos (1UL) /*!< Position of STARTED field. */
#define M2M_INTEN_STARTED_Msk (0x1UL << M2M_INTEN_STARTED_Pos) /*!< Bit mask of STARTED field. */
#define M2M_INTEN_STARTED_Disabled (0UL) /*!< Disable */
#define M2M_INTEN_STARTED_Enabled (1UL) /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event END */
#define M2M_INTEN_END_Pos (0UL) /*!< Position of END field. */
#define M2M_INTEN_END_Msk (0x1UL << M2M_INTEN_END_Pos) /*!< Bit mask of END field. */
#define M2M_INTEN_END_Disabled (0UL) /*!< Disable */
#define M2M_INTEN_END_Enabled (1UL) /*!< Enable */

/* Register: M2M_INTENSET */
/* Description: Enable interrupt */

/* Bit 1 : Write '1' to enable interrupt for event STARTED */
#define M2M_INTENSET_STARTED_Pos (1UL) /*!< Position of STARTED field. */
#define M2M_INTENSET_STARTED_Msk (0x1UL << M2M_INTENSET_STARTED_Pos) /*!< Bit mask of STARTED field. */
#define M2M_INTENSET_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define M2M_INTENSET_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define M2M_INTENSET_STARTED_Set (1UL) /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event END */
#define M2M_INTENSET_END_Pos (0UL) /*!< Position of END field. */
#define M2M_INTENSET_END_Msk (0x1UL << M2M_INTENSET_END_Pos) /*!< Bit mask of END field. */
#define M2M_INTENSET_END_Disabled (0UL) /*!< Read: Disabled */
#define M2M_INTENSET_END_Enabled (1UL) /*!< Read: Enabled */
#define M2M_INTENSET_END_Set (1UL) /*!< Enable */

/* Register: M2M_INTENCLR */
/* Description: Disable interrupt */

/* Bit 1 : Write '1' to disable interrupt for event STARTED */
#define M2M_INTENCLR_STARTED_Pos (1UL) /*!< Position of STARTED field. */
#define M2M_INTENCLR_STARTED_Msk (0x1UL << M2M_INTENCLR_STARTED_Pos) /*!< Bit mask of STARTED field. */
#define M2M_INTENCLR_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define M2M_INTENCLR_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define M2M_INTENCLR_STARTED_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event END */
#define M2M_INTENCLR_END_Pos (0UL) /*!< Position of END field. */
#define M2M_INTENCLR_END_Msk (0x1UL << M2M_INTENCLR_END_Pos) /*!< Bit mask of END field. */
#define M2M_INTENCLR_END_Disabled (0UL) /*!< Read: Disabled */
#define M2M_INTENCLR_END_Enabled (1UL) /*!< Read: Enabled */
#define M2M_INTENCLR_END_Clear (1UL) /*!< Disable */

/* Register: M2M_INTPEND */
/* Description: Pending interrupts */

/* Bit 1 : Read pending status of interrupt for event STARTED */
#define M2M_INTPEND_STARTED_Pos (1UL) /*!< Position of STARTED field. */
#define M2M_INTPEND_STARTED_Msk (0x1UL << M2M_INTPEND_STARTED_Pos) /*!< Bit mask of STARTED field. */
#define M2M_INTPEND_STARTED_NotPending (0UL) /*!< Read: Not pending */
#define M2M_INTPEND_STARTED_Pending (1UL) /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event END */
#define M2M_INTPEND_END_Pos (0UL) /*!< Position of END field. */
#define M2M_INTPEND_END_Msk (0x1UL << M2M_INTPEND_END_Pos) /*!< Bit mask of END field. */
#define M2M_INTPEND_END_NotPending (0UL) /*!< Read: Not pending */
#define M2M_INTPEND_END_Pending (1UL) /*!< Read: Pending */

/* Register: M2M_IN_PTR */
/* Description: Data pointer */

/* Bits 31..0 : Data pointer */
#define M2M_IN_PTR_PTR_Pos (0UL) /*!< Position of PTR field. */
#define M2M_IN_PTR_PTR_Msk (0xFFFFFFFFUL << M2M_IN_PTR_PTR_Pos) /*!< Bit mask of PTR field. */

/* Register: M2M_IN_MAXCNT */
/* Description: Maximum number of bytes in input and output buffer */

/* Bits 7..0 : Maximum number of bytes in input and output buffer */
#define M2M_IN_MAXCNT_MAXCNT_Pos (0UL) /*!< Position of MAXCNT field. */
#define M2M_IN_MAXCNT_MAXCNT_Msk (0xFFUL << M2M_IN_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field. */

/* Register: M2M_IN_AMOUNT */
/* Description: Number of bytes transferred in the last transaction */

/* Bits 7..0 : Number of bytes transferred in the last transaction */
#define M2M_IN_AMOUNT_AMOUNT_Pos (0UL) /*!< Position of AMOUNT field. */
#define M2M_IN_AMOUNT_AMOUNT_Msk (0xFFUL << M2M_IN_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field. */

/* Register: M2M_IN_LIST */
/* Description: EasyDMA list type */

/* Bits 2..0 : List type */
#define M2M_IN_LIST_LIST_Pos (0UL) /*!< Position of LIST field. */
#define M2M_IN_LIST_LIST_Msk (0x7UL << M2M_IN_LIST_LIST_Pos) /*!< Bit mask of LIST field. */
#define M2M_IN_LIST_LIST_Disabled (0UL) /*!< Disable EasyDMA list */
#define M2M_IN_LIST_LIST_ArrayList (1UL) /*!< Use array list */

/* Register: M2M_OUT_PTR */
/* Description: Data pointer */

/* Bits 31..0 : Data pointer */
#define M2M_OUT_PTR_PTR_Pos (0UL) /*!< Position of PTR field. */
#define M2M_OUT_PTR_PTR_Msk (0xFFFFFFFFUL << M2M_OUT_PTR_PTR_Pos) /*!< Bit mask of PTR field. */

/* Register: M2M_OUT_AMOUNT */
/* Description: Number of bytes transferred in the last transaction */

/* Bits 7..0 : Number of bytes transferred in the last transaction */
#define M2M_OUT_AMOUNT_AMOUNT_Pos (0UL) /*!< Position of AMOUNT field. */
#define M2M_OUT_AMOUNT_AMOUNT_Msk (0xFFUL << M2M_OUT_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field. */

