adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Register: M2M_OUT_LIST */
/* Description: EasyDMA list type */

/* Bits 2..0 : List type */
#define M2M_OUT_LIST_LIST_Pos (0UL) /*!< Position of LIST field. */
#define M2M_OUT_LIST_LIST_Msk (0x7UL << M2M_OUT_LIST_LIST_Pos) /*!< Bit mask of LIST field. */
#define M2M_OUT_LIST_LIST_Disabled (0UL) /*!< Disable EasyDMA list */
#define M2M_OUT_LIST_LIST_ArrayList (1UL) /*!< Use array list */


/* Peripheral: MCPLL */
/* Description: Modem Clock PLL */

/* Register: MCPLL_TASKS_START */
/* Description: Start MCPLL */

/* Bit 0 : Start MCPLL */
#define MCPLL_TASKS_START_TASKS_START_Pos (0UL) /*!< Position of TASKS_START field. */
#define MCPLL_TASKS_START_TASKS_START_Msk (0x1UL << MCPLL_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field. */
#define MCPLL_TASKS_START_TASKS_START_Trigger (1UL) /*!< Trigger task */

/* Register: MCPLL_TASKS_UPDATE */
/* Description: Update CONTROL.FRAC and CONTROL.INT values */

/* Bit 0 : Update CONTROL.FRAC and CONTROL.INT values */
#define MCPLL_TASKS_UPDATE_TASKS_UPDATE_Pos (0UL) /*!< Position of TASKS_UPDATE field. */
#define MCPLL_TASKS_UPDATE_TASKS_UPDATE_Msk (0x1UL << MCPLL_TASKS_UPDATE_TASKS_UPDATE_Pos) /*!< Bit mask of TASKS_UPDATE field. */
#define MCPLL_TASKS_UPDATE_TASKS_UPDATE_Trigger (1UL) /*!< Trigger task */

/* Register: MCPLL_TASKS_STOP */
/* Description: Stop MCPLL */

/* Bit 0 : Stop MCPLL */
#define MCPLL_TASKS_STOP_TASKS_STOP_Pos (0UL) /*!< Position of TASKS_STOP field. */
#define MCPLL_TASKS_STOP_TASKS_STOP_Msk (0x1UL << MCPLL_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field. */
#define MCPLL_TASKS_STOP_TASKS_STOP_Trigger (1UL) /*!< Trigger task */

/* Register: MCPLL_EVENTS_STARTED */
/* Description: MCPLL started */

/* Bit 0 : MCPLL started */
#define MCPLL_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL) /*!< Position of EVENTS_STARTED field. */
#define MCPLL_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << MCPLL_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of EVENTS_STARTED field. */
#define MCPLL_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0UL) /*!< Event not generated */
#define MCPLL_EVENTS_STARTED_EVENTS_STARTED_Generated (1UL) /*!< Event generated */

/* Register: MCPLL_EVENTS_LOCKERROR */
/* Description: Error event, MCPLL no longer in lock */

/* Bit 0 : Error event, MCPLL no longer in lock */
#define MCPLL_EVENTS_LOCKERROR_EVENTS_LOCKERROR_Pos (0UL) /*!< Position of EVENTS_LOCKERROR field. */
#define MCPLL_EVENTS_LOCKERROR_EVENTS_LOCKERROR_Msk (0x1UL << MCPLL_EVENTS_LOCKERROR_EVENTS_LOCKERROR_Pos) /*!< Bit mask of EVENTS_LOCKERROR field. */
#define MCPLL_EVENTS_LOCKERROR_EVENTS_LOCKERROR_NotGenerated (0UL) /*!< Event not generated */
#define MCPLL_EVENTS_LOCKERROR_EVENTS_LOCKERROR_Generated (1UL) /*!< Event generated */

/* Register: MCPLL_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 1 : Enable or disable interrupt for event LOCKERROR */
#define MCPLL_INTEN_LOCKERROR_Pos (1UL) /*!< Position of LOCKERROR field. */
#define MCPLL_INTEN_LOCKERROR_Msk (0x1UL << MCPLL_INTEN_LOCKERROR_Pos) /*!< Bit mask of LOCKERROR field. */
#define MCPLL_INTEN_LOCKERROR_Disabled (0UL) /*!< Disable */
#define MCPLL_INTEN_LOCKERROR_Enabled (1UL) /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event STARTED */
#define MCPLL_INTEN_STARTED_Pos (0UL) /*!< Position of STARTED field. */
#define MCPLL_INTEN_STARTED_Msk (0x1UL << MCPLL_INTEN_STARTED_Pos) /*!< Bit mask of STARTED field. */
#define MCPLL_INTEN_STARTED_Disabled (0UL) /*!< Disable */
#define MCPLL_INTEN_STARTED_Enabled (1UL) /*!< Enable */

/* Register: MCPLL_INTENSET */
/* Description: Enable interrupt */

/* Bit 1 : Write '1' to enable interrupt for event LOCKERROR */
#define MCPLL_INTENSET_LOCKERROR_Pos (1UL) /*!< Position of LOCKERROR field. */
#define MCPLL_INTENSET_LOCKERROR_Msk (0x1UL << MCPLL_INTENSET_LOCKERROR_Pos) /*!< Bit mask of LOCKERROR field. */
#define MCPLL_INTENSET_LOCKERROR_Disabled (0UL) /*!< Read: Disabled */
#define MCPLL_INTENSET_LOCKERROR_Enabled (1UL) /*!< Read: Enabled */
#define MCPLL_INTENSET_LOCKERROR_Set (1UL) /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event STARTED */
#define MCPLL_INTENSET_STARTED_Pos (0UL) /*!< Position of STARTED field. */
#define MCPLL_INTENSET_STARTED_Msk (0x1UL << MCPLL_INTENSET_STARTED_Pos) /*!< Bit mask of STARTED field. */
#define MCPLL_INTENSET_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define MCPLL_INTENSET_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define MCPLL_INTENSET_STARTED_Set (1UL) /*!< Enable */

/* Register: MCPLL_INTENCLR */
/* Description: Disable interrupt */

/* Bit 1 : Write '1' to disable interrupt for event LOCKERROR */
#define MCPLL_INTENCLR_LOCKERROR_Pos (1UL) /*!< Position of LOCKERROR field. */
#define MCPLL_INTENCLR_LOCKERROR_Msk (0x1UL << MCPLL_INTENCLR_LOCKERROR_Pos) /*!< Bit mask of LOCKERROR field. */
#define MCPLL_INTENCLR_LOCKERROR_Disabled (0UL) /*!< Read: Disabled */
#define MCPLL_INTENCLR_LOCKERROR_Enabled (1UL) /*!< Read: Enabled */
#define MCPLL_INTENCLR_LOCKERROR_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event STARTED */
#define MCPLL_INTENCLR_STARTED_Pos (0UL) /*!< Position of STARTED field. */
#define MCPLL_INTENCLR_STARTED_Msk (0x1UL << MCPLL_INTENCLR_STARTED_Pos) /*!< Bit mask of STARTED field. */
#define MCPLL_INTENCLR_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define MCPLL_INTENCLR_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define MCPLL_INTENCLR_STARTED_Clear (1UL) /*!< Disable */

/* Register: MCPLL_INTPEND */
/* Description: Pending interrupts */

/* Bit 1 : Read pending status of interrupt for event LOCKERROR */
#define MCPLL_INTPEND_LOCKERROR_Pos (1UL) /*!< Position of LOCKERROR field. */
#define MCPLL_INTPEND_LOCKERROR_Msk (0x1UL << MCPLL_INTPEND_LOCKERROR_Pos) /*!< Bit mask of LOCKERROR field. */
#define MCPLL_INTPEND_LOCKERROR_NotPending (0UL) /*!< Read: Not pending */
#define MCPLL_INTPEND_LOCKERROR_Pending (1UL) /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event STARTED */
#define MCPLL_INTPEND_STARTED_Pos (0UL) /*!< Position of STARTED field. */
#define MCPLL_INTPEND_STARTED_Msk (0x1UL << MCPLL_INTPEND_STARTED_Pos) /*!< Bit mask of STARTED field. */
#define MCPLL_INTPEND_STARTED_NotPending (0UL) /*!< Read: Not pending */
#define MCPLL_INTPEND_STARTED_Pending (1UL) /*!< Read: Pending */

/* Register: MCPLL_INLOCK */
/* Description: MCPLL locked or not */

/* Bit 0 : MCPLL locked or not */
#define MCPLL_INLOCK_INLOCK_Pos (0UL) /*!< Position of INLOCK field. */
#define MCPLL_INLOCK_INLOCK_Msk (0x1UL << MCPLL_INLOCK_INLOCK_Pos) /*!< Bit mask of INLOCK field. */
#define MCPLL_INLOCK_INLOCK_NotInLock (0UL) /*!< MCPLL not locked */
#define MCPLL_INLOCK_INLOCK_InLock (1UL) /*!< MCPLL locked */

