adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Register: MCPLL_CONTROL_INT */
/* Description: Integer part of the control word. */

/* Bits 5..0 : Integer part of the control word */
#define MCPLL_CONTROL_INT_INT_Pos (0UL) /*!< Position of INT field. */
#define MCPLL_CONTROL_INT_INT_Msk (0x3FUL << MCPLL_CONTROL_INT_INT_Pos) /*!< Bit mask of INT field. */

/* Register: MCPLL_CONTROL_FRAC */
/* Description: Fractional part of the control word. */

/* Bits 22..0 : Fractional part of the control word */
#define MCPLL_CONTROL_FRAC_FRAC_Pos (0UL) /*!< Position of FRAC field. */
#define MCPLL_CONTROL_FRAC_FRAC_Msk (0x7FFFFFUL << MCPLL_CONTROL_FRAC_FRAC_Pos) /*!< Bit mask of FRAC field. */

/* Register: MCPLL_MA */
/* Description: Post division ratio for OUTA */

/* Bits 2..0 : Post division ratio for OUTA */
#define MCPLL_MA_MA_Pos (0UL) /*!< Position of MA field. */
#define MCPLL_MA_MA_Msk (0x7UL << MCPLL_MA_MA_Pos) /*!< Bit mask of MA field. */

/* Register: MCPLL_MB */
/* Description: Post division ratio for OUTB */

/* Bits 2..0 : Post division ratio for OUTB */
#define MCPLL_MB_MB_Pos (0UL) /*!< Position of MB field. */
#define MCPLL_MB_MB_Msk (0x7UL << MCPLL_MB_MB_Pos) /*!< Bit mask of MB field. */

/* Register: MCPLL_MC */
/* Description: Post division ratio for OUTC */

/* Bits 2..0 : Post division ratio for OUTC */
#define MCPLL_MC_MC_Pos (0UL) /*!< Position of MC field. */
#define MCPLL_MC_MC_Msk (0x7UL << MCPLL_MC_MC_Pos) /*!< Bit mask of MC field. */

/* Register: MCPLL_INTMODE */
/* Description: Integer mode */

/* Bit 0 : Integer mode */
#define MCPLL_INTMODE_INTMODE_Pos (0UL) /*!< Position of INTMODE field. */
#define MCPLL_INTMODE_INTMODE_Msk (0x1UL << MCPLL_INTMODE_INTMODE_Pos) /*!< Bit mask of INTMODE field. */
#define MCPLL_INTMODE_INTMODE_Fractional (0UL) /*!< Fractional mode */
#define MCPLL_INTMODE_INTMODE_Integer (1UL) /*!< Integer mode */

/* Register: MCPLL_FORCEINLOCK */
/* Description: Force MCPLL in lock */

/* Bits 1..0 : Force MCPLL in lock (value) */
#define MCPLL_FORCEINLOCK_FORCEINLOCK_Pos (0UL) /*!< Position of FORCEINLOCK field. */
#define MCPLL_FORCEINLOCK_FORCEINLOCK_Msk (0x3UL << MCPLL_FORCEINLOCK_FORCEINLOCK_Pos) /*!< Bit mask of FORCEINLOCK field. */

/* Register: MCPLL_RESET */
/* Description: Reset MCPLL */

/* Bit 0 : Software reset (ARSTSD) */
#define MCPLL_RESET_RESET_Pos (0UL) /*!< Position of RESET field. */
#define MCPLL_RESET_RESET_Msk (0x1UL << MCPLL_RESET_RESET_Pos) /*!< Bit mask of RESET field. */

/* Register: MCPLL_SPARE */
/* Description: Spare signals */

/* Bits 3..0 : Spare signals */
#define MCPLL_SPARE_SPARE_Pos (0UL) /*!< Position of SPARE field. */
#define MCPLL_SPARE_SPARE_Msk (0xFUL << MCPLL_SPARE_SPARE_Pos) /*!< Bit mask of SPARE field. */

/* Register: MCPLL_OVERRIDE_MCPLL */
/* Description: Override for MCPLL power switch */

/* Bit 31 : Enable override */
#define MCPLL_OVERRIDE_MCPLL_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define MCPLL_OVERRIDE_MCPLL_ENABLE_Msk (0x1UL << MCPLL_OVERRIDE_MCPLL_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define MCPLL_OVERRIDE_MCPLL_ENABLE_NoOverride (0UL) /*!< No override enabled */
#define MCPLL_OVERRIDE_MCPLL_ENABLE_Override (1UL) /*!< Override enabled */

/* Bits 6..4 : Power switch resistance override value */
#define MCPLL_OVERRIDE_MCPLL_RESISTANCE_Pos (4UL) /*!< Position of RESISTANCE field. */
#define MCPLL_OVERRIDE_MCPLL_RESISTANCE_Msk (0x7UL << MCPLL_OVERRIDE_MCPLL_RESISTANCE_Pos) /*!< Bit mask of RESISTANCE field. */

/* Bits 1..0 : Power switch override value */
#define MCPLL_OVERRIDE_MCPLL_SWITCH_Pos (0UL) /*!< Position of SWITCH field. */
#define MCPLL_OVERRIDE_MCPLL_SWITCH_Msk (0x3UL << MCPLL_OVERRIDE_MCPLL_SWITCH_Pos) /*!< Bit mask of SWITCH field. */
#define MCPLL_OVERRIDE_MCPLL_SWITCH_OFF (0UL) /*!< Force power switch OFF */
#define MCPLL_OVERRIDE_MCPLL_SWITCH_ON (1UL) /*!< Force power switch ON */

/* Register: MCPLL_OVERRIDE_MCPLLBUF */
/* Description: Override for MCPLLBUF power switch */

/* Bit 31 : Enable override */
#define MCPLL_OVERRIDE_MCPLLBUF_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define MCPLL_OVERRIDE_MCPLLBUF_ENABLE_Msk (0x1UL << MCPLL_OVERRIDE_MCPLLBUF_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define MCPLL_OVERRIDE_MCPLLBUF_ENABLE_NoOverride (0UL) /*!< No override enabled */
#define MCPLL_OVERRIDE_MCPLLBUF_ENABLE_Override (1UL) /*!< Override enabled */

/* Bits 6..4 : Power switch resistance override value */
#define MCPLL_OVERRIDE_MCPLLBUF_RESISTANCE_Pos (4UL) /*!< Position of RESISTANCE field. */
#define MCPLL_OVERRIDE_MCPLLBUF_RESISTANCE_Msk (0x7UL << MCPLL_OVERRIDE_MCPLLBUF_RESISTANCE_Pos) /*!< Bit mask of RESISTANCE field. */

/* Bits 1..0 : Power switch override value */
#define MCPLL_OVERRIDE_MCPLLBUF_SWITCH_Pos (0UL) /*!< Position of SWITCH field. */
#define MCPLL_OVERRIDE_MCPLLBUF_SWITCH_Msk (0x3UL << MCPLL_OVERRIDE_MCPLLBUF_SWITCH_Pos) /*!< Bit mask of SWITCH field. */
#define MCPLL_OVERRIDE_MCPLLBUF_SWITCH_OFF (0UL) /*!< Force power switch OFF */
#define MCPLL_OVERRIDE_MCPLLBUF_SWITCH_ON (1UL) /*!< Force power switch ON */

/* Register: MCPLL_OVERRIDE_PWRUP */
/* Description: Override for power up */

/* Bit 31 : Enable override */
#define MCPLL_OVERRIDE_PWRUP_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define MCPLL_OVERRIDE_PWRUP_ENABLE_Msk (0x1UL << MCPLL_OVERRIDE_PWRUP_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define MCPLL_OVERRIDE_PWRUP_ENABLE_NoOverride (0UL) /*!< No override enabled */
#define MCPLL_OVERRIDE_PWRUP_ENABLE_Override (1UL) /*!< Override enabled */

/* Bit 0 : Override for PWRDUP_MCPLL */
#define MCPLL_OVERRIDE_PWRUP_MCPLLANA_Pos (0UL) /*!< Position of MCPLLANA field. */
#define MCPLL_OVERRIDE_PWRUP_MCPLLANA_Msk (0x1UL << MCPLL_OVERRIDE_PWRUP_MCPLLANA_Pos) /*!< Bit mask of MCPLLANA field. */
#define MCPLL_OVERRIDE_PWRUP_MCPLLANA_OFF (0UL) /*!< Force power off */
#define MCPLL_OVERRIDE_PWRUP_MCPLLANA_ON (1UL) /*!< Force power on */

/* Register: MCPLL_TEST */
/* Description: ATE test bus control */

/* Bits 3..0 : ATE test bus control */
#define MCPLL_TEST_ATE_Pos (0UL) /*!< Position of ATE field. */
#define MCPLL_TEST_ATE_Msk (0xFUL << MCPLL_TEST_ATE_Pos) /*!< Bit mask of ATE field. */


/* Peripheral: MODEMPERIPH */
/* Description: Modem peripheral registers */

/* Register: MODEMPERIPH_TASKZEROPENALTY_PCP_1 */
/* Description: TaskZeroPenalty register for PCP 1 */

