adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 0 :   */
#define MODEMPERIPH_TASKZEROPENALTY_PCP_1_ZERO_PENALTY_Pos (0UL) /*!< Position of ZERO_PENALTY field. */
#define MODEMPERIPH_TASKZEROPENALTY_PCP_1_ZERO_PENALTY_Msk (0x1UL << MODEMPERIPH_TASKZEROPENALTY_PCP_1_ZERO_PENALTY_Pos) /*!< Bit mask of ZERO_PENALTY field. */
#define MODEMPERIPH_TASKZEROPENALTY_PCP_1_ZERO_PENALTY_SET_ZERO_PENALTY (1UL) /*!< Set Zero Penalty */

/* Register: MODEMPERIPH_TASKFULLPENALTY_PCP_1 */
/* Description: TaskFullPenalty register for PCP 1 */

/* Bit 0 :   */
#define MODEMPERIPH_TASKFULLPENALTY_PCP_1_FULL_PENALTY_Pos (0UL) /*!< Position of FULL_PENALTY field. */
#define MODEMPERIPH_TASKFULLPENALTY_PCP_1_FULL_PENALTY_Msk (0x1UL << MODEMPERIPH_TASKFULLPENALTY_PCP_1_FULL_PENALTY_Pos) /*!< Bit mask of FULL_PENALTY field. */
#define MODEMPERIPH_TASKFULLPENALTY_PCP_1_FULL_PENALTY_SET_FULL_PENALTY (1UL) /*!< Set Full Penalty */

/* Register: MODEMPERIPH_TASKZEROPENALTY_PCP_0 */
/* Description: TaskZeroPenalty register for PCP 0 */

/* Bit 0 :   */
#define MODEMPERIPH_TASKZEROPENALTY_PCP_0_ZERO_PENALTY_Pos (0UL) /*!< Position of ZERO_PENALTY field. */
#define MODEMPERIPH_TASKZEROPENALTY_PCP_0_ZERO_PENALTY_Msk (0x1UL << MODEMPERIPH_TASKZEROPENALTY_PCP_0_ZERO_PENALTY_Pos) /*!< Bit mask of ZERO_PENALTY field. */
#define MODEMPERIPH_TASKZEROPENALTY_PCP_0_ZERO_PENALTY_SET_ZERO_PENALTY (1UL) /*!< Set Zero Penalty */

/* Register: MODEMPERIPH_TASKFULLPENALTY_PCP_0 */
/* Description: TaskFullPenalty register for PCP 0 */

/* Bit 0 :   */
#define MODEMPERIPH_TASKFULLPENALTY_PCP_0_FULL_PENALTY_Pos (0UL) /*!< Position of FULL_PENALTY field. */
#define MODEMPERIPH_TASKFULLPENALTY_PCP_0_FULL_PENALTY_Msk (0x1UL << MODEMPERIPH_TASKFULLPENALTY_PCP_0_FULL_PENALTY_Pos) /*!< Bit mask of FULL_PENALTY field. */
#define MODEMPERIPH_TASKFULLPENALTY_PCP_0_FULL_PENALTY_SET_FULL_PENALTY (1UL) /*!< Set Full Penalty */

/* Register: MODEMPERIPH_PENALTY_REG */
/* Description: Description collection: Penalty register for PCP n */

/* Bits 1..0 : Penalty Level */
#define MODEMPERIPH_PENALTY_REG_Penalty_Pos (0UL) /*!< Position of Penalty field. */
#define MODEMPERIPH_PENALTY_REG_Penalty_Msk (0x3UL << MODEMPERIPH_PENALTY_REG_Penalty_Pos) /*!< Bit mask of Penalty field. */
#define MODEMPERIPH_PENALTY_REG_Penalty_Full (0UL) /*!< Auto 0) Full penalty) */
#define MODEMPERIPH_PENALTY_REG_Penalty_Semi1 (1UL) /*!< (Auto 1)  Semi (power on, clock off) */
#define MODEMPERIPH_PENALTY_REG_Penalty_Semi0 (2UL) /*!< (Auto 2) Semi (power on, clock core on, clock buffer off) */
#define MODEMPERIPH_PENALTY_REG_Penalty_Zero (3UL) /*!< (Auto 3)  Zero penalty */

/* Register: MODEMPERIPH_FORCE_OVERRIDE */
/* Description: Description collection: Force override register for PCP n */

/* Bit 15 :   */
#define MODEMPERIPH_FORCE_OVERRIDE_DISABLE_Pos (15UL) /*!< Position of DISABLE field. */
#define MODEMPERIPH_FORCE_OVERRIDE_DISABLE_Msk (0x1UL << MODEMPERIPH_FORCE_OVERRIDE_DISABLE_Pos) /*!< Bit mask of DISABLE field. */
#define MODEMPERIPH_FORCE_OVERRIDE_DISABLE_DISABLE (0UL) /*!< all forcing disabled */
#define MODEMPERIPH_FORCE_OVERRIDE_DISABLE_ENABLE (1UL) /*!< all forcing enabled */

/* Bit 9 :   */
#define MODEMPERIPH_FORCE_OVERRIDE_CORE_POWER_REQUEST_Pos (9UL) /*!< Position of CORE_POWER_REQUEST field. */
#define MODEMPERIPH_FORCE_OVERRIDE_CORE_POWER_REQUEST_Msk (0x1UL << MODEMPERIPH_FORCE_OVERRIDE_CORE_POWER_REQUEST_Pos) /*!< Bit mask of CORE_POWER_REQUEST field. */
#define MODEMPERIPH_FORCE_OVERRIDE_CORE_POWER_REQUEST_REQ0 (0UL) /*!< powerRequest.core = 0 */
#define MODEMPERIPH_FORCE_OVERRIDE_CORE_POWER_REQUEST_REQ1 (1UL) /*!< powerRequest.core = 1 */

/* Bit 8 :   */
#define MODEMPERIPH_FORCE_OVERRIDE_POWER_SWITCH_REQUEST_Pos (8UL) /*!< Position of POWER_SWITCH_REQUEST field. */
#define MODEMPERIPH_FORCE_OVERRIDE_POWER_SWITCH_REQUEST_Msk (0x1UL << MODEMPERIPH_FORCE_OVERRIDE_POWER_SWITCH_REQUEST_Pos) /*!< Bit mask of POWER_SWITCH_REQUEST field. */
#define MODEMPERIPH_FORCE_OVERRIDE_POWER_SWITCH_REQUEST_REQ0 (0UL) /*!< powerRequest.switch = 0 */
#define MODEMPERIPH_FORCE_OVERRIDE_POWER_SWITCH_REQUEST_REQ1 (1UL) /*!< powerRequest.switch = 1 */

/* Bit 7 :   */
#define MODEMPERIPH_FORCE_OVERRIDE_CLOCK_FORCING_Pos (7UL) /*!< Position of CLOCK_FORCING field. */
#define MODEMPERIPH_FORCE_OVERRIDE_CLOCK_FORCING_Msk (0x1UL << MODEMPERIPH_FORCE_OVERRIDE_CLOCK_FORCING_Pos) /*!< Bit mask of CLOCK_FORCING field. */
#define MODEMPERIPH_FORCE_OVERRIDE_CLOCK_FORCING_FORCE0 (0UL) /*!< All clock forcing  disabled */
#define MODEMPERIPH_FORCE_OVERRIDE_CLOCK_FORCING_FORCE1 (1UL) /*!< All clock forcing  enabled */

/* Bit 3 :   */
#define MODEMPERIPH_FORCE_OVERRIDE_CORE_CLOCK_REQUEST_Pos (3UL) /*!< Position of CORE_CLOCK_REQUEST field. */
#define MODEMPERIPH_FORCE_OVERRIDE_CORE_CLOCK_REQUEST_Msk (0x1UL << MODEMPERIPH_FORCE_OVERRIDE_CORE_CLOCK_REQUEST_Pos) /*!< Bit mask of CORE_CLOCK_REQUEST field. */
#define MODEMPERIPH_FORCE_OVERRIDE_CORE_CLOCK_REQUEST_REQ0 (0UL) /*!< clockRequest.core = 0 */
#define MODEMPERIPH_FORCE_OVERRIDE_CORE_CLOCK_REQUEST_REQ1 (1UL) /*!< clockRequest.core = 1 */

/* Bit 2 :   */
#define MODEMPERIPH_FORCE_OVERRIDE_CLOCK_BUFFER_REQUEST_Pos (2UL) /*!< Position of CLOCK_BUFFER_REQUEST field. */
#define MODEMPERIPH_FORCE_OVERRIDE_CLOCK_BUFFER_REQUEST_Msk (0x1UL << MODEMPERIPH_FORCE_OVERRIDE_CLOCK_BUFFER_REQUEST_Pos) /*!< Bit mask of CLOCK_BUFFER_REQUEST field. */
#define MODEMPERIPH_FORCE_OVERRIDE_CLOCK_BUFFER_REQUEST_REQ0 (0UL) /*!< clockRequest.buff = 0 */
#define MODEMPERIPH_FORCE_OVERRIDE_CLOCK_BUFFER_REQUEST_REQ1 (1UL) /*!< clockRequest.buff = 1 */

/* Bit 1 :   */
#define MODEMPERIPH_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_Pos (1UL) /*!< Position of CLOCK_SWITCH_REQUEST field. */
#define MODEMPERIPH_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_Msk (0x1UL << MODEMPERIPH_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_Pos) /*!< Bit mask of CLOCK_SWITCH_REQUEST field. */
#define MODEMPERIPH_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_REQ0 (0UL) /*!< clockRequest.switch = 0 */
#define MODEMPERIPH_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_REQ1 (1UL) /*!< clockRequest.switch = 1 */

