adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 0 :   */
#define MODEMPERIPH_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_A_Pos (0UL) /*!< Position of CLOCK_SWITCH_REQUEST_A field. */
#define MODEMPERIPH_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_A_Msk (0x1UL << MODEMPERIPH_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_A_Pos) /*!< Bit mask of CLOCK_SWITCH_REQUEST_A field. */
#define MODEMPERIPH_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_A_REQ0 (0UL) /*!< clockRequest.switch_a = 0 */
#define MODEMPERIPH_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_A_REQ1 (1UL) /*!< clockRequest.switch_a = 1 */

/* Register: MODEMPERIPH_TURN_OFF_AUTO_CLOCKSOURCE_REQ */
/* Description: Turn of the automatic clock request. */

/* Bit 1 :   */
#define MODEMPERIPH_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_1_Pos (1UL) /*!< Position of CLOCK_START_PCP_1 field. */
#define MODEMPERIPH_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_1_Msk (0x1UL << MODEMPERIPH_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_1_Pos) /*!< Bit mask of CLOCK_START_PCP_1 field. */
#define MODEMPERIPH_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_1_NORMAL_PCP_1 (0UL) /*!< normal clock start for PCP 1 */
#define MODEMPERIPH_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_1_OFF_PCP_1 (1UL) /*!< turn off normal clock start for PCP 1 */

/* Bit 0 :   */
#define MODEMPERIPH_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_0_Pos (0UL) /*!< Position of CLOCK_START_PCP_0 field. */
#define MODEMPERIPH_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_0_Msk (0x1UL << MODEMPERIPH_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_0_Pos) /*!< Bit mask of CLOCK_START_PCP_0 field. */
#define MODEMPERIPH_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_0_NORMAL_PCP_0 (0UL) /*!< normal clock start for PCP 0 */
#define MODEMPERIPH_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_0_OFF_PCP_0 (1UL) /*!< turn off normal clock start for PCP 0 */


/* Peripheral: MODEMTIMER */
/* Description: Modem Timer/Counter 0 */

/* Register: MODEMTIMER_TASKS_START */
/* Description: Start Timer */

/* Bit 0 : Start Timer */
#define MODEMTIMER_TASKS_START_TASKS_START_Pos (0UL) /*!< Position of TASKS_START field. */
#define MODEMTIMER_TASKS_START_TASKS_START_Msk (0x1UL << MODEMTIMER_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field. */
#define MODEMTIMER_TASKS_START_TASKS_START_Trigger (1UL) /*!< Trigger task */

/* Register: MODEMTIMER_TASKS_STOP */
/* Description: Stop Timer */

/* Bit 0 : Stop Timer */
#define MODEMTIMER_TASKS_STOP_TASKS_STOP_Pos (0UL) /*!< Position of TASKS_STOP field. */
#define MODEMTIMER_TASKS_STOP_TASKS_STOP_Msk (0x1UL << MODEMTIMER_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field. */
#define MODEMTIMER_TASKS_STOP_TASKS_STOP_Trigger (1UL) /*!< Trigger task */

/* Register: MODEMTIMER_TASKS_CLEAR */
/* Description: Clear time */

/* Bit 0 : Clear time */
#define MODEMTIMER_TASKS_CLEAR_TASKS_CLEAR_Pos (0UL) /*!< Position of TASKS_CLEAR field. */
#define MODEMTIMER_TASKS_CLEAR_TASKS_CLEAR_Msk (0x1UL << MODEMTIMER_TASKS_CLEAR_TASKS_CLEAR_Pos) /*!< Bit mask of TASKS_CLEAR field. */
#define MODEMTIMER_TASKS_CLEAR_TASKS_CLEAR_Trigger (1UL) /*!< Trigger task */

/* Register: MODEMTIMER_TASKS_SHUTDOWN */
/* Description: Shut down timer */

/* Bit 0 : Shut down timer */
#define MODEMTIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Pos (0UL) /*!< Position of TASKS_SHUTDOWN field. */
#define MODEMTIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Msk (0x1UL << MODEMTIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Pos) /*!< Bit mask of TASKS_SHUTDOWN field. */
#define MODEMTIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Trigger (1UL) /*!< Trigger task */

/* Register: MODEMTIMER_TASKS_CAPTURE */
/* Description: Description collection: Capture Timer value to CC[n] register */

/* Bit 0 : Capture Timer value to CC[n] register */
#define MODEMTIMER_TASKS_CAPTURE_TASKS_CAPTURE_Pos (0UL) /*!< Position of TASKS_CAPTURE field. */
#define MODEMTIMER_TASKS_CAPTURE_TASKS_CAPTURE_Msk (0x1UL << MODEMTIMER_TASKS_CAPTURE_TASKS_CAPTURE_Pos) /*!< Bit mask of TASKS_CAPTURE field. */
#define MODEMTIMER_TASKS_CAPTURE_TASKS_CAPTURE_Trigger (1UL) /*!< Trigger task */

/* Register: MODEMTIMER_EVENTS_COMPARE */
/* Description: Description collection: Compare event on CC[n] match. */

/* Bit 0 : Compare event on CC[n] match. */
#define MODEMTIMER_EVENTS_COMPARE_EVENTS_COMPARE_Pos (0UL) /*!< Position of EVENTS_COMPARE field. */
#define MODEMTIMER_EVENTS_COMPARE_EVENTS_COMPARE_Msk (0x1UL << MODEMTIMER_EVENTS_COMPARE_EVENTS_COMPARE_Pos) /*!< Bit mask of EVENTS_COMPARE field. */
#define MODEMTIMER_EVENTS_COMPARE_EVENTS_COMPARE_NotGenerated (0UL) /*!< Event not generated */
#define MODEMTIMER_EVENTS_COMPARE_EVENTS_COMPARE_Generated (1UL) /*!< Event generated */

/* Register: MODEMTIMER_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 15 : Shortcut between event COMPARE[7] and task STOP */
#define MODEMTIMER_SHORTS_COMPARE7_STOP_Pos (15UL) /*!< Position of COMPARE7_STOP field. */
#define MODEMTIMER_SHORTS_COMPARE7_STOP_Msk (0x1UL << MODEMTIMER_SHORTS_COMPARE7_STOP_Pos) /*!< Bit mask of COMPARE7_STOP field. */
#define MODEMTIMER_SHORTS_COMPARE7_STOP_Disabled (0UL) /*!< Disable shortcut */
#define MODEMTIMER_SHORTS_COMPARE7_STOP_Enabled (1UL) /*!< Enable shortcut */

/* Bit 14 : Shortcut between event COMPARE[6] and task STOP */
#define MODEMTIMER_SHORTS_COMPARE6_STOP_Pos (14UL) /*!< Position of COMPARE6_STOP field. */
#define MODEMTIMER_SHORTS_COMPARE6_STOP_Msk (0x1UL << MODEMTIMER_SHORTS_COMPARE6_STOP_Pos) /*!< Bit mask of COMPARE6_STOP field. */
#define MODEMTIMER_SHORTS_COMPARE6_STOP_Disabled (0UL) /*!< Disable shortcut */
#define MODEMTIMER_SHORTS_COMPARE6_STOP_Enabled (1UL) /*!< Enable shortcut */

/* Bit 13 : Shortcut between event COMPARE[5] and task STOP */
#define MODEMTIMER_SHORTS_COMPARE5_STOP_Pos (13UL) /*!< Position of COMPARE5_STOP field. */
#define MODEMTIMER_SHORTS_COMPARE5_STOP_Msk (0x1UL << MODEMTIMER_SHORTS_COMPARE5_STOP_Pos) /*!< Bit mask of COMPARE5_STOP field. */
#define MODEMTIMER_SHORTS_COMPARE5_STOP_Disabled (0UL) /*!< Disable shortcut */
#define MODEMTIMER_SHORTS_COMPARE5_STOP_Enabled (1UL) /*!< Enable shortcut */

/* Bit 12 : Shortcut between event COMPARE[4] and task STOP */
#define MODEMTIMER_SHORTS_COMPARE4_STOP_Pos (12UL) /*!< Position of COMPARE4_STOP field. */
#define MODEMTIMER_SHORTS_COMPARE4_STOP_Msk (0x1UL << MODEMTIMER_SHORTS_COMPARE4_STOP_Pos) /*!< Bit mask of COMPARE4_STOP field. */
#define MODEMTIMER_SHORTS_COMPARE4_STOP_Disabled (0UL) /*!< Disable shortcut */
#define MODEMTIMER_SHORTS_COMPARE4_STOP_Enabled (1UL) /*!< Enable shortcut */

