adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 11 : Shortcut between event COMPARE[3] and task STOP */
#define MODEMTIMER_SHORTS_COMPARE3_STOP_Pos (11UL) /*!< Position of COMPARE3_STOP field. */
#define MODEMTIMER_SHORTS_COMPARE3_STOP_Msk (0x1UL << MODEMTIMER_SHORTS_COMPARE3_STOP_Pos) /*!< Bit mask of COMPARE3_STOP field. */
#define MODEMTIMER_SHORTS_COMPARE3_STOP_Disabled (0UL) /*!< Disable shortcut */
#define MODEMTIMER_SHORTS_COMPARE3_STOP_Enabled (1UL) /*!< Enable shortcut */

/* Bit 10 : Shortcut between event COMPARE[2] and task STOP */
#define MODEMTIMER_SHORTS_COMPARE2_STOP_Pos (10UL) /*!< Position of COMPARE2_STOP field. */
#define MODEMTIMER_SHORTS_COMPARE2_STOP_Msk (0x1UL << MODEMTIMER_SHORTS_COMPARE2_STOP_Pos) /*!< Bit mask of COMPARE2_STOP field. */
#define MODEMTIMER_SHORTS_COMPARE2_STOP_Disabled (0UL) /*!< Disable shortcut */
#define MODEMTIMER_SHORTS_COMPARE2_STOP_Enabled (1UL) /*!< Enable shortcut */

/* Bit 9 : Shortcut between event COMPARE[1] and task STOP */
#define MODEMTIMER_SHORTS_COMPARE1_STOP_Pos (9UL) /*!< Position of COMPARE1_STOP field. */
#define MODEMTIMER_SHORTS_COMPARE1_STOP_Msk (0x1UL << MODEMTIMER_SHORTS_COMPARE1_STOP_Pos) /*!< Bit mask of COMPARE1_STOP field. */
#define MODEMTIMER_SHORTS_COMPARE1_STOP_Disabled (0UL) /*!< Disable shortcut */
#define MODEMTIMER_SHORTS_COMPARE1_STOP_Enabled (1UL) /*!< Enable shortcut */

/* Bit 8 : Shortcut between event COMPARE[0] and task STOP */
#define MODEMTIMER_SHORTS_COMPARE0_STOP_Pos (8UL) /*!< Position of COMPARE0_STOP field. */
#define MODEMTIMER_SHORTS_COMPARE0_STOP_Msk (0x1UL << MODEMTIMER_SHORTS_COMPARE0_STOP_Pos) /*!< Bit mask of COMPARE0_STOP field. */
#define MODEMTIMER_SHORTS_COMPARE0_STOP_Disabled (0UL) /*!< Disable shortcut */
#define MODEMTIMER_SHORTS_COMPARE0_STOP_Enabled (1UL) /*!< Enable shortcut */

/* Bit 7 : Shortcut between event COMPARE[7] and task CLEAR */
#define MODEMTIMER_SHORTS_COMPARE7_CLEAR_Pos (7UL) /*!< Position of COMPARE7_CLEAR field. */
#define MODEMTIMER_SHORTS_COMPARE7_CLEAR_Msk (0x1UL << MODEMTIMER_SHORTS_COMPARE7_CLEAR_Pos) /*!< Bit mask of COMPARE7_CLEAR field. */
#define MODEMTIMER_SHORTS_COMPARE7_CLEAR_Disabled (0UL) /*!< Disable shortcut */
#define MODEMTIMER_SHORTS_COMPARE7_CLEAR_Enabled (1UL) /*!< Enable shortcut */

/* Bit 6 : Shortcut between event COMPARE[6] and task CLEAR */
#define MODEMTIMER_SHORTS_COMPARE6_CLEAR_Pos (6UL) /*!< Position of COMPARE6_CLEAR field. */
#define MODEMTIMER_SHORTS_COMPARE6_CLEAR_Msk (0x1UL << MODEMTIMER_SHORTS_COMPARE6_CLEAR_Pos) /*!< Bit mask of COMPARE6_CLEAR field. */
#define MODEMTIMER_SHORTS_COMPARE6_CLEAR_Disabled (0UL) /*!< Disable shortcut */
#define MODEMTIMER_SHORTS_COMPARE6_CLEAR_Enabled (1UL) /*!< Enable shortcut */

/* Bit 5 : Shortcut between event COMPARE[5] and task CLEAR */
#define MODEMTIMER_SHORTS_COMPARE5_CLEAR_Pos (5UL) /*!< Position of COMPARE5_CLEAR field. */
#define MODEMTIMER_SHORTS_COMPARE5_CLEAR_Msk (0x1UL << MODEMTIMER_SHORTS_COMPARE5_CLEAR_Pos) /*!< Bit mask of COMPARE5_CLEAR field. */
#define MODEMTIMER_SHORTS_COMPARE5_CLEAR_Disabled (0UL) /*!< Disable shortcut */
#define MODEMTIMER_SHORTS_COMPARE5_CLEAR_Enabled (1UL) /*!< Enable shortcut */

/* Bit 4 : Shortcut between event COMPARE[4] and task CLEAR */
#define MODEMTIMER_SHORTS_COMPARE4_CLEAR_Pos (4UL) /*!< Position of COMPARE4_CLEAR field. */
#define MODEMTIMER_SHORTS_COMPARE4_CLEAR_Msk (0x1UL << MODEMTIMER_SHORTS_COMPARE4_CLEAR_Pos) /*!< Bit mask of COMPARE4_CLEAR field. */
#define MODEMTIMER_SHORTS_COMPARE4_CLEAR_Disabled (0UL) /*!< Disable shortcut */
#define MODEMTIMER_SHORTS_COMPARE4_CLEAR_Enabled (1UL) /*!< Enable shortcut */

/* Bit 3 : Shortcut between event COMPARE[3] and task CLEAR */
#define MODEMTIMER_SHORTS_COMPARE3_CLEAR_Pos (3UL) /*!< Position of COMPARE3_CLEAR field. */
#define MODEMTIMER_SHORTS_COMPARE3_CLEAR_Msk (0x1UL << MODEMTIMER_SHORTS_COMPARE3_CLEAR_Pos) /*!< Bit mask of COMPARE3_CLEAR field. */
#define MODEMTIMER_SHORTS_COMPARE3_CLEAR_Disabled (0UL) /*!< Disable shortcut */
#define MODEMTIMER_SHORTS_COMPARE3_CLEAR_Enabled (1UL) /*!< Enable shortcut */

/* Bit 2 : Shortcut between event COMPARE[2] and task CLEAR */
#define MODEMTIMER_SHORTS_COMPARE2_CLEAR_Pos (2UL) /*!< Position of COMPARE2_CLEAR field. */
#define MODEMTIMER_SHORTS_COMPARE2_CLEAR_Msk (0x1UL << MODEMTIMER_SHORTS_COMPARE2_CLEAR_Pos) /*!< Bit mask of COMPARE2_CLEAR field. */
#define MODEMTIMER_SHORTS_COMPARE2_CLEAR_Disabled (0UL) /*!< Disable shortcut */
#define MODEMTIMER_SHORTS_COMPARE2_CLEAR_Enabled (1UL) /*!< Enable shortcut */

/* Bit 1 : Shortcut between event COMPARE[1] and task CLEAR */
#define MODEMTIMER_SHORTS_COMPARE1_CLEAR_Pos (1UL) /*!< Position of COMPARE1_CLEAR field. */
#define MODEMTIMER_SHORTS_COMPARE1_CLEAR_Msk (0x1UL << MODEMTIMER_SHORTS_COMPARE1_CLEAR_Pos) /*!< Bit mask of COMPARE1_CLEAR field. */
#define MODEMTIMER_SHORTS_COMPARE1_CLEAR_Disabled (0UL) /*!< Disable shortcut */
#define MODEMTIMER_SHORTS_COMPARE1_CLEAR_Enabled (1UL) /*!< Enable shortcut */

/* Bit 0 : Shortcut between event COMPARE[0] and task CLEAR */
#define MODEMTIMER_SHORTS_COMPARE0_CLEAR_Pos (0UL) /*!< Position of COMPARE0_CLEAR field. */
#define MODEMTIMER_SHORTS_COMPARE0_CLEAR_Msk (0x1UL << MODEMTIMER_SHORTS_COMPARE0_CLEAR_Pos) /*!< Bit mask of COMPARE0_CLEAR field. */
#define MODEMTIMER_SHORTS_COMPARE0_CLEAR_Disabled (0UL) /*!< Disable shortcut */
#define MODEMTIMER_SHORTS_COMPARE0_CLEAR_Enabled (1UL) /*!< Enable shortcut */

/* Register: MODEMTIMER_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 7 : Enable or disable interrupt for event COMPARE[7] */
#define MODEMTIMER_INTEN_COMPARE7_Pos (7UL) /*!< Position of COMPARE7 field. */
#define MODEMTIMER_INTEN_COMPARE7_Msk (0x1UL << MODEMTIMER_INTEN_COMPARE7_Pos) /*!< Bit mask of COMPARE7 field. */
#define MODEMTIMER_INTEN_COMPARE7_Disabled (0UL) /*!< Disable */
#define MODEMTIMER_INTEN_COMPARE7_Enabled (1UL) /*!< Enable */

/* Bit 6 : Enable or disable interrupt for event COMPARE[6] */
#define MODEMTIMER_INTEN_COMPARE6_Pos (6UL) /*!< Position of COMPARE6 field. */
#define MODEMTIMER_INTEN_COMPARE6_Msk (0x1UL << MODEMTIMER_INTEN_COMPARE6_Pos) /*!< Bit mask of COMPARE6 field. */
#define MODEMTIMER_INTEN_COMPARE6_Disabled (0UL) /*!< Disable */
#define MODEMTIMER_INTEN_COMPARE6_Enabled (1UL) /*!< Enable */

