adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bits 31..0 : Capture/Compare value High Word */
#define MODEMTIMER_CCHI6_CCHI_Pos (0UL) /*!< Position of CCHI field. */
#define MODEMTIMER_CCHI6_CCHI_Msk (0xFFFFFFFFUL << MODEMTIMER_CCHI6_CCHI_Pos) /*!< Bit mask of CCHI field. */

/* Register: MODEMTIMER_CCLO7 */
/* Description: Capture/Compare register 7 - Low Word */

/* Bits 31..0 : Capture/Compare value Low Word */
#define MODEMTIMER_CCLO7_CCLO_Pos (0UL) /*!< Position of CCLO field. */
#define MODEMTIMER_CCLO7_CCLO_Msk (0xFFFFFFFFUL << MODEMTIMER_CCLO7_CCLO_Pos) /*!< Bit mask of CCLO field. */

/* Register: MODEMTIMER_CCHI7 */
/* Description: Capture/Compare register 7 - High Word */

/* Bits 31..0 : Capture/Compare value High Word */
#define MODEMTIMER_CCHI7_CCHI_Pos (0UL) /*!< Position of CCHI field. */
#define MODEMTIMER_CCHI7_CCHI_Msk (0xFFFFFFFFUL << MODEMTIMER_CCHI7_CCHI_Pos) /*!< Bit mask of CCHI field. */

/* Register: MODEMTIMER_COUNTLO */
/* Description: Internal Counter Value - Low Word */

/* Bits 31..0 : Internal Counter Value - Low Word */
#define MODEMTIMER_COUNTLO_COUNTLO_Pos (0UL) /*!< Position of COUNTLO field. */
#define MODEMTIMER_COUNTLO_COUNTLO_Msk (0xFFFFFFFFUL << MODEMTIMER_COUNTLO_COUNTLO_Pos) /*!< Bit mask of COUNTLO field. */

/* Register: MODEMTIMER_COUNTHI */
/* Description: Internal Counter Value - High Word */

/* Bits 31..0 : Internal Counter Value High Word */
#define MODEMTIMER_COUNTHI_COUNTHI_Pos (0UL) /*!< Position of COUNTHI field. */
#define MODEMTIMER_COUNTHI_COUNTHI_Msk (0xFFFFFFFFUL << MODEMTIMER_COUNTHI_COUNTHI_Pos) /*!< Bit mask of COUNTHI field. */

/* Register: MODEMTIMER_POWER */
/* Description: Peripheral power control */

/* Bit 0 : Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again. */
#define MODEMTIMER_POWER_POWER_Pos (0UL) /*!< Position of POWER field. */
#define MODEMTIMER_POWER_POWER_Msk (0x1UL << MODEMTIMER_POWER_POWER_Pos) /*!< Bit mask of POWER field. */
#define MODEMTIMER_POWER_POWER_Disabled (0UL) /*!< Peripheral is powered off */
#define MODEMTIMER_POWER_POWER_Enabled (1UL) /*!< Peripheral is powered on */


/* Peripheral: MWU */
/* Description: Memory Watch Unit */

/* Register: MWU_EVENTS_REGION_WA */
/* Description: Description cluster: Write access to region n detected */

/* Bit 0 : Write access to region n detected */
#define MWU_EVENTS_REGION_WA_WA_Pos (0UL) /*!< Position of WA field. */
#define MWU_EVENTS_REGION_WA_WA_Msk (0x1UL << MWU_EVENTS_REGION_WA_WA_Pos) /*!< Bit mask of WA field. */
#define MWU_EVENTS_REGION_WA_WA_NotGenerated (0UL) /*!< Event not generated */
#define MWU_EVENTS_REGION_WA_WA_Generated (1UL) /*!< Event generated */

/* Register: MWU_EVENTS_REGION_RA */
/* Description: Description cluster: Read access to region n detected */

/* Bit 0 : Read access to region n detected */
#define MWU_EVENTS_REGION_RA_RA_Pos (0UL) /*!< Position of RA field. */
#define MWU_EVENTS_REGION_RA_RA_Msk (0x1UL << MWU_EVENTS_REGION_RA_RA_Pos) /*!< Bit mask of RA field. */
#define MWU_EVENTS_REGION_RA_RA_NotGenerated (0UL) /*!< Event not generated */
#define MWU_EVENTS_REGION_RA_RA_Generated (1UL) /*!< Event generated */

/* Register: MWU_EVENTS_PREGION_WA */
/* Description: Description cluster: Write access to peripheral region n detected */

/* Bit 0 : Write access to peripheral region n detected */
#define MWU_EVENTS_PREGION_WA_WA_Pos (0UL) /*!< Position of WA field. */
#define MWU_EVENTS_PREGION_WA_WA_Msk (0x1UL << MWU_EVENTS_PREGION_WA_WA_Pos) /*!< Bit mask of WA field. */
#define MWU_EVENTS_PREGION_WA_WA_NotGenerated (0UL) /*!< Event not generated */
#define MWU_EVENTS_PREGION_WA_WA_Generated (1UL) /*!< Event generated */

/* Register: MWU_EVENTS_PREGION_RA */
/* Description: Description cluster: Read access to peripheral region n detected */

/* Bit 0 : Read access to peripheral region n detected */
#define MWU_EVENTS_PREGION_RA_RA_Pos (0UL) /*!< Position of RA field. */
#define MWU_EVENTS_PREGION_RA_RA_Msk (0x1UL << MWU_EVENTS_PREGION_RA_RA_Pos) /*!< Bit mask of RA field. */
#define MWU_EVENTS_PREGION_RA_RA_NotGenerated (0UL) /*!< Event not generated */
#define MWU_EVENTS_PREGION_RA_RA_Generated (1UL) /*!< Event generated */

/* Register: MWU_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 27 : Enable or disable interrupt for event PREGION1RA */
#define MWU_INTEN_PREGION1RA_Pos (27UL) /*!< Position of PREGION1RA field. */
#define MWU_INTEN_PREGION1RA_Msk (0x1UL << MWU_INTEN_PREGION1RA_Pos) /*!< Bit mask of PREGION1RA field. */
#define MWU_INTEN_PREGION1RA_Disabled (0UL) /*!< Disable */
#define MWU_INTEN_PREGION1RA_Enabled (1UL) /*!< Enable */

/* Bit 26 : Enable or disable interrupt for event PREGION1WA */
#define MWU_INTEN_PREGION1WA_Pos (26UL) /*!< Position of PREGION1WA field. */
#define MWU_INTEN_PREGION1WA_Msk (0x1UL << MWU_INTEN_PREGION1WA_Pos) /*!< Bit mask of PREGION1WA field. */
#define MWU_INTEN_PREGION1WA_Disabled (0UL) /*!< Disable */
#define MWU_INTEN_PREGION1WA_Enabled (1UL) /*!< Enable */

/* Bit 25 : Enable or disable interrupt for event PREGION0RA */
#define MWU_INTEN_PREGION0RA_Pos (25UL) /*!< Position of PREGION0RA field. */
#define MWU_INTEN_PREGION0RA_Msk (0x1UL << MWU_INTEN_PREGION0RA_Pos) /*!< Bit mask of PREGION0RA field. */
#define MWU_INTEN_PREGION0RA_Disabled (0UL) /*!< Disable */
#define MWU_INTEN_PREGION0RA_Enabled (1UL) /*!< Enable */

/* Bit 24 : Enable or disable interrupt for event PREGION0WA */
#define MWU_INTEN_PREGION0WA_Pos (24UL) /*!< Position of PREGION0WA field. */
#define MWU_INTEN_PREGION0WA_Msk (0x1UL << MWU_INTEN_PREGION0WA_Pos) /*!< Bit mask of PREGION0WA field. */
#define MWU_INTEN_PREGION0WA_Disabled (0UL) /*!< Disable */
#define MWU_INTEN_PREGION0WA_Enabled (1UL) /*!< Enable */

/* Bit 7 : Enable or disable interrupt for event REGION3RA */
#define MWU_INTEN_REGION3RA_Pos (7UL) /*!< Position of REGION3RA field. */
#define MWU_INTEN_REGION3RA_Msk (0x1UL << MWU_INTEN_REGION3RA_Pos) /*!< Bit mask of REGION3RA field. */
#define MWU_INTEN_REGION3RA_Disabled (0UL) /*!< Disable */
#define MWU_INTEN_REGION3RA_Enabled (1UL) /*!< Enable */

/* Bit 6 : Enable or disable interrupt for event REGION3WA */
#define MWU_INTEN_REGION3WA_Pos (6UL) /*!< Position of REGION3WA field. */
#define MWU_INTEN_REGION3WA_Msk (0x1UL << MWU_INTEN_REGION3WA_Pos) /*!< Bit mask of REGION3WA field. */
#define MWU_INTEN_REGION3WA_Disabled (0UL) /*!< Disable */
#define MWU_INTEN_REGION3WA_Enabled (1UL) /*!< Enable */

/* Bit 5 : Enable or disable interrupt for event REGION2RA */
#define MWU_INTEN_REGION2RA_Pos (5UL) /*!< Position of REGION2RA field. */
#define MWU_INTEN_REGION2RA_Msk (0x1UL << MWU_INTEN_REGION2RA_Pos) /*!< Bit mask of REGION2RA field. */
#define MWU_INTEN_REGION2RA_Disabled (0UL) /*!< Disable */
#define MWU_INTEN_REGION2RA_Enabled (1UL) /*!< Enable */

