adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 21 : Control the EV signal */
#define NVMC_TESTCONTROLLINES_2_EV_Pos (21UL) /*!< Position of EV field. */
#define NVMC_TESTCONTROLLINES_2_EV_Msk (0x1UL << NVMC_TESTCONTROLLINES_2_EV_Pos) /*!< Bit mask of EV field. */

/* Bit 20 : Control the IFREN1 signal */
#define NVMC_TESTCONTROLLINES_2_IFREN1_Pos (20UL) /*!< Position of IFREN1 field. */
#define NVMC_TESTCONTROLLINES_2_IFREN1_Msk (0x1UL << NVMC_TESTCONTROLLINES_2_IFREN1_Pos) /*!< Bit mask of IFREN1 field. */

/* Bits 19..18 : Control the REDEN signal */
#define NVMC_TESTCONTROLLINES_2_REDEN_Pos (18UL) /*!< Position of REDEN field. */
#define NVMC_TESTCONTROLLINES_2_REDEN_Msk (0x3UL << NVMC_TESTCONTROLLINES_2_REDEN_Pos) /*!< Bit mask of REDEN field. */

/* Bit 17 : Control the PDM25 signal */
#define NVMC_TESTCONTROLLINES_2_PDM25_Pos (17UL) /*!< Position of PDM25 field. */
#define NVMC_TESTCONTROLLINES_2_PDM25_Msk (0x1UL << NVMC_TESTCONTROLLINES_2_PDM25_Pos) /*!< Bit mask of PDM25 field. */

/* Register: NVMC_TESTCONTROLADDR_2 */
/* Description: Direct flash test control, address lines. Flash macro 2. */

/* Bits 14..5 : Control the XADDR signal */
#define NVMC_TESTCONTROLADDR_2_XADDR_Pos (5UL) /*!< Position of XADDR field. */
#define NVMC_TESTCONTROLADDR_2_XADDR_Msk (0x3FFUL << NVMC_TESTCONTROLADDR_2_XADDR_Pos) /*!< Bit mask of XADDR field. */

/* Bits 4..0 : Control the YADDR signal */
#define NVMC_TESTCONTROLADDR_2_YADDR_Pos (0UL) /*!< Position of YADDR field. */
#define NVMC_TESTCONTROLADDR_2_YADDR_Msk (0x1FUL << NVMC_TESTCONTROLADDR_2_YADDR_Pos) /*!< Bit mask of YADDR field. */

/* Register: NVMC_TESTCOUNTERRELOAD_2 */
/* Description: Counter reload value, used when counting from SE or YE rising edge to latching of data. Flash macro 2. */

/* Bits 11..0 : Counter reload value, in MCU bus cycles, used when counting from SE or YE rising edge to latching of data. Value of 0 has no effect (counter will not latch) */
#define NVMC_TESTCOUNTERRELOAD_2_RELOAD_Pos (0UL) /*!< Position of RELOAD field. */
#define NVMC_TESTCOUNTERRELOAD_2_RELOAD_Msk (0xFFFUL << NVMC_TESTCOUNTERRELOAD_2_RELOAD_Pos) /*!< Bit mask of RELOAD field. */

/* Register: NVMC_TESTCOUNTERRUNNING_2 */
/* Description: Returns the state (counting or not) of the counter. Flash macro 2. */

/* Bit 0 : Returns the state of the counter */
#define NVMC_TESTCOUNTERRUNNING_2_RUNNING_Pos (0UL) /*!< Position of RUNNING field. */
#define NVMC_TESTCOUNTERRUNNING_2_RUNNING_Msk (0x1UL << NVMC_TESTCOUNTERRUNNING_2_RUNNING_Pos) /*!< Bit mask of RUNNING field. */
#define NVMC_TESTCOUNTERRUNNING_2_RUNNING_NotRunning (0UL) /*!< Counter is not running */
#define NVMC_TESTCOUNTERRUNNING_2_RUNNING_Running (1UL) /*!< Counter is running */

/* Register: NVMC_TESTCONFIG_2 */
/* Description: Mode of operation of the counter. Flash macro 2. */

/* Bit 3 : Disables the address auto-increment or -decrement */
#define NVMC_TESTCONFIG_2_AUTOINCEN_Pos (3UL) /*!< Position of AUTOINCEN field. */
#define NVMC_TESTCONFIG_2_AUTOINCEN_Msk (0x1UL << NVMC_TESTCONFIG_2_AUTOINCEN_Pos) /*!< Bit mask of AUTOINCEN field. */
#define NVMC_TESTCONFIG_2_AUTOINCEN_Enable (0UL) /*!< Address auto-incrementing/decrementing is enabled */
#define NVMC_TESTCONFIG_2_AUTOINCEN_Disable (1UL) /*!< Address auto-incrementing/decrementing is disabled */

/* Bit 2 : Controls the address auto-increment or -decrement */
#define NVMC_TESTCONFIG_2_AUTOINC_Pos (2UL) /*!< Position of AUTOINC field. */
#define NVMC_TESTCONFIG_2_AUTOINC_Msk (0x1UL << NVMC_TESTCONFIG_2_AUTOINC_Pos) /*!< Bit mask of AUTOINC field. */
#define NVMC_TESTCONFIG_2_AUTOINC_Increment (0UL) /*!< Address is auto-incrementing */
#define NVMC_TESTCONFIG_2_AUTOINC_Decrement (1UL) /*!< Address is auto-decrementing */

/* Bit 1 : Defines the starting point of the counter */
#define NVMC_TESTCONFIG_2_START_Pos (1UL) /*!< Position of START field. */
#define NVMC_TESTCONFIG_2_START_Msk (0x1UL << NVMC_TESTCONFIG_2_START_Pos) /*!< Bit mask of START field. */
#define NVMC_TESTCONFIG_2_START_SE (0UL) /*!< Counter starts on SE rising edge */
#define NVMC_TESTCONFIG_2_START_YE (1UL) /*!< Counter starts on YE rising edge */

/* Bit 0 : Returns the state of the counter */
#define NVMC_TESTCONFIG_2_ENABLE_Pos (0UL) /*!< Position of ENABLE field. */
#define NVMC_TESTCONFIG_2_ENABLE_Msk (0x1UL << NVMC_TESTCONFIG_2_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define NVMC_TESTCONFIG_2_ENABLE_Disabled (0UL) /*!< Counter is disabled */
#define NVMC_TESTCONFIG_2_ENABLE_Enabled (1UL) /*!< Counter is enabled */

/* Register: NVMC_TESTTMVPPANAEN_2 */
/* Description: Controls analog signals for flash measurements. Flash macro 2. */

/* Bit 4 : Enable the VPPDIV pad. Needs to be set when measuring VPPDIV on GPIO26 (P0.20), and when applying high-voltage on VPP pad. */
#define NVMC_TESTTMVPPANAEN_2_VPPDIVEN_Pos (4UL) /*!< Position of VPPDIVEN field. */
#define NVMC_TESTTMVPPANAEN_2_VPPDIVEN_Msk (0x1UL << NVMC_TESTTMVPPANAEN_2_VPPDIVEN_Pos) /*!< Bit mask of VPPDIVEN field. */
#define NVMC_TESTTMVPPANAEN_2_VPPDIVEN_Disabled (0UL) /*!< VPPDIV pad disabled */
#define NVMC_TESTTMVPPANAEN_2_VPPDIVEN_Enabled (1UL) /*!< VPPDIV pad enabled */

/* Bits 3..0 : Analog enable for TM measurement. Needs to be set when measuring TM[3:0] on P0.05, P0.04, P0.01 and P0.00. */
#define NVMC_TESTTMVPPANAEN_2_TMANAEN_Pos (0UL) /*!< Position of TMANAEN field. */
#define NVMC_TESTTMVPPANAEN_2_TMANAEN_Msk (0xFUL << NVMC_TESTTMVPPANAEN_2_TMANAEN_Pos) /*!< Bit mask of TMANAEN field. */
#define NVMC_TESTTMVPPANAEN_2_TMANAEN_Disabled (0x0UL) /*!< All pads disabled */
#define NVMC_TESTTMVPPANAEN_2_TMANAEN_Enabled (0xFUL) /*!< All pads enabled */

/* Register: NVMC_FORCEONNVM */
/* Description: Force on NVM. See also the internal section in the NVMC chapter. */

/* Bit 0 : Force on NVM controller. See also the internal section in the NVMC chapter. */
#define NVMC_FORCEONNVM_FORCEONNVM_Pos (0UL) /*!< Position of FORCEONNVM field. */
#define NVMC_FORCEONNVM_FORCEONNVM_Msk (0x1UL << NVMC_FORCEONNVM_FORCEONNVM_Pos) /*!< Bit mask of FORCEONNVM field. */
#define NVMC_FORCEONNVM_FORCEONNVM_DoNotForceOn (0UL) /*!< Do not force on NVM controller */
#define NVMC_FORCEONNVM_FORCEONNVM_ForceOn (1UL) /*!< Force on NVM controller */


