adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 0 : AES DMA promotion as a secure device. */
#define SECURECONTROL_AESDMAPROMOTION_AESDMAPROMOTION_Pos (0UL) /*!< Position of AESDMAPROMOTION field. */
#define SECURECONTROL_AESDMAPROMOTION_AESDMAPROMOTION_Msk (0x1UL << SECURECONTROL_AESDMAPROMOTION_AESDMAPROMOTION_Pos) /*!< Bit mask of AESDMAPROMOTION field. */
#define SECURECONTROL_AESDMAPROMOTION_AESDMAPROMOTION_Nonsecure (0UL) /*!< AES DMA is a nonsecure device. */
#define SECURECONTROL_AESDMAPROMOTION_AESDMAPROMOTION_Secure (1UL) /*!< AES DMA is a secure device. */

/* Register: SECURECONTROL_SHADMAPROMOTION */
/* Description: SHA DMA promoted as a secure device. */

/* Bit 0 : SHA DMA promotion as a secure device. */
#define SECURECONTROL_SHADMAPROMOTION_SHADMAPROMOTION_Pos (0UL) /*!< Position of SHADMAPROMOTION field. */
#define SECURECONTROL_SHADMAPROMOTION_SHADMAPROMOTION_Msk (0x1UL << SECURECONTROL_SHADMAPROMOTION_SHADMAPROMOTION_Pos) /*!< Bit mask of SHADMAPROMOTION field. */
#define SECURECONTROL_SHADMAPROMOTION_SHADMAPROMOTION_Nonsecure (0UL) /*!< AES DMA is a nonsecure device. */
#define SECURECONTROL_SHADMAPROMOTION_SHADMAPROMOTION_Secure (1UL) /*!< AES DMA is a secure device. */

/* Register: SECURECONTROL_SECUREWATCHDOGPAUSE */
/* Description: Secure watchdog pause control. */

/* Bit 0 : Secure watchdog pause control. */
#define SECURECONTROL_SECUREWATCHDOGPAUSE_SECUREWDPAUSE_Pos (0UL) /*!< Position of SECUREWDPAUSE field. */
#define SECURECONTROL_SECUREWATCHDOGPAUSE_SECUREWDPAUSE_Msk (0x1UL << SECURECONTROL_SECUREWATCHDOGPAUSE_SECUREWDPAUSE_Pos) /*!< Bit mask of SECUREWDPAUSE field. */
#define SECURECONTROL_SECUREWATCHDOGPAUSE_SECUREWDPAUSE_Running (0UL) /*!< Secure WD running. */
#define SECURECONTROL_SECUREWATCHDOGPAUSE_SECUREWDPAUSE_Paused (1UL) /*!< Secure WD paused. */


/* Peripheral: SHA */
/* Description: SHA-1/SHA-256 */

/* Register: SHA_TASKS_START_GATHER */
/* Description: Start input DMA. */

/* Bit 0 : Start input DMA. */
#define SHA_TASKS_START_GATHER_TASKS_START_GATHER_Pos (0UL) /*!< Position of TASKS_START_GATHER field. */
#define SHA_TASKS_START_GATHER_TASKS_START_GATHER_Msk (0x1UL << SHA_TASKS_START_GATHER_TASKS_START_GATHER_Pos) /*!< Bit mask of TASKS_START_GATHER field. */
#define SHA_TASKS_START_GATHER_TASKS_START_GATHER_Trigger (1UL) /*!< Trigger task */

/* Register: SHA_TASKS_STOP_GATHER */
/* Description: Stop input DMA. */

/* Bit 0 : Stop input DMA. */
#define SHA_TASKS_STOP_GATHER_TASKS_STOP_GATHER_Pos (0UL) /*!< Position of TASKS_STOP_GATHER field. */
#define SHA_TASKS_STOP_GATHER_TASKS_STOP_GATHER_Msk (0x1UL << SHA_TASKS_STOP_GATHER_TASKS_STOP_GATHER_Pos) /*!< Bit mask of TASKS_STOP_GATHER field. */
#define SHA_TASKS_STOP_GATHER_TASKS_STOP_GATHER_Trigger (1UL) /*!< Trigger task */

/* Register: SHA_TASKS_START_OPERATION */
/* Description: Start SHA-x operation depending on mode (start accepting data). */

/* Bit 0 : Start SHA-x operation depending on mode (start accepting data). */
#define SHA_TASKS_START_OPERATION_TASKS_START_OPERATION_Pos (0UL) /*!< Position of TASKS_START_OPERATION field. */
#define SHA_TASKS_START_OPERATION_TASKS_START_OPERATION_Msk (0x1UL << SHA_TASKS_START_OPERATION_TASKS_START_OPERATION_Pos) /*!< Bit mask of TASKS_START_OPERATION field. */
#define SHA_TASKS_START_OPERATION_TASKS_START_OPERATION_Trigger (1UL) /*!< Trigger task */

/* Register: SHA_TASKS_FINALIZE */
/* Description: Finalize SHA calculation. */

/* Bit 0 : Finalize SHA calculation. */
#define SHA_TASKS_FINALIZE_TASKS_FINALIZE_Pos (0UL) /*!< Position of TASKS_FINALIZE field. */
#define SHA_TASKS_FINALIZE_TASKS_FINALIZE_Msk (0x1UL << SHA_TASKS_FINALIZE_TASKS_FINALIZE_Pos) /*!< Bit mask of TASKS_FINALIZE field. */
#define SHA_TASKS_FINALIZE_TASKS_FINALIZE_Trigger (1UL) /*!< Trigger task */

/* Register: SHA_TASKS_RESET */
/* Description: Stop all transfers and crypto operations (initialize). */

/* Bit 0 : Stop all transfers and crypto operations (initialize). */
#define SHA_TASKS_RESET_TASKS_RESET_Pos (0UL) /*!< Position of TASKS_RESET field. */
#define SHA_TASKS_RESET_TASKS_RESET_Msk (0x1UL << SHA_TASKS_RESET_TASKS_RESET_Pos) /*!< Bit mask of TASKS_RESET field. */
#define SHA_TASKS_RESET_TASKS_RESET_Trigger (1UL) /*!< Trigger task */

/* Register: SHA_EVENTS_GATHER_STARTED */
/* Description: Input DMA started. */

/* Bit 0 : Input DMA started. */
#define SHA_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Pos (0UL) /*!< Position of EVENTS_GATHER_STARTED field. */
#define SHA_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Msk (0x1UL << SHA_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Pos) /*!< Bit mask of EVENTS_GATHER_STARTED field. */
#define SHA_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_NotGenerated (0UL) /*!< Event not generated */
#define SHA_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Generated (1UL) /*!< Event generated */

/* Register: SHA_EVENTS_GATHER_DONE */
/* Description: Input DMA done. */

/* Bit 0 : Input DMA done. */
#define SHA_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Pos (0UL) /*!< Position of EVENTS_GATHER_DONE field. */
#define SHA_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Msk (0x1UL << SHA_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Pos) /*!< Bit mask of EVENTS_GATHER_DONE field. */
#define SHA_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_NotGenerated (0UL) /*!< Event not generated */
#define SHA_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Generated (1UL) /*!< Event generated */

/* Register: SHA_EVENTS_Unused */
/* Description: Unused */

/* Bit 0 : Unused */
#define SHA_EVENTS_Unused_EVENTS_Unused_Pos (0UL) /*!< Position of EVENTS_Unused field. */
#define SHA_EVENTS_Unused_EVENTS_Unused_Msk (0x1UL << SHA_EVENTS_Unused_EVENTS_Unused_Pos) /*!< Bit mask of EVENTS_Unused field. */
#define SHA_EVENTS_Unused_EVENTS_Unused_NotGenerated (0UL) /*!< Event not generated */
#define SHA_EVENTS_Unused_EVENTS_Unused_Generated (1UL) /*!< Event generated */

/* Register: SHA_EVENTS_MESSAGE_READY */
/* Description: LENGTH == 0. */

/* Bit 0 : LENGTH == 0. */
#define SHA_EVENTS_MESSAGE_READY_EVENTS_MESSAGE_READY_Pos (0UL) /*!< Position of EVENTS_MESSAGE_READY field. */
#define SHA_EVENTS_MESSAGE_READY_EVENTS_MESSAGE_READY_Msk (0x1UL << SHA_EVENTS_MESSAGE_READY_EVENTS_MESSAGE_READY_Pos) /*!< Bit mask of EVENTS_MESSAGE_READY field. */
#define SHA_EVENTS_MESSAGE_READY_EVENTS_MESSAGE_READY_NotGenerated (0UL) /*!< Event not generated */
#define SHA_EVENTS_MESSAGE_READY_EVENTS_MESSAGE_READY_Generated (1UL) /*!< Event generated */

/* Register: SHA_EVENTS_SHA_READY */
/* Description: SHA calculated. */

