adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Register: SIMIF_EVENTS_PARITY_ERROR */
/* Description: Rx byte parity error */

/* Bit 0 : Rx byte parity error */
#define SIMIF_EVENTS_PARITY_ERROR_EVENTS_PARITY_ERROR_Pos (0UL) /*!< Position of EVENTS_PARITY_ERROR field. */
#define SIMIF_EVENTS_PARITY_ERROR_EVENTS_PARITY_ERROR_Msk (0x1UL << SIMIF_EVENTS_PARITY_ERROR_EVENTS_PARITY_ERROR_Pos) /*!< Bit mask of EVENTS_PARITY_ERROR field. */
#define SIMIF_EVENTS_PARITY_ERROR_EVENTS_PARITY_ERROR_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_PARITY_ERROR_EVENTS_PARITY_ERROR_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_ATR_TIMEOUT */
/* Description: No ATR between 400 and 40000 sim clock cycles */

/* Bit 0 : No ATR between 400 and 40000 sim clock cycles */
#define SIMIF_EVENTS_ATR_TIMEOUT_EVENTS_ATR_TIMEOUT_Pos (0UL) /*!< Position of EVENTS_ATR_TIMEOUT field. */
#define SIMIF_EVENTS_ATR_TIMEOUT_EVENTS_ATR_TIMEOUT_Msk (0x1UL << SIMIF_EVENTS_ATR_TIMEOUT_EVENTS_ATR_TIMEOUT_Pos) /*!< Bit mask of EVENTS_ATR_TIMEOUT field. */
#define SIMIF_EVENTS_ATR_TIMEOUT_EVENTS_ATR_TIMEOUT_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_ATR_TIMEOUT_EVENTS_ATR_TIMEOUT_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_CW_TIMEOUT */
/* Description: T=1 character wait timeout */

/* Bit 0 : T=1 character wait timeout */
#define SIMIF_EVENTS_CW_TIMEOUT_EVENTS_CW_TIMEOUT_Pos (0UL) /*!< Position of EVENTS_CW_TIMEOUT field. */
#define SIMIF_EVENTS_CW_TIMEOUT_EVENTS_CW_TIMEOUT_Msk (0x1UL << SIMIF_EVENTS_CW_TIMEOUT_EVENTS_CW_TIMEOUT_Pos) /*!< Bit mask of EVENTS_CW_TIMEOUT field. */
#define SIMIF_EVENTS_CW_TIMEOUT_EVENTS_CW_TIMEOUT_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_CW_TIMEOUT_EVENTS_CW_TIMEOUT_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_BW_TIMEOUT */
/* Description: Block Wait timeout */

/* Bit 0 : Block Wait timeout */
#define SIMIF_EVENTS_BW_TIMEOUT_EVENTS_BW_TIMEOUT_Pos (0UL) /*!< Position of EVENTS_BW_TIMEOUT field. */
#define SIMIF_EVENTS_BW_TIMEOUT_EVENTS_BW_TIMEOUT_Msk (0x1UL << SIMIF_EVENTS_BW_TIMEOUT_EVENTS_BW_TIMEOUT_Pos) /*!< Bit mask of EVENTS_BW_TIMEOUT field. */
#define SIMIF_EVENTS_BW_TIMEOUT_EVENTS_BW_TIMEOUT_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_BW_TIMEOUT_EVENTS_BW_TIMEOUT_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_SW1SW2 */
/* Description: SW1 and SW2 bytes  received */

/* Bit 0 : SW1 and SW2 bytes  received */
#define SIMIF_EVENTS_SW1SW2_EVENTS_SW1SW2_Pos (0UL) /*!< Position of EVENTS_SW1SW2 field. */
#define SIMIF_EVENTS_SW1SW2_EVENTS_SW1SW2_Msk (0x1UL << SIMIF_EVENTS_SW1SW2_EVENTS_SW1SW2_Pos) /*!< Bit mask of EVENTS_SW1SW2 field. */
#define SIMIF_EVENTS_SW1SW2_EVENTS_SW1SW2_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_SW1SW2_EVENTS_SW1SW2_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_RESET */
/* Description: Everything reset */

/* Bit 0 : Everything reset */
#define SIMIF_EVENTS_RESET_EVENTS_RESET_Pos (0UL) /*!< Position of EVENTS_RESET field. */
#define SIMIF_EVENTS_RESET_EVENTS_RESET_Msk (0x1UL << SIMIF_EVENTS_RESET_EVENTS_RESET_Pos) /*!< Bit mask of EVENTS_RESET field. */
#define SIMIF_EVENTS_RESET_EVENTS_RESET_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_RESET_EVENTS_RESET_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_INS */
/* Description: T=0 procedure byte  INS received */

/* Bit 0 : T=0 procedure byte  INS received */
#define SIMIF_EVENTS_INS_EVENTS_INS_Pos (0UL) /*!< Position of EVENTS_INS field. */
#define SIMIF_EVENTS_INS_EVENTS_INS_Msk (0x1UL << SIMIF_EVENTS_INS_EVENTS_INS_Pos) /*!< Bit mask of EVENTS_INS field. */
#define SIMIF_EVENTS_INS_EVENTS_INS_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_INS_EVENTS_INS_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_NINS */
/* Description: T=0 procedure byte  !INS received */

/* Bit 0 : T=0 procedure byte  !INS received */
#define SIMIF_EVENTS_NINS_EVENTS_NINS_Pos (0UL) /*!< Position of EVENTS_NINS field. */
#define SIMIF_EVENTS_NINS_EVENTS_NINS_Msk (0x1UL << SIMIF_EVENTS_NINS_EVENTS_NINS_Pos) /*!< Bit mask of EVENTS_NINS field. */
#define SIMIF_EVENTS_NINS_EVENTS_NINS_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_NINS_EVENTS_NINS_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_ERROR */
/* Description: Error response */

/* Bit 0 : Error response */
#define SIMIF_EVENTS_ERROR_EVENTS_ERROR_Pos (0UL) /*!< Position of EVENTS_ERROR field. */
#define SIMIF_EVENTS_ERROR_EVENTS_ERROR_Msk (0x1UL << SIMIF_EVENTS_ERROR_EVENTS_ERROR_Pos) /*!< Bit mask of EVENTS_ERROR field. */
#define SIMIF_EVENTS_ERROR_EVENTS_ERROR_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_ERROR_EVENTS_ERROR_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_READY_TX */
/* Description: Byte sent after START_WRITE_FROM_REG */

/* Bit 0 : Byte sent after START_WRITE_FROM_REG */
#define SIMIF_EVENTS_READY_TX_EVENTS_READY_TX_Pos (0UL) /*!< Position of EVENTS_READY_TX field. */
#define SIMIF_EVENTS_READY_TX_EVENTS_READY_TX_Msk (0x1UL << SIMIF_EVENTS_READY_TX_EVENTS_READY_TX_Pos) /*!< Bit mask of EVENTS_READY_TX field. */
#define SIMIF_EVENTS_READY_TX_EVENTS_READY_TX_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_READY_TX_EVENTS_READY_TX_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_RX_DATA_READY */
/* Description: Byte received after START_READ_TO_REG */

/* Bit 0 : Byte received after START_READ_TO_REG */
#define SIMIF_EVENTS_RX_DATA_READY_EVENTS_RX_DATA_READY_Pos (0UL) /*!< Position of EVENTS_RX_DATA_READY field. */
#define SIMIF_EVENTS_RX_DATA_READY_EVENTS_RX_DATA_READY_Msk (0x1UL << SIMIF_EVENTS_RX_DATA_READY_EVENTS_RX_DATA_READY_Pos) /*!< Bit mask of EVENTS_RX_DATA_READY field. */
#define SIMIF_EVENTS_RX_DATA_READY_EVENTS_RX_DATA_READY_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_RX_DATA_READY_EVENTS_RX_DATA_READY_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_T1_RX_OVERRUN */
/* Description: Unexpected bytes received after DMA RX[0...N], SW1SW2 in T=1 */

/* Bit 0 : Unexpected bytes received after DMA RX[0...N], SW1SW2 in T=1 */
#define SIMIF_EVENTS_T1_RX_OVERRUN_EVENTS_T1_RX_OVERRUN_Pos (0UL) /*!< Position of EVENTS_T1_RX_OVERRUN field. */
#define SIMIF_EVENTS_T1_RX_OVERRUN_EVENTS_T1_RX_OVERRUN_Msk (0x1UL << SIMIF_EVENTS_T1_RX_OVERRUN_EVENTS_T1_RX_OVERRUN_Pos) /*!< Bit mask of EVENTS_T1_RX_OVERRUN field. */
#define SIMIF_EVENTS_T1_RX_OVERRUN_EVENTS_T1_RX_OVERRUN_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_T1_RX_OVERRUN_EVENTS_T1_RX_OVERRUN_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_T1_TX_ABORTED */
/* Description: T=1 card responded with S(ABORT request) */

/* Bit 0 : T=1 card responded with S(ABORT request) */
#define SIMIF_EVENTS_T1_TX_ABORTED_EVENTS_T1_TX_ABORTED_Pos (0UL) /*!< Position of EVENTS_T1_TX_ABORTED field. */
#define SIMIF_EVENTS_T1_TX_ABORTED_EVENTS_T1_TX_ABORTED_Msk (0x1UL << SIMIF_EVENTS_T1_TX_ABORTED_EVENTS_T1_TX_ABORTED_Pos) /*!< Bit mask of EVENTS_T1_TX_ABORTED field. */
#define SIMIF_EVENTS_T1_TX_ABORTED_EVENTS_T1_TX_ABORTED_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_T1_TX_ABORTED_EVENTS_T1_TX_ABORTED_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_T1_NON_I_BLOCK */
/* Description: T=1 unrecognized (S or R) block (with correct LRC) stored in RX_DATA */

