adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 20 : Enable or disable interrupt for event EDC_ERROR */
#define SIMIF_INTEN_EDC_ERROR_Pos (20UL) /*!< Position of EDC_ERROR field. */
#define SIMIF_INTEN_EDC_ERROR_Msk (0x1UL << SIMIF_INTEN_EDC_ERROR_Pos) /*!< Bit mask of EDC_ERROR field. */
#define SIMIF_INTEN_EDC_ERROR_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_EDC_ERROR_Enabled (1UL) /*!< Enable */

/* Bit 19 : Enable or disable interrupt for event T1_LEN_ERROR */
#define SIMIF_INTEN_T1_LEN_ERROR_Pos (19UL) /*!< Position of T1_LEN_ERROR field. */
#define SIMIF_INTEN_T1_LEN_ERROR_Msk (0x1UL << SIMIF_INTEN_T1_LEN_ERROR_Pos) /*!< Bit mask of T1_LEN_ERROR field. */
#define SIMIF_INTEN_T1_LEN_ERROR_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_T1_LEN_ERROR_Enabled (1UL) /*!< Enable */

/* Bit 18 : Enable or disable interrupt for event T1_NON_I_BLOCK */
#define SIMIF_INTEN_T1_NON_I_BLOCK_Pos (18UL) /*!< Position of T1_NON_I_BLOCK field. */
#define SIMIF_INTEN_T1_NON_I_BLOCK_Msk (0x1UL << SIMIF_INTEN_T1_NON_I_BLOCK_Pos) /*!< Bit mask of T1_NON_I_BLOCK field. */
#define SIMIF_INTEN_T1_NON_I_BLOCK_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_T1_NON_I_BLOCK_Enabled (1UL) /*!< Enable */

/* Bit 17 : Enable or disable interrupt for event T1_TX_ABORTED */
#define SIMIF_INTEN_T1_TX_ABORTED_Pos (17UL) /*!< Position of T1_TX_ABORTED field. */
#define SIMIF_INTEN_T1_TX_ABORTED_Msk (0x1UL << SIMIF_INTEN_T1_TX_ABORTED_Pos) /*!< Bit mask of T1_TX_ABORTED field. */
#define SIMIF_INTEN_T1_TX_ABORTED_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_T1_TX_ABORTED_Enabled (1UL) /*!< Enable */

/* Bit 16 : Enable or disable interrupt for event T1_RX_OVERRUN */
#define SIMIF_INTEN_T1_RX_OVERRUN_Pos (16UL) /*!< Position of T1_RX_OVERRUN field. */
#define SIMIF_INTEN_T1_RX_OVERRUN_Msk (0x1UL << SIMIF_INTEN_T1_RX_OVERRUN_Pos) /*!< Bit mask of T1_RX_OVERRUN field. */
#define SIMIF_INTEN_T1_RX_OVERRUN_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_T1_RX_OVERRUN_Enabled (1UL) /*!< Enable */

/* Bit 15 : Enable or disable interrupt for event RX_DATA_READY */
#define SIMIF_INTEN_RX_DATA_READY_Pos (15UL) /*!< Position of RX_DATA_READY field. */
#define SIMIF_INTEN_RX_DATA_READY_Msk (0x1UL << SIMIF_INTEN_RX_DATA_READY_Pos) /*!< Bit mask of RX_DATA_READY field. */
#define SIMIF_INTEN_RX_DATA_READY_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_RX_DATA_READY_Enabled (1UL) /*!< Enable */

/* Bit 14 : Enable or disable interrupt for event READY_TX */
#define SIMIF_INTEN_READY_TX_Pos (14UL) /*!< Position of READY_TX field. */
#define SIMIF_INTEN_READY_TX_Msk (0x1UL << SIMIF_INTEN_READY_TX_Pos) /*!< Bit mask of READY_TX field. */
#define SIMIF_INTEN_READY_TX_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_READY_TX_Enabled (1UL) /*!< Enable */

/* Bit 13 : Enable or disable interrupt for event ERROR */
#define SIMIF_INTEN_ERROR_Pos (13UL) /*!< Position of ERROR field. */
#define SIMIF_INTEN_ERROR_Msk (0x1UL << SIMIF_INTEN_ERROR_Pos) /*!< Bit mask of ERROR field. */
#define SIMIF_INTEN_ERROR_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_ERROR_Enabled (1UL) /*!< Enable */

/* Bit 12 : Enable or disable interrupt for event NINS */
#define SIMIF_INTEN_NINS_Pos (12UL) /*!< Position of NINS field. */
#define SIMIF_INTEN_NINS_Msk (0x1UL << SIMIF_INTEN_NINS_Pos) /*!< Bit mask of NINS field. */
#define SIMIF_INTEN_NINS_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_NINS_Enabled (1UL) /*!< Enable */

/* Bit 11 : Enable or disable interrupt for event INS */
#define SIMIF_INTEN_INS_Pos (11UL) /*!< Position of INS field. */
#define SIMIF_INTEN_INS_Msk (0x1UL << SIMIF_INTEN_INS_Pos) /*!< Bit mask of INS field. */
#define SIMIF_INTEN_INS_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_INS_Enabled (1UL) /*!< Enable */

/* Bit 10 : Enable or disable interrupt for event RESET */
#define SIMIF_INTEN_RESET_Pos (10UL) /*!< Position of RESET field. */
#define SIMIF_INTEN_RESET_Msk (0x1UL << SIMIF_INTEN_RESET_Pos) /*!< Bit mask of RESET field. */
#define SIMIF_INTEN_RESET_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_RESET_Enabled (1UL) /*!< Enable */

/* Bit 9 : Enable or disable interrupt for event SW1SW2 */
#define SIMIF_INTEN_SW1SW2_Pos (9UL) /*!< Position of SW1SW2 field. */
#define SIMIF_INTEN_SW1SW2_Msk (0x1UL << SIMIF_INTEN_SW1SW2_Pos) /*!< Bit mask of SW1SW2 field. */
#define SIMIF_INTEN_SW1SW2_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_SW1SW2_Enabled (1UL) /*!< Enable */

/* Bit 8 : Enable or disable interrupt for event BW_TIMEOUT */
#define SIMIF_INTEN_BW_TIMEOUT_Pos (8UL) /*!< Position of BW_TIMEOUT field. */
#define SIMIF_INTEN_BW_TIMEOUT_Msk (0x1UL << SIMIF_INTEN_BW_TIMEOUT_Pos) /*!< Bit mask of BW_TIMEOUT field. */
#define SIMIF_INTEN_BW_TIMEOUT_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_BW_TIMEOUT_Enabled (1UL) /*!< Enable */

/* Bit 7 : Enable or disable interrupt for event CW_TIMEOUT */
#define SIMIF_INTEN_CW_TIMEOUT_Pos (7UL) /*!< Position of CW_TIMEOUT field. */
#define SIMIF_INTEN_CW_TIMEOUT_Msk (0x1UL << SIMIF_INTEN_CW_TIMEOUT_Pos) /*!< Bit mask of CW_TIMEOUT field. */
#define SIMIF_INTEN_CW_TIMEOUT_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_CW_TIMEOUT_Enabled (1UL) /*!< Enable */

/* Bit 6 : Enable or disable interrupt for event ATR_TIMEOUT */
#define SIMIF_INTEN_ATR_TIMEOUT_Pos (6UL) /*!< Position of ATR_TIMEOUT field. */
#define SIMIF_INTEN_ATR_TIMEOUT_Msk (0x1UL << SIMIF_INTEN_ATR_TIMEOUT_Pos) /*!< Bit mask of ATR_TIMEOUT field. */
#define SIMIF_INTEN_ATR_TIMEOUT_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_ATR_TIMEOUT_Enabled (1UL) /*!< Enable */

/* Bit 5 : Enable or disable interrupt for event PARITY_ERROR */
#define SIMIF_INTEN_PARITY_ERROR_Pos (5UL) /*!< Position of PARITY_ERROR field. */
#define SIMIF_INTEN_PARITY_ERROR_Msk (0x1UL << SIMIF_INTEN_PARITY_ERROR_Pos) /*!< Bit mask of PARITY_ERROR field. */
#define SIMIF_INTEN_PARITY_ERROR_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_PARITY_ERROR_Enabled (1UL) /*!< Enable */

/* Bit 4 : Enable or disable interrupt for event INVALID_CONVENTION */
#define SIMIF_INTEN_INVALID_CONVENTION_Pos (4UL) /*!< Position of INVALID_CONVENTION field. */
#define SIMIF_INTEN_INVALID_CONVENTION_Msk (0x1UL << SIMIF_INTEN_INVALID_CONVENTION_Pos) /*!< Bit mask of INVALID_CONVENTION field. */
#define SIMIF_INTEN_INVALID_CONVENTION_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_INVALID_CONVENTION_Enabled (1UL) /*!< Enable */

/* Bit 3 : Enable or disable interrupt for event DMA_TX_DONE */
#define SIMIF_INTEN_DMA_TX_DONE_Pos (3UL) /*!< Position of DMA_TX_DONE field. */
#define SIMIF_INTEN_DMA_TX_DONE_Msk (0x1UL << SIMIF_INTEN_DMA_TX_DONE_Pos) /*!< Bit mask of DMA_TX_DONE field. */
#define SIMIF_INTEN_DMA_TX_DONE_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_DMA_TX_DONE_Enabled (1UL) /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event DMA_TX_STARTED */
#define SIMIF_INTEN_DMA_TX_STARTED_Pos (2UL) /*!< Position of DMA_TX_STARTED field. */
#define SIMIF_INTEN_DMA_TX_STARTED_Msk (0x1UL << SIMIF_INTEN_DMA_TX_STARTED_Pos) /*!< Bit mask of DMA_TX_STARTED field. */
#define SIMIF_INTEN_DMA_TX_STARTED_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_DMA_TX_STARTED_Enabled (1UL) /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event DMA_RX_DONE */
#define SIMIF_INTEN_DMA_RX_DONE_Pos (1UL) /*!< Position of DMA_RX_DONE field. */
#define SIMIF_INTEN_DMA_RX_DONE_Msk (0x1UL << SIMIF_INTEN_DMA_RX_DONE_Pos) /*!< Bit mask of DMA_RX_DONE field. */
#define SIMIF_INTEN_DMA_RX_DONE_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_DMA_RX_DONE_Enabled (1UL) /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event DMA_RX_STARTED */
#define SIMIF_INTEN_DMA_RX_STARTED_Pos (0UL) /*!< Position of DMA_RX_STARTED field. */
#define SIMIF_INTEN_DMA_RX_STARTED_Msk (0x1UL << SIMIF_INTEN_DMA_RX_STARTED_Pos) /*!< Bit mask of DMA_RX_STARTED field. */
#define SIMIF_INTEN_DMA_RX_STARTED_Disabled (0UL) /*!< Disable */
#define SIMIF_INTEN_DMA_RX_STARTED_Enabled (1UL) /*!< Enable */

/* Register: SIMIF_INTENSET */
/* Description: Enable interrupt */

/* Bit 23 : Write '1' to enable interrupt for event T1_RX_MORE */
#define SIMIF_INTENSET_T1_RX_MORE_Pos (23UL) /*!< Position of T1_RX_MORE field. */
#define SIMIF_INTENSET_T1_RX_MORE_Msk (0x1UL << SIMIF_INTENSET_T1_RX_MORE_Pos) /*!< Bit mask of T1_RX_MORE field. */
#define SIMIF_INTENSET_T1_RX_MORE_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_T1_RX_MORE_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_T1_RX_MORE_Set (1UL) /*!< Enable */

/* Bit 22 : Write '1' to enable interrupt for event ERROR_COUNT_MAX */
#define SIMIF_INTENSET_ERROR_COUNT_MAX_Pos (22UL) /*!< Position of ERROR_COUNT_MAX field. */
#define SIMIF_INTENSET_ERROR_COUNT_MAX_Msk (0x1UL << SIMIF_INTENSET_ERROR_COUNT_MAX_Pos) /*!< Bit mask of ERROR_COUNT_MAX field. */
#define SIMIF_INTENSET_ERROR_COUNT_MAX_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_ERROR_COUNT_MAX_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_ERROR_COUNT_MAX_Set (1UL) /*!< Enable */

/* Bit 21 : Write '1' to enable interrupt for event NAD_ERROR */
#define SIMIF_INTENSET_NAD_ERROR_Pos (21UL) /*!< Position of NAD_ERROR field. */
#define SIMIF_INTENSET_NAD_ERROR_Msk (0x1UL << SIMIF_INTENSET_NAD_ERROR_Pos) /*!< Bit mask of NAD_ERROR field. */
#define SIMIF_INTENSET_NAD_ERROR_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_NAD_ERROR_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_NAD_ERROR_Set (1UL) /*!< Enable */

/* Bit 20 : Write '1' to enable interrupt for event EDC_ERROR */
#define SIMIF_INTENSET_EDC_ERROR_Pos (20UL) /*!< Position of EDC_ERROR field. */
#define SIMIF_INTENSET_EDC_ERROR_Msk (0x1UL << SIMIF_INTENSET_EDC_ERROR_Pos) /*!< Bit mask of EDC_ERROR field. */
#define SIMIF_INTENSET_EDC_ERROR_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_EDC_ERROR_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_EDC_ERROR_Set (1UL) /*!< Enable */

