adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 19 : Write '1' to enable interrupt for event T1_LEN_ERROR */
#define SIMIF_INTENSET_T1_LEN_ERROR_Pos (19UL) /*!< Position of T1_LEN_ERROR field. */
#define SIMIF_INTENSET_T1_LEN_ERROR_Msk (0x1UL << SIMIF_INTENSET_T1_LEN_ERROR_Pos) /*!< Bit mask of T1_LEN_ERROR field. */
#define SIMIF_INTENSET_T1_LEN_ERROR_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_T1_LEN_ERROR_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_T1_LEN_ERROR_Set (1UL) /*!< Enable */

/* Bit 18 : Write '1' to enable interrupt for event T1_NON_I_BLOCK */
#define SIMIF_INTENSET_T1_NON_I_BLOCK_Pos (18UL) /*!< Position of T1_NON_I_BLOCK field. */
#define SIMIF_INTENSET_T1_NON_I_BLOCK_Msk (0x1UL << SIMIF_INTENSET_T1_NON_I_BLOCK_Pos) /*!< Bit mask of T1_NON_I_BLOCK field. */
#define SIMIF_INTENSET_T1_NON_I_BLOCK_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_T1_NON_I_BLOCK_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_T1_NON_I_BLOCK_Set (1UL) /*!< Enable */

/* Bit 17 : Write '1' to enable interrupt for event T1_TX_ABORTED */
#define SIMIF_INTENSET_T1_TX_ABORTED_Pos (17UL) /*!< Position of T1_TX_ABORTED field. */
#define SIMIF_INTENSET_T1_TX_ABORTED_Msk (0x1UL << SIMIF_INTENSET_T1_TX_ABORTED_Pos) /*!< Bit mask of T1_TX_ABORTED field. */
#define SIMIF_INTENSET_T1_TX_ABORTED_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_T1_TX_ABORTED_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_T1_TX_ABORTED_Set (1UL) /*!< Enable */

/* Bit 16 : Write '1' to enable interrupt for event T1_RX_OVERRUN */
#define SIMIF_INTENSET_T1_RX_OVERRUN_Pos (16UL) /*!< Position of T1_RX_OVERRUN field. */
#define SIMIF_INTENSET_T1_RX_OVERRUN_Msk (0x1UL << SIMIF_INTENSET_T1_RX_OVERRUN_Pos) /*!< Bit mask of T1_RX_OVERRUN field. */
#define SIMIF_INTENSET_T1_RX_OVERRUN_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_T1_RX_OVERRUN_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_T1_RX_OVERRUN_Set (1UL) /*!< Enable */

/* Bit 15 : Write '1' to enable interrupt for event RX_DATA_READY */
#define SIMIF_INTENSET_RX_DATA_READY_Pos (15UL) /*!< Position of RX_DATA_READY field. */
#define SIMIF_INTENSET_RX_DATA_READY_Msk (0x1UL << SIMIF_INTENSET_RX_DATA_READY_Pos) /*!< Bit mask of RX_DATA_READY field. */
#define SIMIF_INTENSET_RX_DATA_READY_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_RX_DATA_READY_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_RX_DATA_READY_Set (1UL) /*!< Enable */

/* Bit 14 : Write '1' to enable interrupt for event READY_TX */
#define SIMIF_INTENSET_READY_TX_Pos (14UL) /*!< Position of READY_TX field. */
#define SIMIF_INTENSET_READY_TX_Msk (0x1UL << SIMIF_INTENSET_READY_TX_Pos) /*!< Bit mask of READY_TX field. */
#define SIMIF_INTENSET_READY_TX_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_READY_TX_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_READY_TX_Set (1UL) /*!< Enable */

/* Bit 13 : Write '1' to enable interrupt for event ERROR */
#define SIMIF_INTENSET_ERROR_Pos (13UL) /*!< Position of ERROR field. */
#define SIMIF_INTENSET_ERROR_Msk (0x1UL << SIMIF_INTENSET_ERROR_Pos) /*!< Bit mask of ERROR field. */
#define SIMIF_INTENSET_ERROR_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_ERROR_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_ERROR_Set (1UL) /*!< Enable */

/* Bit 12 : Write '1' to enable interrupt for event NINS */
#define SIMIF_INTENSET_NINS_Pos (12UL) /*!< Position of NINS field. */
#define SIMIF_INTENSET_NINS_Msk (0x1UL << SIMIF_INTENSET_NINS_Pos) /*!< Bit mask of NINS field. */
#define SIMIF_INTENSET_NINS_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_NINS_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_NINS_Set (1UL) /*!< Enable */

/* Bit 11 : Write '1' to enable interrupt for event INS */
#define SIMIF_INTENSET_INS_Pos (11UL) /*!< Position of INS field. */
#define SIMIF_INTENSET_INS_Msk (0x1UL << SIMIF_INTENSET_INS_Pos) /*!< Bit mask of INS field. */
#define SIMIF_INTENSET_INS_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_INS_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_INS_Set (1UL) /*!< Enable */

/* Bit 10 : Write '1' to enable interrupt for event RESET */
#define SIMIF_INTENSET_RESET_Pos (10UL) /*!< Position of RESET field. */
#define SIMIF_INTENSET_RESET_Msk (0x1UL << SIMIF_INTENSET_RESET_Pos) /*!< Bit mask of RESET field. */
#define SIMIF_INTENSET_RESET_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_RESET_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_RESET_Set (1UL) /*!< Enable */

/* Bit 9 : Write '1' to enable interrupt for event SW1SW2 */
#define SIMIF_INTENSET_SW1SW2_Pos (9UL) /*!< Position of SW1SW2 field. */
#define SIMIF_INTENSET_SW1SW2_Msk (0x1UL << SIMIF_INTENSET_SW1SW2_Pos) /*!< Bit mask of SW1SW2 field. */
#define SIMIF_INTENSET_SW1SW2_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_SW1SW2_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_SW1SW2_Set (1UL) /*!< Enable */

/* Bit 8 : Write '1' to enable interrupt for event BW_TIMEOUT */
#define SIMIF_INTENSET_BW_TIMEOUT_Pos (8UL) /*!< Position of BW_TIMEOUT field. */
#define SIMIF_INTENSET_BW_TIMEOUT_Msk (0x1UL << SIMIF_INTENSET_BW_TIMEOUT_Pos) /*!< Bit mask of BW_TIMEOUT field. */
#define SIMIF_INTENSET_BW_TIMEOUT_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_BW_TIMEOUT_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_BW_TIMEOUT_Set (1UL) /*!< Enable */

/* Bit 7 : Write '1' to enable interrupt for event CW_TIMEOUT */
#define SIMIF_INTENSET_CW_TIMEOUT_Pos (7UL) /*!< Position of CW_TIMEOUT field. */
#define SIMIF_INTENSET_CW_TIMEOUT_Msk (0x1UL << SIMIF_INTENSET_CW_TIMEOUT_Pos) /*!< Bit mask of CW_TIMEOUT field. */
#define SIMIF_INTENSET_CW_TIMEOUT_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_CW_TIMEOUT_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_CW_TIMEOUT_Set (1UL) /*!< Enable */

/* Bit 6 : Write '1' to enable interrupt for event ATR_TIMEOUT */
#define SIMIF_INTENSET_ATR_TIMEOUT_Pos (6UL) /*!< Position of ATR_TIMEOUT field. */
#define SIMIF_INTENSET_ATR_TIMEOUT_Msk (0x1UL << SIMIF_INTENSET_ATR_TIMEOUT_Pos) /*!< Bit mask of ATR_TIMEOUT field. */
#define SIMIF_INTENSET_ATR_TIMEOUT_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_ATR_TIMEOUT_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_ATR_TIMEOUT_Set (1UL) /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event PARITY_ERROR */
#define SIMIF_INTENSET_PARITY_ERROR_Pos (5UL) /*!< Position of PARITY_ERROR field. */
#define SIMIF_INTENSET_PARITY_ERROR_Msk (0x1UL << SIMIF_INTENSET_PARITY_ERROR_Pos) /*!< Bit mask of PARITY_ERROR field. */
#define SIMIF_INTENSET_PARITY_ERROR_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_PARITY_ERROR_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_PARITY_ERROR_Set (1UL) /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event INVALID_CONVENTION */
#define SIMIF_INTENSET_INVALID_CONVENTION_Pos (4UL) /*!< Position of INVALID_CONVENTION field. */
#define SIMIF_INTENSET_INVALID_CONVENTION_Msk (0x1UL << SIMIF_INTENSET_INVALID_CONVENTION_Pos) /*!< Bit mask of INVALID_CONVENTION field. */
#define SIMIF_INTENSET_INVALID_CONVENTION_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_INVALID_CONVENTION_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_INVALID_CONVENTION_Set (1UL) /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event DMA_TX_DONE */
#define SIMIF_INTENSET_DMA_TX_DONE_Pos (3UL) /*!< Position of DMA_TX_DONE field. */
#define SIMIF_INTENSET_DMA_TX_DONE_Msk (0x1UL << SIMIF_INTENSET_DMA_TX_DONE_Pos) /*!< Bit mask of DMA_TX_DONE field. */
#define SIMIF_INTENSET_DMA_TX_DONE_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_DMA_TX_DONE_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_DMA_TX_DONE_Set (1UL) /*!< Enable */

