adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 2 : Write '1' to enable interrupt for event DMA_TX_STARTED */
#define SIMIF_INTENSET_DMA_TX_STARTED_Pos (2UL) /*!< Position of DMA_TX_STARTED field. */
#define SIMIF_INTENSET_DMA_TX_STARTED_Msk (0x1UL << SIMIF_INTENSET_DMA_TX_STARTED_Pos) /*!< Bit mask of DMA_TX_STARTED field. */
#define SIMIF_INTENSET_DMA_TX_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_DMA_TX_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_DMA_TX_STARTED_Set (1UL) /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event DMA_RX_DONE */
#define SIMIF_INTENSET_DMA_RX_DONE_Pos (1UL) /*!< Position of DMA_RX_DONE field. */
#define SIMIF_INTENSET_DMA_RX_DONE_Msk (0x1UL << SIMIF_INTENSET_DMA_RX_DONE_Pos) /*!< Bit mask of DMA_RX_DONE field. */
#define SIMIF_INTENSET_DMA_RX_DONE_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_DMA_RX_DONE_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_DMA_RX_DONE_Set (1UL) /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event DMA_RX_STARTED */
#define SIMIF_INTENSET_DMA_RX_STARTED_Pos (0UL) /*!< Position of DMA_RX_STARTED field. */
#define SIMIF_INTENSET_DMA_RX_STARTED_Msk (0x1UL << SIMIF_INTENSET_DMA_RX_STARTED_Pos) /*!< Bit mask of DMA_RX_STARTED field. */
#define SIMIF_INTENSET_DMA_RX_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENSET_DMA_RX_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENSET_DMA_RX_STARTED_Set (1UL) /*!< Enable */

/* Register: SIMIF_INTENCLR */
/* Description: Disable interrupt */

/* Bit 23 : Write '1' to disable interrupt for event T1_RX_MORE */
#define SIMIF_INTENCLR_T1_RX_MORE_Pos (23UL) /*!< Position of T1_RX_MORE field. */
#define SIMIF_INTENCLR_T1_RX_MORE_Msk (0x1UL << SIMIF_INTENCLR_T1_RX_MORE_Pos) /*!< Bit mask of T1_RX_MORE field. */
#define SIMIF_INTENCLR_T1_RX_MORE_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_T1_RX_MORE_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_T1_RX_MORE_Clear (1UL) /*!< Disable */

/* Bit 22 : Write '1' to disable interrupt for event ERROR_COUNT_MAX */
#define SIMIF_INTENCLR_ERROR_COUNT_MAX_Pos (22UL) /*!< Position of ERROR_COUNT_MAX field. */
#define SIMIF_INTENCLR_ERROR_COUNT_MAX_Msk (0x1UL << SIMIF_INTENCLR_ERROR_COUNT_MAX_Pos) /*!< Bit mask of ERROR_COUNT_MAX field. */
#define SIMIF_INTENCLR_ERROR_COUNT_MAX_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_ERROR_COUNT_MAX_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_ERROR_COUNT_MAX_Clear (1UL) /*!< Disable */

/* Bit 21 : Write '1' to disable interrupt for event NAD_ERROR */
#define SIMIF_INTENCLR_NAD_ERROR_Pos (21UL) /*!< Position of NAD_ERROR field. */
#define SIMIF_INTENCLR_NAD_ERROR_Msk (0x1UL << SIMIF_INTENCLR_NAD_ERROR_Pos) /*!< Bit mask of NAD_ERROR field. */
#define SIMIF_INTENCLR_NAD_ERROR_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_NAD_ERROR_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_NAD_ERROR_Clear (1UL) /*!< Disable */

/* Bit 20 : Write '1' to disable interrupt for event EDC_ERROR */
#define SIMIF_INTENCLR_EDC_ERROR_Pos (20UL) /*!< Position of EDC_ERROR field. */
#define SIMIF_INTENCLR_EDC_ERROR_Msk (0x1UL << SIMIF_INTENCLR_EDC_ERROR_Pos) /*!< Bit mask of EDC_ERROR field. */
#define SIMIF_INTENCLR_EDC_ERROR_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_EDC_ERROR_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_EDC_ERROR_Clear (1UL) /*!< Disable */

/* Bit 19 : Write '1' to disable interrupt for event T1_LEN_ERROR */
#define SIMIF_INTENCLR_T1_LEN_ERROR_Pos (19UL) /*!< Position of T1_LEN_ERROR field. */
#define SIMIF_INTENCLR_T1_LEN_ERROR_Msk (0x1UL << SIMIF_INTENCLR_T1_LEN_ERROR_Pos) /*!< Bit mask of T1_LEN_ERROR field. */
#define SIMIF_INTENCLR_T1_LEN_ERROR_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_T1_LEN_ERROR_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_T1_LEN_ERROR_Clear (1UL) /*!< Disable */

/* Bit 18 : Write '1' to disable interrupt for event T1_NON_I_BLOCK */
#define SIMIF_INTENCLR_T1_NON_I_BLOCK_Pos (18UL) /*!< Position of T1_NON_I_BLOCK field. */
#define SIMIF_INTENCLR_T1_NON_I_BLOCK_Msk (0x1UL << SIMIF_INTENCLR_T1_NON_I_BLOCK_Pos) /*!< Bit mask of T1_NON_I_BLOCK field. */
#define SIMIF_INTENCLR_T1_NON_I_BLOCK_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_T1_NON_I_BLOCK_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_T1_NON_I_BLOCK_Clear (1UL) /*!< Disable */

/* Bit 17 : Write '1' to disable interrupt for event T1_TX_ABORTED */
#define SIMIF_INTENCLR_T1_TX_ABORTED_Pos (17UL) /*!< Position of T1_TX_ABORTED field. */
#define SIMIF_INTENCLR_T1_TX_ABORTED_Msk (0x1UL << SIMIF_INTENCLR_T1_TX_ABORTED_Pos) /*!< Bit mask of T1_TX_ABORTED field. */
#define SIMIF_INTENCLR_T1_TX_ABORTED_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_T1_TX_ABORTED_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_T1_TX_ABORTED_Clear (1UL) /*!< Disable */

/* Bit 16 : Write '1' to disable interrupt for event T1_RX_OVERRUN */
#define SIMIF_INTENCLR_T1_RX_OVERRUN_Pos (16UL) /*!< Position of T1_RX_OVERRUN field. */
#define SIMIF_INTENCLR_T1_RX_OVERRUN_Msk (0x1UL << SIMIF_INTENCLR_T1_RX_OVERRUN_Pos) /*!< Bit mask of T1_RX_OVERRUN field. */
#define SIMIF_INTENCLR_T1_RX_OVERRUN_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_T1_RX_OVERRUN_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_T1_RX_OVERRUN_Clear (1UL) /*!< Disable */

/* Bit 15 : Write '1' to disable interrupt for event RX_DATA_READY */
#define SIMIF_INTENCLR_RX_DATA_READY_Pos (15UL) /*!< Position of RX_DATA_READY field. */
#define SIMIF_INTENCLR_RX_DATA_READY_Msk (0x1UL << SIMIF_INTENCLR_RX_DATA_READY_Pos) /*!< Bit mask of RX_DATA_READY field. */
#define SIMIF_INTENCLR_RX_DATA_READY_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_RX_DATA_READY_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_RX_DATA_READY_Clear (1UL) /*!< Disable */

/* Bit 14 : Write '1' to disable interrupt for event READY_TX */
#define SIMIF_INTENCLR_READY_TX_Pos (14UL) /*!< Position of READY_TX field. */
#define SIMIF_INTENCLR_READY_TX_Msk (0x1UL << SIMIF_INTENCLR_READY_TX_Pos) /*!< Bit mask of READY_TX field. */
#define SIMIF_INTENCLR_READY_TX_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_READY_TX_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_READY_TX_Clear (1UL) /*!< Disable */

