adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 13 : Write '1' to disable interrupt for event ERROR */
#define SIMIF_INTENCLR_ERROR_Pos (13UL) /*!< Position of ERROR field. */
#define SIMIF_INTENCLR_ERROR_Msk (0x1UL << SIMIF_INTENCLR_ERROR_Pos) /*!< Bit mask of ERROR field. */
#define SIMIF_INTENCLR_ERROR_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_ERROR_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_ERROR_Clear (1UL) /*!< Disable */

/* Bit 12 : Write '1' to disable interrupt for event NINS */
#define SIMIF_INTENCLR_NINS_Pos (12UL) /*!< Position of NINS field. */
#define SIMIF_INTENCLR_NINS_Msk (0x1UL << SIMIF_INTENCLR_NINS_Pos) /*!< Bit mask of NINS field. */
#define SIMIF_INTENCLR_NINS_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_NINS_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_NINS_Clear (1UL) /*!< Disable */

/* Bit 11 : Write '1' to disable interrupt for event INS */
#define SIMIF_INTENCLR_INS_Pos (11UL) /*!< Position of INS field. */
#define SIMIF_INTENCLR_INS_Msk (0x1UL << SIMIF_INTENCLR_INS_Pos) /*!< Bit mask of INS field. */
#define SIMIF_INTENCLR_INS_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_INS_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_INS_Clear (1UL) /*!< Disable */

/* Bit 10 : Write '1' to disable interrupt for event RESET */
#define SIMIF_INTENCLR_RESET_Pos (10UL) /*!< Position of RESET field. */
#define SIMIF_INTENCLR_RESET_Msk (0x1UL << SIMIF_INTENCLR_RESET_Pos) /*!< Bit mask of RESET field. */
#define SIMIF_INTENCLR_RESET_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_RESET_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_RESET_Clear (1UL) /*!< Disable */

/* Bit 9 : Write '1' to disable interrupt for event SW1SW2 */
#define SIMIF_INTENCLR_SW1SW2_Pos (9UL) /*!< Position of SW1SW2 field. */
#define SIMIF_INTENCLR_SW1SW2_Msk (0x1UL << SIMIF_INTENCLR_SW1SW2_Pos) /*!< Bit mask of SW1SW2 field. */
#define SIMIF_INTENCLR_SW1SW2_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_SW1SW2_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_SW1SW2_Clear (1UL) /*!< Disable */

/* Bit 8 : Write '1' to disable interrupt for event BW_TIMEOUT */
#define SIMIF_INTENCLR_BW_TIMEOUT_Pos (8UL) /*!< Position of BW_TIMEOUT field. */
#define SIMIF_INTENCLR_BW_TIMEOUT_Msk (0x1UL << SIMIF_INTENCLR_BW_TIMEOUT_Pos) /*!< Bit mask of BW_TIMEOUT field. */
#define SIMIF_INTENCLR_BW_TIMEOUT_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_BW_TIMEOUT_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_BW_TIMEOUT_Clear (1UL) /*!< Disable */

/* Bit 7 : Write '1' to disable interrupt for event CW_TIMEOUT */
#define SIMIF_INTENCLR_CW_TIMEOUT_Pos (7UL) /*!< Position of CW_TIMEOUT field. */
#define SIMIF_INTENCLR_CW_TIMEOUT_Msk (0x1UL << SIMIF_INTENCLR_CW_TIMEOUT_Pos) /*!< Bit mask of CW_TIMEOUT field. */
#define SIMIF_INTENCLR_CW_TIMEOUT_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_CW_TIMEOUT_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_CW_TIMEOUT_Clear (1UL) /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event ATR_TIMEOUT */
#define SIMIF_INTENCLR_ATR_TIMEOUT_Pos (6UL) /*!< Position of ATR_TIMEOUT field. */
#define SIMIF_INTENCLR_ATR_TIMEOUT_Msk (0x1UL << SIMIF_INTENCLR_ATR_TIMEOUT_Pos) /*!< Bit mask of ATR_TIMEOUT field. */
#define SIMIF_INTENCLR_ATR_TIMEOUT_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_ATR_TIMEOUT_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_ATR_TIMEOUT_Clear (1UL) /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event PARITY_ERROR */
#define SIMIF_INTENCLR_PARITY_ERROR_Pos (5UL) /*!< Position of PARITY_ERROR field. */
#define SIMIF_INTENCLR_PARITY_ERROR_Msk (0x1UL << SIMIF_INTENCLR_PARITY_ERROR_Pos) /*!< Bit mask of PARITY_ERROR field. */
#define SIMIF_INTENCLR_PARITY_ERROR_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_PARITY_ERROR_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_PARITY_ERROR_Clear (1UL) /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event INVALID_CONVENTION */
#define SIMIF_INTENCLR_INVALID_CONVENTION_Pos (4UL) /*!< Position of INVALID_CONVENTION field. */
#define SIMIF_INTENCLR_INVALID_CONVENTION_Msk (0x1UL << SIMIF_INTENCLR_INVALID_CONVENTION_Pos) /*!< Bit mask of INVALID_CONVENTION field. */
#define SIMIF_INTENCLR_INVALID_CONVENTION_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_INVALID_CONVENTION_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_INVALID_CONVENTION_Clear (1UL) /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event DMA_TX_DONE */
#define SIMIF_INTENCLR_DMA_TX_DONE_Pos (3UL) /*!< Position of DMA_TX_DONE field. */
#define SIMIF_INTENCLR_DMA_TX_DONE_Msk (0x1UL << SIMIF_INTENCLR_DMA_TX_DONE_Pos) /*!< Bit mask of DMA_TX_DONE field. */
#define SIMIF_INTENCLR_DMA_TX_DONE_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_DMA_TX_DONE_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_DMA_TX_DONE_Clear (1UL) /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event DMA_TX_STARTED */
#define SIMIF_INTENCLR_DMA_TX_STARTED_Pos (2UL) /*!< Position of DMA_TX_STARTED field. */
#define SIMIF_INTENCLR_DMA_TX_STARTED_Msk (0x1UL << SIMIF_INTENCLR_DMA_TX_STARTED_Pos) /*!< Bit mask of DMA_TX_STARTED field. */
#define SIMIF_INTENCLR_DMA_TX_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_DMA_TX_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_DMA_TX_STARTED_Clear (1UL) /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event DMA_RX_DONE */
#define SIMIF_INTENCLR_DMA_RX_DONE_Pos (1UL) /*!< Position of DMA_RX_DONE field. */
#define SIMIF_INTENCLR_DMA_RX_DONE_Msk (0x1UL << SIMIF_INTENCLR_DMA_RX_DONE_Pos) /*!< Bit mask of DMA_RX_DONE field. */
#define SIMIF_INTENCLR_DMA_RX_DONE_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_DMA_RX_DONE_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_DMA_RX_DONE_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event DMA_RX_STARTED */
#define SIMIF_INTENCLR_DMA_RX_STARTED_Pos (0UL) /*!< Position of DMA_RX_STARTED field. */
#define SIMIF_INTENCLR_DMA_RX_STARTED_Msk (0x1UL << SIMIF_INTENCLR_DMA_RX_STARTED_Pos) /*!< Bit mask of DMA_RX_STARTED field. */
#define SIMIF_INTENCLR_DMA_RX_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define SIMIF_INTENCLR_DMA_RX_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define SIMIF_INTENCLR_DMA_RX_STARTED_Clear (1UL) /*!< Disable */

