adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 8 : Read pending status of interrupt for event BW_TIMEOUT */
#define SIMIF_INTPEND_BW_TIMEOUT_Pos (8UL) /*!< Position of BW_TIMEOUT field. */
#define SIMIF_INTPEND_BW_TIMEOUT_Msk (0x1UL << SIMIF_INTPEND_BW_TIMEOUT_Pos) /*!< Bit mask of BW_TIMEOUT field. */
#define SIMIF_INTPEND_BW_TIMEOUT_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_BW_TIMEOUT_Pending (1UL) /*!< Read: Pending */

/* Bit 7 : Read pending status of interrupt for event CW_TIMEOUT */
#define SIMIF_INTPEND_CW_TIMEOUT_Pos (7UL) /*!< Position of CW_TIMEOUT field. */
#define SIMIF_INTPEND_CW_TIMEOUT_Msk (0x1UL << SIMIF_INTPEND_CW_TIMEOUT_Pos) /*!< Bit mask of CW_TIMEOUT field. */
#define SIMIF_INTPEND_CW_TIMEOUT_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_CW_TIMEOUT_Pending (1UL) /*!< Read: Pending */

/* Bit 6 : Read pending status of interrupt for event ATR_TIMEOUT */
#define SIMIF_INTPEND_ATR_TIMEOUT_Pos (6UL) /*!< Position of ATR_TIMEOUT field. */
#define SIMIF_INTPEND_ATR_TIMEOUT_Msk (0x1UL << SIMIF_INTPEND_ATR_TIMEOUT_Pos) /*!< Bit mask of ATR_TIMEOUT field. */
#define SIMIF_INTPEND_ATR_TIMEOUT_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_ATR_TIMEOUT_Pending (1UL) /*!< Read: Pending */

/* Bit 5 : Read pending status of interrupt for event PARITY_ERROR */
#define SIMIF_INTPEND_PARITY_ERROR_Pos (5UL) /*!< Position of PARITY_ERROR field. */
#define SIMIF_INTPEND_PARITY_ERROR_Msk (0x1UL << SIMIF_INTPEND_PARITY_ERROR_Pos) /*!< Bit mask of PARITY_ERROR field. */
#define SIMIF_INTPEND_PARITY_ERROR_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_PARITY_ERROR_Pending (1UL) /*!< Read: Pending */

/* Bit 4 : Read pending status of interrupt for event INVALID_CONVENTION */
#define SIMIF_INTPEND_INVALID_CONVENTION_Pos (4UL) /*!< Position of INVALID_CONVENTION field. */
#define SIMIF_INTPEND_INVALID_CONVENTION_Msk (0x1UL << SIMIF_INTPEND_INVALID_CONVENTION_Pos) /*!< Bit mask of INVALID_CONVENTION field. */
#define SIMIF_INTPEND_INVALID_CONVENTION_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_INVALID_CONVENTION_Pending (1UL) /*!< Read: Pending */

/* Bit 3 : Read pending status of interrupt for event DMA_TX_DONE */
#define SIMIF_INTPEND_DMA_TX_DONE_Pos (3UL) /*!< Position of DMA_TX_DONE field. */
#define SIMIF_INTPEND_DMA_TX_DONE_Msk (0x1UL << SIMIF_INTPEND_DMA_TX_DONE_Pos) /*!< Bit mask of DMA_TX_DONE field. */
#define SIMIF_INTPEND_DMA_TX_DONE_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_DMA_TX_DONE_Pending (1UL) /*!< Read: Pending */

/* Bit 2 : Read pending status of interrupt for event DMA_TX_STARTED */
#define SIMIF_INTPEND_DMA_TX_STARTED_Pos (2UL) /*!< Position of DMA_TX_STARTED field. */
#define SIMIF_INTPEND_DMA_TX_STARTED_Msk (0x1UL << SIMIF_INTPEND_DMA_TX_STARTED_Pos) /*!< Bit mask of DMA_TX_STARTED field. */
#define SIMIF_INTPEND_DMA_TX_STARTED_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_DMA_TX_STARTED_Pending (1UL) /*!< Read: Pending */

/* Bit 1 : Read pending status of interrupt for event DMA_RX_DONE */
#define SIMIF_INTPEND_DMA_RX_DONE_Pos (1UL) /*!< Position of DMA_RX_DONE field. */
#define SIMIF_INTPEND_DMA_RX_DONE_Msk (0x1UL << SIMIF_INTPEND_DMA_RX_DONE_Pos) /*!< Bit mask of DMA_RX_DONE field. */
#define SIMIF_INTPEND_DMA_RX_DONE_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_DMA_RX_DONE_Pending (1UL) /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event DMA_RX_STARTED */
#define SIMIF_INTPEND_DMA_RX_STARTED_Pos (0UL) /*!< Position of DMA_RX_STARTED field. */
#define SIMIF_INTPEND_DMA_RX_STARTED_Msk (0x1UL << SIMIF_INTPEND_DMA_RX_STARTED_Pos) /*!< Bit mask of DMA_RX_STARTED field. */
#define SIMIF_INTPEND_DMA_RX_STARTED_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_DMA_RX_STARTED_Pending (1UL) /*!< Read: Pending */

/* Register: SIMIF_SW1SW2 */
/* Description: Sw1 and Sw2 bytes received from Sim card in T=1 mode */

/* Bits 15..8 : Sw2 data byte received */
#define SIMIF_SW1SW2_SW2_Pos (8UL) /*!< Position of SW2 field. */
#define SIMIF_SW1SW2_SW2_Msk (0xFFUL << SIMIF_SW1SW2_SW2_Pos) /*!< Bit mask of SW2 field. */

/* Bits 7..0 : Sw1 data byte received */
#define SIMIF_SW1SW2_SW1_Pos (0UL) /*!< Position of SW1 field. */
#define SIMIF_SW1SW2_SW1_Msk (0xFFUL << SIMIF_SW1SW2_SW1_Pos) /*!< Bit mask of SW1 field. */

/* Register: SIMIF_CONVENTION */
/* Description: Data convention used in traffic between controller and SIM card */

/* Bit 0 : Data convention between controller and SIM card */
#define SIMIF_CONVENTION_DATACONVENTION_Pos (0UL) /*!< Position of DATACONVENTION field. */
#define SIMIF_CONVENTION_DATACONVENTION_Msk (0x1UL << SIMIF_CONVENTION_DATACONVENTION_Pos) /*!< Bit mask of DATACONVENTION field. */
#define SIMIF_CONVENTION_DATACONVENTION_Direct (0UL) /*!< Direct convention: 1 = High, LSB first */
#define SIMIF_CONVENTION_DATACONVENTION_Inverse (1UL) /*!< Inverse convention: 1 = Low, MSB first */

/* Register: SIMIF_LRCOUT */
/* Description: Latest generated LRC value */

/* Bits 7..0 : Latest generated LRC value */
#define SIMIF_LRCOUT_LRCOUT_Pos (0UL) /*!< Position of LRCOUT field. */
#define SIMIF_LRCOUT_LRCOUT_Msk (0xFFUL << SIMIF_LRCOUT_LRCOUT_Pos) /*!< Bit mask of LRCOUT field. */

/* Register: SIMIF_RXDATA */
/* Description: NonDMA received data */

/* Bits 7..0 : NonDMA received data or Rx data of T=1 S block if RxBufferLength = 3 */
#define SIMIF_RXDATA_RXDATA_Pos (0UL) /*!< Position of RXDATA field. */
#define SIMIF_RXDATA_RXDATA_Msk (0xFFUL << SIMIF_RXDATA_RXDATA_Pos) /*!< Bit mask of RXDATA field. */

/* Register: SIMIF_T0SWXCOUNT */
/* Description: Number of SWx bytes received after T=0 Rx DMA finished */

/* Bits 1..0 : Number of SWx bytes received after T=0 Rx DMA finished */
#define SIMIF_T0SWXCOUNT_T0SWXCOUNT_Pos (0UL) /*!< Position of T0SWXCOUNT field. */
#define SIMIF_T0SWXCOUNT_T0SWXCOUNT_Msk (0x3UL << SIMIF_T0SWXCOUNT_T0SWXCOUNT_Pos) /*!< Bit mask of T0SWXCOUNT field. */

/* Register: SIMIF_CLKRATE */
/* Description: Divider value for setting the clock rate to the SIM card. */

/* Bits 9..0 : Divider for setting the clock frequency to the SIM card clock (clock  = input clock / ClockRate */
#define SIMIF_CLKRATE_CLOCKRATE_Pos (0UL) /*!< Position of CLOCKRATE field. */
#define SIMIF_CLKRATE_CLOCKRATE_Msk (0x3FFUL << SIMIF_CLKRATE_CLOCKRATE_Pos) /*!< Bit mask of CLOCKRATE field. */

/* Register: SIMIF_BAUDRATE */
/* Description: Divider value for setting the baud rate to the SIM card. */

