adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bits 9..0 : Divider for setting the baud rate to the SIM card.(Baud rate  = Sim card clock/BaudRate). */
#define SIMIF_BAUDRATE_BAUDRATE_Pos (0UL) /*!< Position of BAUDRATE field. */
#define SIMIF_BAUDRATE_BAUDRATE_Msk (0x3FFUL << SIMIF_BAUDRATE_BAUDRATE_Pos) /*!< Bit mask of BAUDRATE field. */

/* Register: SIMIF_CHARACTERGUARDTIME */
/* Description: Character Guard time */

/* Bits 7..0 : Guard time from leading edge of the character to the leading edge of the next character in ETU */
#define SIMIF_CHARACTERGUARDTIME_CHARACTERGUARDTIME_Pos (0UL) /*!< Position of CHARACTERGUARDTIME field. */
#define SIMIF_CHARACTERGUARDTIME_CHARACTERGUARDTIME_Msk (0xFFUL << SIMIF_CHARACTERGUARDTIME_CHARACTERGUARDTIME_Pos) /*!< Bit mask of CHARACTERGUARDTIME field. */

/* Register: SIMIF_CHARACTERWAITTIME */
/* Description: Character Wait time */

/* Bits 7..0 : T=1 character Rx wait time in ETU */
#define SIMIF_CHARACTERWAITTIME_CHARACTERWAITTIME_Pos (0UL) /*!< Position of CHARACTERWAITTIME field. */
#define SIMIF_CHARACTERWAITTIME_CHARACTERWAITTIME_Msk (0xFFUL << SIMIF_CHARACTERWAITTIME_CHARACTERWAITTIME_Pos) /*!< Bit mask of CHARACTERWAITTIME field. */

/* Register: SIMIF_BLOCKWAITTIME */
/* Description: Block Wait time */

/* Bits 15..0 : Block wait time in ETU, default 9600 */
#define SIMIF_BLOCKWAITTIME_BLOCKWAITTIME_Pos (0UL) /*!< Position of BLOCKWAITTIME field. */
#define SIMIF_BLOCKWAITTIME_BLOCKWAITTIME_Msk (0xFFFFUL << SIMIF_BLOCKWAITTIME_BLOCKWAITTIME_Pos) /*!< Bit mask of BLOCKWAITTIME field. */

/* Register: SIMIF_PROTOCOL */
/* Description: Protocol selection */

/* Bit 0 : Protocol selection 0: T=0, 1: T=1 */
#define SIMIF_PROTOCOL_PROTOCOL_Pos (0UL) /*!< Position of PROTOCOL field. */
#define SIMIF_PROTOCOL_PROTOCOL_Msk (0x1UL << SIMIF_PROTOCOL_PROTOCOL_Pos) /*!< Bit mask of PROTOCOL field. */
#define SIMIF_PROTOCOL_PROTOCOL_T0 (0UL) /*!< T=0 */
#define SIMIF_PROTOCOL_PROTOCOL_T1 (1UL) /*!< T=1 */

/* Register: SIMIF_LOWIMPEDANCE */
/* Description: Low impedance driver use */

/* Bit 0 : Low impedance driver use */
#define SIMIF_LOWIMPEDANCE_LOWIMPEDANCE_Pos (0UL) /*!< Position of LOWIMPEDANCE field. */
#define SIMIF_LOWIMPEDANCE_LOWIMPEDANCE_Msk (0x1UL << SIMIF_LOWIMPEDANCE_LOWIMPEDANCE_Pos) /*!< Bit mask of LOWIMPEDANCE field. */
#define SIMIF_LOWIMPEDANCE_LOWIMPEDANCE_OpenDrain (0UL) /*!< open drain */
#define SIMIF_LOWIMPEDANCE_LOWIMPEDANCE_LowImpedance (1UL) /*!< use 		low impedance drivers */

/* Register: SIMIF_T1PCBCONTROL */
/* Description: T=1 Tx PCB bits 5:6 */

/* Bit 1 : Send Sequence number, PCB[6] */
#define SIMIF_T1PCBCONTROL_SENDSEQUENCENUMBER_Pos (1UL) /*!< Position of SENDSEQUENCENUMBER field. */
#define SIMIF_T1PCBCONTROL_SENDSEQUENCENUMBER_Msk (0x1UL << SIMIF_T1PCBCONTROL_SENDSEQUENCENUMBER_Pos) /*!< Bit mask of SENDSEQUENCENUMBER field. */

/* Bit 0 : More data (chaining) bit, PCB[5] */
#define SIMIF_T1PCBCONTROL_MOREDATABIT_Pos (0UL) /*!< Position of MOREDATABIT field. */
#define SIMIF_T1PCBCONTROL_MOREDATABIT_Msk (0x1UL << SIMIF_T1PCBCONTROL_MOREDATABIT_Pos) /*!< Bit mask of MOREDATABIT field. */

/* Register: SIMIF_CLOCKCONTROL */
/* Description: Clock Control */

/* Bits 2..1 : Clock stop state */
#define SIMIF_CLOCKCONTROL_CLOCKSTOP_Pos (1UL) /*!< Position of CLOCKSTOP field. */
#define SIMIF_CLOCKCONTROL_CLOCKSTOP_Msk (0x3UL << SIMIF_CLOCKCONTROL_CLOCKSTOP_Pos) /*!< Bit mask of CLOCKSTOP field. */
#define SIMIF_CLOCKCONTROL_CLOCKSTOP_Illegal (00UL) /*!< Not allowed */
#define SIMIF_CLOCKCONTROL_CLOCKSTOP_High (0x1UL) /*!< Clock stops low */
#define SIMIF_CLOCKCONTROL_CLOCKSTOP_Low (0x2UL) /*!< Clock stops high */

/* Bit 0 : Enable clock */
#define SIMIF_CLOCKCONTROL_ENABLE_Pos (0UL) /*!< Position of ENABLE field. */
#define SIMIF_CLOCKCONTROL_ENABLE_Msk (0x1UL << SIMIF_CLOCKCONTROL_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define SIMIF_CLOCKCONTROL_ENABLE_ClockOff (0UL) /*!< Clock is off */
#define SIMIF_CLOCKCONTROL_ENABLE_ClockOn (1UL) /*!< Clock is on */

/* Register: SIMIF_VOLTAGE */
/* Description: Sim card operating voltage */

/* Bits 1..0 : Sim card operating voltage */
#define SIMIF_VOLTAGE_VOLTAGE_Pos (0UL) /*!< Position of VOLTAGE field. */
#define SIMIF_VOLTAGE_VOLTAGE_Msk (0x3UL << SIMIF_VOLTAGE_VOLTAGE_Pos) /*!< Bit mask of VOLTAGE field. */
#define SIMIF_VOLTAGE_VOLTAGE_0V (0x0UL) /*!< Card voltage off */
#define SIMIF_VOLTAGE_VOLTAGE_1800mV (0x1UL) /*!< Card operating voltage 1.8V */
#define SIMIF_VOLTAGE_VOLTAGE_3000mV (0x2UL) /*!< Card operating voltage 3V */

/* Register: SIMIF_LRCENABLE */
/* Description: LRC Calculation enable */

/* Bit 0 : LRC Calculation enable for T=1 */
#define SIMIF_LRCENABLE_LRCENABLE_Pos (0UL) /*!< Position of LRCENABLE field. */
#define SIMIF_LRCENABLE_LRCENABLE_Msk (0x1UL << SIMIF_LRCENABLE_LRCENABLE_Pos) /*!< Bit mask of LRCENABLE field. */
#define SIMIF_LRCENABLE_LRCENABLE_Disable (0UL) /*!< LRC calculation disabled */
#define SIMIF_LRCENABLE_LRCENABLE_Enable (1UL) /*!< LRC 			calculation enabled */

/* Register: SIMIF_TXDATA */
/* Description: NonDMA data to be sent to the SIM card */

/* Bits 7..0 : NonDMA data to be sent to the SIM card */
#define SIMIF_TXDATA_TXDATA_Pos (0UL) /*!< Position of TXDATA field. */
#define SIMIF_TXDATA_TXDATA_Msk (0xFFUL << SIMIF_TXDATA_TXDATA_Pos) /*!< Bit mask of TXDATA field. */

/* Register: SIMIF_UARTCONFIG */
/* Description: Uart configuration */

/* Bits 2..0 : Uart configuration, for details see Uart spec */
#define SIMIF_UARTCONFIG_UARTCONFIG_Pos (0UL) /*!< Position of UARTCONFIG field. */
#define SIMIF_UARTCONFIG_UARTCONFIG_Msk (0x7UL << SIMIF_UARTCONFIG_UARTCONFIG_Pos) /*!< Bit mask of UARTCONFIG field. */

/* Register: SIMIF_WRITEMAXATT */
/* Description: Number of write attempts before error interrupt */

/* Bits 7..0 : Number of write attempts before error interrupt */
#define SIMIF_WRITEMAXATT_WRITEMAXATT_Pos (0UL) /*!< Position of WRITEMAXATT field. */
#define SIMIF_WRITEMAXATT_WRITEMAXATT_Msk (0xFFUL << SIMIF_WRITEMAXATT_WRITEMAXATT_Pos) /*!< Bit mask of WRITEMAXATT field. */

/* Register: SIMIF_READMAXATT */
/* Description: Number of read attempts before error interrupt */

/* Bits 7..0 : Number of read attempts before error interrupt */
#define SIMIF_READMAXATT_READMAXATT_Pos (0UL) /*!< Position of READMAXATT field. */
#define SIMIF_READMAXATT_READMAXATT_Msk (0xFFUL << SIMIF_READMAXATT_READMAXATT_Pos) /*!< Bit mask of READMAXATT field. */

/* Register: SIMIF_UartEnable */
/* Description: UART Enable */

/* Bit 0 : UART master enable */
#define SIMIF_UartEnable_UartEnable_Pos (0UL) /*!< Position of UartEnable field. */
#define SIMIF_UartEnable_UartEnable_Msk (0x1UL << SIMIF_UartEnable_UartEnable_Pos) /*!< Bit mask of UartEnable field. */

