adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 0 : New keys (and IV) ready to be used, reset keybytes, ivbytes */
#define SNOW_TASKS_INITIALIZESNOW3G_TASKS_INITIALIZESNOW3G_Pos (0UL) /*!< Position of TASKS_INITIALIZESNOW3G field. */
#define SNOW_TASKS_INITIALIZESNOW3G_TASKS_INITIALIZESNOW3G_Msk (0x1UL << SNOW_TASKS_INITIALIZESNOW3G_TASKS_INITIALIZESNOW3G_Pos) /*!< Bit mask of TASKS_INITIALIZESNOW3G field. */
#define SNOW_TASKS_INITIALIZESNOW3G_TASKS_INITIALIZESNOW3G_Trigger (1UL) /*!< Trigger task */

/* Register: SNOW_TASKS_STARTOPERATION */
/* Description: Start cipher / MAC calculation depending on MODE */

/* Bit 0 : Start cipher / MAC calculation depending on MODE */
#define SNOW_TASKS_STARTOPERATION_TASKS_STARTOPERATION_Pos (0UL) /*!< Position of TASKS_STARTOPERATION field. */
#define SNOW_TASKS_STARTOPERATION_TASKS_STARTOPERATION_Msk (0x1UL << SNOW_TASKS_STARTOPERATION_TASKS_STARTOPERATION_Pos) /*!< Bit mask of TASKS_STARTOPERATION field. */
#define SNOW_TASKS_STARTOPERATION_TASKS_STARTOPERATION_Trigger (1UL) /*!< Trigger task */

/* Register: SNOW_TASKS_FINALIZEMAC */
/* Description: Finalize MAC calculation */

/* Bit 0 : Finalize MAC calculation */
#define SNOW_TASKS_FINALIZEMAC_TASKS_FINALIZEMAC_Pos (0UL) /*!< Position of TASKS_FINALIZEMAC field. */
#define SNOW_TASKS_FINALIZEMAC_TASKS_FINALIZEMAC_Msk (0x1UL << SNOW_TASKS_FINALIZEMAC_TASKS_FINALIZEMAC_Pos) /*!< Bit mask of TASKS_FINALIZEMAC field. */
#define SNOW_TASKS_FINALIZEMAC_TASKS_FINALIZEMAC_Trigger (1UL) /*!< Trigger task */

/* Register: SNOW_TASKS_RESET */
/* Description: Stop all transfers and crypto operations (initialize) */

/* Bit 0 : Stop all transfers and crypto operations (initialize) */
#define SNOW_TASKS_RESET_TASKS_RESET_Pos (0UL) /*!< Position of TASKS_RESET field. */
#define SNOW_TASKS_RESET_TASKS_RESET_Msk (0x1UL << SNOW_TASKS_RESET_TASKS_RESET_Pos) /*!< Bit mask of TASKS_RESET field. */
#define SNOW_TASKS_RESET_TASKS_RESET_Trigger (1UL) /*!< Trigger task */

/* Register: SNOW_TaskZeroPenalty_PCP_1 */
/* Description: TaskZeroPenalty register for PCP 1 */

/* Bit 0 :   */
#define SNOW_TaskZeroPenalty_PCP_1_ZeroTask_Pos (0UL) /*!< Position of ZeroTask field. */
#define SNOW_TaskZeroPenalty_PCP_1_ZeroTask_Msk (0x1UL << SNOW_TaskZeroPenalty_PCP_1_ZeroTask_Pos) /*!< Bit mask of ZeroTask field. */
#define SNOW_TaskZeroPenalty_PCP_1_ZeroTask_ZeroTask (1UL) /*!< Set Zero Penalty */

/* Register: SNOW_TaskFullPenalty_PCP_1 */
/* Description: TaskFullPenalty register for PCP 1 */

/* Bit 0 :   */
#define SNOW_TaskFullPenalty_PCP_1_FullTask_Pos (0UL) /*!< Position of FullTask field. */
#define SNOW_TaskFullPenalty_PCP_1_FullTask_Msk (0x1UL << SNOW_TaskFullPenalty_PCP_1_FullTask_Pos) /*!< Bit mask of FullTask field. */
#define SNOW_TaskFullPenalty_PCP_1_FullTask_FullTask (1UL) /*!< Set Full Penalty */

/* Register: SNOW_TaskZeroPenalty_PCP_0 */
/* Description: TaskZeroPenalty register for PCP 0 */

/* Bit 0 :   */
#define SNOW_TaskZeroPenalty_PCP_0_ZeroTask_Pos (0UL) /*!< Position of ZeroTask field. */
#define SNOW_TaskZeroPenalty_PCP_0_ZeroTask_Msk (0x1UL << SNOW_TaskZeroPenalty_PCP_0_ZeroTask_Pos) /*!< Bit mask of ZeroTask field. */
#define SNOW_TaskZeroPenalty_PCP_0_ZeroTask_ZeroTask (1UL) /*!< Set Zero Penalty */

/* Register: SNOW_TaskFullPenalty_PCP_0 */
/* Description: TaskFullPenalty register for PCP 0 */

/* Bit 0 :   */
#define SNOW_TaskFullPenalty_PCP_0_FullTask_Pos (0UL) /*!< Position of FullTask field. */
#define SNOW_TaskFullPenalty_PCP_0_FullTask_Msk (0x1UL << SNOW_TaskFullPenalty_PCP_0_FullTask_Pos) /*!< Bit mask of FullTask field. */
#define SNOW_TaskFullPenalty_PCP_0_FullTask_FullTask (1UL) /*!< Set Full Penalty */

/* Register: SNOW_EVENTS_GATHERSTARTED */
/* Description: Input DMA started */

/* Bit 0 : Input DMA started */
#define SNOW_EVENTS_GATHERSTARTED_EVENTS_GATHERSTARTED_Pos (0UL) /*!< Position of EVENTS_GATHERSTARTED field. */
#define SNOW_EVENTS_GATHERSTARTED_EVENTS_GATHERSTARTED_Msk (0x1UL << SNOW_EVENTS_GATHERSTARTED_EVENTS_GATHERSTARTED_Pos) /*!< Bit mask of EVENTS_GATHERSTARTED field. */
#define SNOW_EVENTS_GATHERSTARTED_EVENTS_GATHERSTARTED_NotGenerated (0UL) /*!< Event not generated */
#define SNOW_EVENTS_GATHERSTARTED_EVENTS_GATHERSTARTED_Generated (1UL) /*!< Event generated */

/* Register: SNOW_EVENTS_GATHERDONE */
/* Description: Input DMA done */

/* Bit 0 : Input DMA done */
#define SNOW_EVENTS_GATHERDONE_EVENTS_GATHERDONE_Pos (0UL) /*!< Position of EVENTS_GATHERDONE field. */
#define SNOW_EVENTS_GATHERDONE_EVENTS_GATHERDONE_Msk (0x1UL << SNOW_EVENTS_GATHERDONE_EVENTS_GATHERDONE_Pos) /*!< Bit mask of EVENTS_GATHERDONE field. */
#define SNOW_EVENTS_GATHERDONE_EVENTS_GATHERDONE_NotGenerated (0UL) /*!< Event not generated */
#define SNOW_EVENTS_GATHERDONE_EVENTS_GATHERDONE_Generated (1UL) /*!< Event generated */

/* Register: SNOW_EVENTS_SCATTERSTARTED */
/* Description: Output DMA started */

/* Bit 0 : Output DMA started */
#define SNOW_EVENTS_SCATTERSTARTED_EVENTS_SCATTERSTARTED_Pos (0UL) /*!< Position of EVENTS_SCATTERSTARTED field. */
#define SNOW_EVENTS_SCATTERSTARTED_EVENTS_SCATTERSTARTED_Msk (0x1UL << SNOW_EVENTS_SCATTERSTARTED_EVENTS_SCATTERSTARTED_Pos) /*!< Bit mask of EVENTS_SCATTERSTARTED field. */
#define SNOW_EVENTS_SCATTERSTARTED_EVENTS_SCATTERSTARTED_NotGenerated (0UL) /*!< Event not generated */
#define SNOW_EVENTS_SCATTERSTARTED_EVENTS_SCATTERSTARTED_Generated (1UL) /*!< Event generated */

/* Register: SNOW_EVENTS_SCATTERDONE */
/* Description: Output DMA done */

/* Bit 0 : Output DMA done */
#define SNOW_EVENTS_SCATTERDONE_EVENTS_SCATTERDONE_Pos (0UL) /*!< Position of EVENTS_SCATTERDONE field. */
#define SNOW_EVENTS_SCATTERDONE_EVENTS_SCATTERDONE_Msk (0x1UL << SNOW_EVENTS_SCATTERDONE_EVENTS_SCATTERDONE_Pos) /*!< Bit mask of EVENTS_SCATTERDONE field. */
#define SNOW_EVENTS_SCATTERDONE_EVENTS_SCATTERDONE_NotGenerated (0UL) /*!< Event not generated */
#define SNOW_EVENTS_SCATTERDONE_EVENTS_SCATTERDONE_Generated (1UL) /*!< Event generated */

/* Register: SNOW_EVENTS_IVREADY */
/* Description: IV received (ivbytes == 16) */

/* Bit 0 : IV received (ivbytes == 16) */
#define SNOW_EVENTS_IVREADY_EVENTS_IVREADY_Pos (0UL) /*!< Position of EVENTS_IVREADY field. */
#define SNOW_EVENTS_IVREADY_EVENTS_IVREADY_Msk (0x1UL << SNOW_EVENTS_IVREADY_EVENTS_IVREADY_Pos) /*!< Bit mask of EVENTS_IVREADY field. */
#define SNOW_EVENTS_IVREADY_EVENTS_IVREADY_NotGenerated (0UL) /*!< Event not generated */
#define SNOW_EVENTS_IVREADY_EVENTS_IVREADY_Generated (1UL) /*!< Event generated */

