adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 4 : Enable or disable interrupt for event IVREADY */
#define SNOW_INTEN_IVREADY_Pos (4UL) /*!< Position of IVREADY field. */
#define SNOW_INTEN_IVREADY_Msk (0x1UL << SNOW_INTEN_IVREADY_Pos) /*!< Bit mask of IVREADY field. */
#define SNOW_INTEN_IVREADY_Disabled (0UL) /*!< Disable */
#define SNOW_INTEN_IVREADY_Enabled (1UL) /*!< Enable */

/* Bit 3 : Enable or disable interrupt for event SCATTERDONE */
#define SNOW_INTEN_SCATTERDONE_Pos (3UL) /*!< Position of SCATTERDONE field. */
#define SNOW_INTEN_SCATTERDONE_Msk (0x1UL << SNOW_INTEN_SCATTERDONE_Pos) /*!< Bit mask of SCATTERDONE field. */
#define SNOW_INTEN_SCATTERDONE_Disabled (0UL) /*!< Disable */
#define SNOW_INTEN_SCATTERDONE_Enabled (1UL) /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event SCATTERSTARTED */
#define SNOW_INTEN_SCATTERSTARTED_Pos (2UL) /*!< Position of SCATTERSTARTED field. */
#define SNOW_INTEN_SCATTERSTARTED_Msk (0x1UL << SNOW_INTEN_SCATTERSTARTED_Pos) /*!< Bit mask of SCATTERSTARTED field. */
#define SNOW_INTEN_SCATTERSTARTED_Disabled (0UL) /*!< Disable */
#define SNOW_INTEN_SCATTERSTARTED_Enabled (1UL) /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event GATHERDONE */
#define SNOW_INTEN_GATHERDONE_Pos (1UL) /*!< Position of GATHERDONE field. */
#define SNOW_INTEN_GATHERDONE_Msk (0x1UL << SNOW_INTEN_GATHERDONE_Pos) /*!< Bit mask of GATHERDONE field. */
#define SNOW_INTEN_GATHERDONE_Disabled (0UL) /*!< Disable */
#define SNOW_INTEN_GATHERDONE_Enabled (1UL) /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event GATHERSTARTED */
#define SNOW_INTEN_GATHERSTARTED_Pos (0UL) /*!< Position of GATHERSTARTED field. */
#define SNOW_INTEN_GATHERSTARTED_Msk (0x1UL << SNOW_INTEN_GATHERSTARTED_Pos) /*!< Bit mask of GATHERSTARTED field. */
#define SNOW_INTEN_GATHERSTARTED_Disabled (0UL) /*!< Disable */
#define SNOW_INTEN_GATHERSTARTED_Enabled (1UL) /*!< Enable */

/* Register: SNOW_INTENSET */
/* Description: Enable interrupt */

/* Bit 8 : Write '1' to enable interrupt for event RESETTED */
#define SNOW_INTENSET_RESETTED_Pos (8UL) /*!< Position of RESETTED field. */
#define SNOW_INTENSET_RESETTED_Msk (0x1UL << SNOW_INTENSET_RESETTED_Pos) /*!< Bit mask of RESETTED field. */
#define SNOW_INTENSET_RESETTED_Disabled (0UL) /*!< Read: Disabled */
#define SNOW_INTENSET_RESETTED_Enabled (1UL) /*!< Read: Enabled */
#define SNOW_INTENSET_RESETTED_Set (1UL) /*!< Enable */

/* Bit 7 : Write '1' to enable interrupt for event MACREADY */
#define SNOW_INTENSET_MACREADY_Pos (7UL) /*!< Position of MACREADY field. */
#define SNOW_INTENSET_MACREADY_Msk (0x1UL << SNOW_INTENSET_MACREADY_Pos) /*!< Bit mask of MACREADY field. */
#define SNOW_INTENSET_MACREADY_Disabled (0UL) /*!< Read: Disabled */
#define SNOW_INTENSET_MACREADY_Enabled (1UL) /*!< Read: Enabled */
#define SNOW_INTENSET_MACREADY_Set (1UL) /*!< Enable */

/* Bit 6 : Write '1' to enable interrupt for event MESSAGEREADY */
#define SNOW_INTENSET_MESSAGEREADY_Pos (6UL) /*!< Position of MESSAGEREADY field. */
#define SNOW_INTENSET_MESSAGEREADY_Msk (0x1UL << SNOW_INTENSET_MESSAGEREADY_Pos) /*!< Bit mask of MESSAGEREADY field. */
#define SNOW_INTENSET_MESSAGEREADY_Disabled (0UL) /*!< Read: Disabled */
#define SNOW_INTENSET_MESSAGEREADY_Enabled (1UL) /*!< Read: Enabled */
#define SNOW_INTENSET_MESSAGEREADY_Set (1UL) /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event SNOW3GINITIALIZED */
#define SNOW_INTENSET_SNOW3GINITIALIZED_Pos (5UL) /*!< Position of SNOW3GINITIALIZED field. */
#define SNOW_INTENSET_SNOW3GINITIALIZED_Msk (0x1UL << SNOW_INTENSET_SNOW3GINITIALIZED_Pos) /*!< Bit mask of SNOW3GINITIALIZED field. */
#define SNOW_INTENSET_SNOW3GINITIALIZED_Disabled (0UL) /*!< Read: Disabled */
#define SNOW_INTENSET_SNOW3GINITIALIZED_Enabled (1UL) /*!< Read: Enabled */
#define SNOW_INTENSET_SNOW3GINITIALIZED_Set (1UL) /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event IVREADY */
#define SNOW_INTENSET_IVREADY_Pos (4UL) /*!< Position of IVREADY field. */
#define SNOW_INTENSET_IVREADY_Msk (0x1UL << SNOW_INTENSET_IVREADY_Pos) /*!< Bit mask of IVREADY field. */
#define SNOW_INTENSET_IVREADY_Disabled (0UL) /*!< Read: Disabled */
#define SNOW_INTENSET_IVREADY_Enabled (1UL) /*!< Read: Enabled */
#define SNOW_INTENSET_IVREADY_Set (1UL) /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event SCATTERDONE */
#define SNOW_INTENSET_SCATTERDONE_Pos (3UL) /*!< Position of SCATTERDONE field. */
#define SNOW_INTENSET_SCATTERDONE_Msk (0x1UL << SNOW_INTENSET_SCATTERDONE_Pos) /*!< Bit mask of SCATTERDONE field. */
#define SNOW_INTENSET_SCATTERDONE_Disabled (0UL) /*!< Read: Disabled */
#define SNOW_INTENSET_SCATTERDONE_Enabled (1UL) /*!< Read: Enabled */
#define SNOW_INTENSET_SCATTERDONE_Set (1UL) /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event SCATTERSTARTED */
#define SNOW_INTENSET_SCATTERSTARTED_Pos (2UL) /*!< Position of SCATTERSTARTED field. */
#define SNOW_INTENSET_SCATTERSTARTED_Msk (0x1UL << SNOW_INTENSET_SCATTERSTARTED_Pos) /*!< Bit mask of SCATTERSTARTED field. */
#define SNOW_INTENSET_SCATTERSTARTED_Disabled (0UL) /*!< Read: Disabled */
#define SNOW_INTENSET_SCATTERSTARTED_Enabled (1UL) /*!< Read: Enabled */
#define SNOW_INTENSET_SCATTERSTARTED_Set (1UL) /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event GATHERDONE */
#define SNOW_INTENSET_GATHERDONE_Pos (1UL) /*!< Position of GATHERDONE field. */
#define SNOW_INTENSET_GATHERDONE_Msk (0x1UL << SNOW_INTENSET_GATHERDONE_Pos) /*!< Bit mask of GATHERDONE field. */
#define SNOW_INTENSET_GATHERDONE_Disabled (0UL) /*!< Read: Disabled */
#define SNOW_INTENSET_GATHERDONE_Enabled (1UL) /*!< Read: Enabled */
#define SNOW_INTENSET_GATHERDONE_Set (1UL) /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event GATHERSTARTED */
#define SNOW_INTENSET_GATHERSTARTED_Pos (0UL) /*!< Position of GATHERSTARTED field. */
#define SNOW_INTENSET_GATHERSTARTED_Msk (0x1UL << SNOW_INTENSET_GATHERSTARTED_Pos) /*!< Bit mask of GATHERSTARTED field. */
#define SNOW_INTENSET_GATHERSTARTED_Disabled (0UL) /*!< Read: Disabled */
#define SNOW_INTENSET_GATHERSTARTED_Enabled (1UL) /*!< Read: Enabled */
#define SNOW_INTENSET_GATHERSTARTED_Set (1UL) /*!< Enable */

/* Register: SNOW_INTENCLR */
/* Description: Disable interrupt */

/* Bit 8 : Write '1' to disable interrupt for event RESETTED */
#define SNOW_INTENCLR_RESETTED_Pos (8UL) /*!< Position of RESETTED field. */
#define SNOW_INTENCLR_RESETTED_Msk (0x1UL << SNOW_INTENCLR_RESETTED_Pos) /*!< Bit mask of RESETTED field. */
#define SNOW_INTENCLR_RESETTED_Disabled (0UL) /*!< Read: Disabled */
#define SNOW_INTENCLR_RESETTED_Enabled (1UL) /*!< Read: Enabled */
#define SNOW_INTENCLR_RESETTED_Clear (1UL) /*!< Disable */

