adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bits 31..0 : Stream/message length */
#define SNOW_LENGTH_LENGTH_Pos (0UL) /*!< Position of LENGTH field. */
#define SNOW_LENGTH_LENGTH_Msk (0xFFFFFFFFUL << SNOW_LENGTH_LENGTH_Pos) /*!< Bit mask of LENGTH field. */

/* Register: SNOW_MODE */
/* Description: Mode select */

/* Bit 0 : Mode select. */
#define SNOW_MODE_MODE_Pos (0UL) /*!< Position of MODE field. */
#define SNOW_MODE_MODE_Msk (0x1UL << SNOW_MODE_MODE_Pos) /*!< Bit mask of MODE field. */
#define SNOW_MODE_MODE_CIPHER (0UL) /*!< Data cipher mode */
#define SNOW_MODE_MODE_MAC (1UL) /*!< MAC mode. */

/* Register: SNOW_MAC */
/* Description: Message Authentication Code. */

/* Bits 31..0 : Calculated MAC. */
#define SNOW_MAC_MAC_Pos (0UL) /*!< Position of MAC field. */
#define SNOW_MAC_MAC_Msk (0xFFFFFFFFUL << SNOW_MAC_MAC_Pos) /*!< Bit mask of MAC field. */

/* Register: SNOW_INJOBPTR */
/* Description: Input job pointer */

/* Bits 31..0 : Input job pointer */
#define SNOW_INJOBPTR_INJOBPTR_Pos (0UL) /*!< Position of INJOBPTR field. */
#define SNOW_INJOBPTR_INJOBPTR_Msk (0xFFFFFFFFUL << SNOW_INJOBPTR_INJOBPTR_Pos) /*!< Bit mask of INJOBPTR field. */

/* Register: SNOW_OUTJOBPTR */
/* Description: Output job pointer */

/* Bits 31..0 : Output job pointer */
#define SNOW_OUTJOBPTR_OUTJOBPTR_Pos (0UL) /*!< Position of OUTJOBPTR field. */
#define SNOW_OUTJOBPTR_OUTJOBPTR_Msk (0xFFFFFFFFUL << SNOW_OUTJOBPTR_OUTJOBPTR_Pos) /*!< Bit mask of OUTJOBPTR field. */

/* Register: SNOW_PENALTY_REG */
/* Description: Description collection: Penalty register for PCP n */

/* Bits 1..0 : Penalty Level */
#define SNOW_PENALTY_REG_Auto_Pos (0UL) /*!< Position of Auto field. */
#define SNOW_PENALTY_REG_Auto_Msk (0x3UL << SNOW_PENALTY_REG_Auto_Pos) /*!< Bit mask of Auto field. */
#define SNOW_PENALTY_REG_Auto_Full (0UL) /*!< (Auto 0) Full penalty) */
#define SNOW_PENALTY_REG_Auto_Semi0 (1UL) /*!< (Auto 1)  Semi (power on, clock off) */
#define SNOW_PENALTY_REG_Auto_Semi1 (2UL) /*!< (Auto 2) Semi (power on, clock core on, clock buffer off) */
#define SNOW_PENALTY_REG_Auto_Zero (3UL) /*!< (Auto 3)  Zero penalty */

/* Register: SNOW_FORCE_OVERRIDE */
/* Description: Description collection: Force override register for PCP n */

/* Bit 15 :   */
#define SNOW_FORCE_OVERRIDE_ForceCtrl_Pos (15UL) /*!< Position of ForceCtrl field. */
#define SNOW_FORCE_OVERRIDE_ForceCtrl_Msk (0x1UL << SNOW_FORCE_OVERRIDE_ForceCtrl_Pos) /*!< Bit mask of ForceCtrl field. */
#define SNOW_FORCE_OVERRIDE_ForceCtrl_Disable (0UL) /*!< all forcing disabled */
#define SNOW_FORCE_OVERRIDE_ForceCtrl_Enable (1UL) /*!< all forcing enabled */

/* Bit 9 :   */
#define SNOW_FORCE_OVERRIDE_PowerRequestCore_Pos (9UL) /*!< Position of PowerRequestCore field. */
#define SNOW_FORCE_OVERRIDE_PowerRequestCore_Msk (0x1UL << SNOW_FORCE_OVERRIDE_PowerRequestCore_Pos) /*!< Bit mask of PowerRequestCore field. */
#define SNOW_FORCE_OVERRIDE_PowerRequestCore_zero (0UL) /*!< powerRequest.core = 0 */
#define SNOW_FORCE_OVERRIDE_PowerRequestCore_one (1UL) /*!< powerRequest.core = 1 */

/* Bit 8 :   */
#define SNOW_FORCE_OVERRIDE_PowerRequestSwitch_Pos (8UL) /*!< Position of PowerRequestSwitch field. */
#define SNOW_FORCE_OVERRIDE_PowerRequestSwitch_Msk (0x1UL << SNOW_FORCE_OVERRIDE_PowerRequestSwitch_Pos) /*!< Bit mask of PowerRequestSwitch field. */
#define SNOW_FORCE_OVERRIDE_PowerRequestSwitch_zero (0UL) /*!< powerRequest.switch = 0 */
#define SNOW_FORCE_OVERRIDE_PowerRequestSwitch_one (1UL) /*!< powerRequest.switch = 1 */

/* Bit 7 :   */
#define SNOW_FORCE_OVERRIDE_ClockForcing_Pos (7UL) /*!< Position of ClockForcing field. */
#define SNOW_FORCE_OVERRIDE_ClockForcing_Msk (0x1UL << SNOW_FORCE_OVERRIDE_ClockForcing_Pos) /*!< Bit mask of ClockForcing field. */
#define SNOW_FORCE_OVERRIDE_ClockForcing_disable (0UL) /*!< All clock forcing  disabled */
#define SNOW_FORCE_OVERRIDE_ClockForcing_enable (1UL) /*!< All clock forcing  enabled */

/* Bit 3 :   */
#define SNOW_FORCE_OVERRIDE_ClockRequestCore_Pos (3UL) /*!< Position of ClockRequestCore field. */
#define SNOW_FORCE_OVERRIDE_ClockRequestCore_Msk (0x1UL << SNOW_FORCE_OVERRIDE_ClockRequestCore_Pos) /*!< Bit mask of ClockRequestCore field. */
#define SNOW_FORCE_OVERRIDE_ClockRequestCore_zero (0UL) /*!< clockRequest.core = 0 */
#define SNOW_FORCE_OVERRIDE_ClockRequestCore_one (1UL) /*!< clockRequest.core = 1 */

/* Bit 2 :   */
#define SNOW_FORCE_OVERRIDE_ClockRequestBuff_Pos (2UL) /*!< Position of ClockRequestBuff field. */
#define SNOW_FORCE_OVERRIDE_ClockRequestBuff_Msk (0x1UL << SNOW_FORCE_OVERRIDE_ClockRequestBuff_Pos) /*!< Bit mask of ClockRequestBuff field. */
#define SNOW_FORCE_OVERRIDE_ClockRequestBuff_zero (0UL) /*!< clockRequest.buff = 0 */
#define SNOW_FORCE_OVERRIDE_ClockRequestBuff_one (1UL) /*!< clockRequest.buff = 1 */

/* Bit 1 :   */
#define SNOW_FORCE_OVERRIDE_ClockRequestSwitch_Pos (1UL) /*!< Position of ClockRequestSwitch field. */
#define SNOW_FORCE_OVERRIDE_ClockRequestSwitch_Msk (0x1UL << SNOW_FORCE_OVERRIDE_ClockRequestSwitch_Pos) /*!< Bit mask of ClockRequestSwitch field. */
#define SNOW_FORCE_OVERRIDE_ClockRequestSwitch_zero (0UL) /*!< clockRequest.switch = 0 */
#define SNOW_FORCE_OVERRIDE_ClockRequestSwitch_one (1UL) /*!< clockRequest.switch = 1 */

/* Bit 0 :   */
#define SNOW_FORCE_OVERRIDE_ClockRequestSwitchA_Pos (0UL) /*!< Position of ClockRequestSwitchA field. */
#define SNOW_FORCE_OVERRIDE_ClockRequestSwitchA_Msk (0x1UL << SNOW_FORCE_OVERRIDE_ClockRequestSwitchA_Pos) /*!< Bit mask of ClockRequestSwitchA field. */
#define SNOW_FORCE_OVERRIDE_ClockRequestSwitchA_zero (0UL) /*!< clockRequest.switch_a = 0 */
#define SNOW_FORCE_OVERRIDE_ClockRequestSwitchA_one (1UL) /*!< clockRequest.switch_a = 1 */

/* Register: SNOW_TURN_OFF_AUTO_CLOCKSOURCE_REQ */
/* Description: Turn of the automatic clock request. */

/* Bit 1 :   */
#define SNOW_TURN_OFF_AUTO_CLOCKSOURCE_REQ_ClockStartPcp1_Pos (1UL) /*!< Position of ClockStartPcp1 field. */
#define SNOW_TURN_OFF_AUTO_CLOCKSOURCE_REQ_ClockStartPcp1_Msk (0x1UL << SNOW_TURN_OFF_AUTO_CLOCKSOURCE_REQ_ClockStartPcp1_Pos) /*!< Bit mask of ClockStartPcp1 field. */
#define SNOW_TURN_OFF_AUTO_CLOCKSOURCE_REQ_ClockStartPcp1_normal_on (0UL) /*!< normal clock start for PCP 1 */
#define SNOW_TURN_OFF_AUTO_CLOCKSOURCE_REQ_ClockStartPcp1_normal_off (1UL) /*!< turn off normal clock start for PCP 1 */

