adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Register: TEMP_B3 */
/* Description: y-intercept of 4th piece wise linear function */

/* Bits 13..0 : y-intercept of 4th piece wise linear function */
#define TEMP_B3_B3_Pos (0UL) /*!< Position of B3 field. */
#define TEMP_B3_B3_Msk (0x3FFFUL << TEMP_B3_B3_Pos) /*!< Bit mask of B3 field. */

/* Register: TEMP_B4 */
/* Description: y-intercept of 5th piece wise linear function */

/* Bits 13..0 : y-intercept of 5th piece wise linear function */
#define TEMP_B4_B4_Pos (0UL) /*!< Position of B4 field. */
#define TEMP_B4_B4_Msk (0x3FFFUL << TEMP_B4_B4_Pos) /*!< Bit mask of B4 field. */

/* Register: TEMP_B5 */
/* Description: y-intercept of 6th piece wise linear function */

/* Bits 13..0 : y-intercept of 6th piece wise linear function */
#define TEMP_B5_B5_Pos (0UL) /*!< Position of B5 field. */
#define TEMP_B5_B5_Msk (0x3FFFUL << TEMP_B5_B5_Pos) /*!< Bit mask of B5 field. */

/* Register: TEMP_T0 */
/* Description: End point of 1st piece wise linear function */

/* Bits 7..0 : End point of 1st piece wise linear function */
#define TEMP_T0_T0_Pos (0UL) /*!< Position of T0 field. */
#define TEMP_T0_T0_Msk (0xFFUL << TEMP_T0_T0_Pos) /*!< Bit mask of T0 field. */

/* Register: TEMP_T1 */
/* Description: End point of 2nd piece wise linear function */

/* Bits 7..0 : End point of 2nd piece wise linear function */
#define TEMP_T1_T1_Pos (0UL) /*!< Position of T1 field. */
#define TEMP_T1_T1_Msk (0xFFUL << TEMP_T1_T1_Pos) /*!< Bit mask of T1 field. */

/* Register: TEMP_T2 */
/* Description: End point of 3rd piece wise linear function */

/* Bits 7..0 : End point of 3rd piece wise linear function */
#define TEMP_T2_T2_Pos (0UL) /*!< Position of T2 field. */
#define TEMP_T2_T2_Msk (0xFFUL << TEMP_T2_T2_Pos) /*!< Bit mask of T2 field. */

/* Register: TEMP_T3 */
/* Description: End point of 4th piece wise linear function */

/* Bits 7..0 : End point of 4th piece wise linear function */
#define TEMP_T3_T3_Pos (0UL) /*!< Position of T3 field. */
#define TEMP_T3_T3_Msk (0xFFUL << TEMP_T3_T3_Pos) /*!< Bit mask of T3 field. */

/* Register: TEMP_T4 */
/* Description: End point of 5th piece wise linear function */

/* Bits 7..0 : End point of 5th piece wise linear function */
#define TEMP_T4_T4_Pos (0UL) /*!< Position of T4 field. */
#define TEMP_T4_T4_Msk (0xFFUL << TEMP_T4_T4_Pos) /*!< Bit mask of T4 field. */

/* Register: TEMP_POWER */
/* Description: Peripheral power control */

/* Bit 0 : Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again. */
#define TEMP_POWER_POWER_Pos (0UL) /*!< Position of POWER field. */
#define TEMP_POWER_POWER_Msk (0x1UL << TEMP_POWER_POWER_Pos) /*!< Bit mask of POWER field. */
#define TEMP_POWER_POWER_Disabled (0UL) /*!< Peripheral is powered off */
#define TEMP_POWER_POWER_Enabled (1UL) /*!< Peripheral is powered on */


/* Peripheral: TIMEMARKMUX */
/* Description: Timemark multiplexer for LTE System Timer */

/* Register: TIMEMARKMUX_ENABLE */
/* Description: Enable Timemark Mux */

/* Bits 31..2 : Unused */
#define TIMEMARKMUX_ENABLE_Unused_Pos (2UL) /*!< Position of Unused field. */
#define TIMEMARKMUX_ENABLE_Unused_Msk (0x3FFFFFFFUL << TIMEMARKMUX_ENABLE_Unused_Pos) /*!< Bit mask of Unused field. */

/* Bit 1 : Enable */
#define TIMEMARKMUX_ENABLE_ENABLE_TMGNSS_Pos (1UL) /*!< Position of ENABLE_TMGNSS field. */
#define TIMEMARKMUX_ENABLE_ENABLE_TMGNSS_Msk (0x1UL << TIMEMARKMUX_ENABLE_ENABLE_TMGNSS_Pos) /*!< Bit mask of ENABLE_TMGNSS field. */
#define TIMEMARKMUX_ENABLE_ENABLE_TMGNSS_Disable (0UL) /*!< Disable GNSS timemark output */
#define TIMEMARKMUX_ENABLE_ENABLE_TMGNSS_Enable (1UL) /*!< Enable GNSS timemark output */

/* Bit 0 : Enable */
#define TIMEMARKMUX_ENABLE_ENABLE_TMRF_Pos (0UL) /*!< Position of ENABLE_TMRF field. */
#define TIMEMARKMUX_ENABLE_ENABLE_TMRF_Msk (0x1UL << TIMEMARKMUX_ENABLE_ENABLE_TMRF_Pos) /*!< Bit mask of ENABLE_TMRF field. */
#define TIMEMARKMUX_ENABLE_ENABLE_TMRF_Disable (0UL) /*!< Disable RF timemark output */
#define TIMEMARKMUX_ENABLE_ENABLE_TMRF_Enable (1UL) /*!< Enable RF timemark output */

/* Register: TIMEMARKMUX_TIMEMARK_INPUT_SELECT */
/* Description: Timemark input select register */

/* Bits 31..16 : Unused */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_Unused_Pos (16UL) /*!< Position of Unused field. */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_Unused_Msk (0xFFFFUL << TIMEMARKMUX_TIMEMARK_INPUT_SELECT_Unused_Pos) /*!< Bit mask of Unused field. */

/* Bits 15..8 : GNSS timemark input select */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Pos (8UL) /*!< Position of GNSS_TIMEMARK_SELECT field. */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Msk (0xFFUL << TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Pos) /*!< Bit mask of GNSS_TIMEMARK_SELECT field. */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Event0 (0x01UL) /*!< Enable events[0] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Event1 (0x02UL) /*!< Enable events[1] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Event2 (0x04UL) /*!< Enable events[2] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Event3 (0x08UL) /*!< Enable events[3] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Event4 (0x10UL) /*!< Enable events[4] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Event5 (0x20UL) /*!< Enable events[5] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Event6 (0x40UL) /*!< Enable events[6] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Event7 (0x80UL) /*!< Enable events[7] as timemark input */

/* Bits 7..0 : RF timemark input select */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Pos (0UL) /*!< Position of RF_TIMEMARK_SELECT field. */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Msk (0xFFUL << TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Pos) /*!< Bit mask of RF_TIMEMARK_SELECT field. */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Event0 (0x01UL) /*!< Enable events[0] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Event1 (0x02UL) /*!< Enable events[1] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Event2 (0x04UL) /*!< Enable events[2] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Event3 (0x08UL) /*!< Enable events[3] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Event4 (0x10UL) /*!< Enable events[4] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Event5 (0x20UL) /*!< Enable events[5] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Event6 (0x40UL) /*!< Enable events[6] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Event7 (0x80UL) /*!< Enable events[7] as timemark input */


