adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Peripheral: TIMEREVENTSYNC */
/* Description: Timer event synchronizer */

/* Register: TIMEREVENTSYNC_CLOCKENABLE */
/* Description: Enable synchronizer clock. */

/* Bit 0 : Enable. */
#define TIMEREVENTSYNC_CLOCKENABLE_CLOCKENABLE_Pos (0UL) /*!< Position of CLOCKENABLE field. */
#define TIMEREVENTSYNC_CLOCKENABLE_CLOCKENABLE_Msk (0x1UL << TIMEREVENTSYNC_CLOCKENABLE_CLOCKENABLE_Pos) /*!< Bit mask of CLOCKENABLE field. */
#define TIMEREVENTSYNC_CLOCKENABLE_CLOCKENABLE_Disable (0UL) /*!< Disable clock. */
#define TIMEREVENTSYNC_CLOCKENABLE_CLOCKENABLE_Enable (1UL) /*!< Enable clock. */


/* Peripheral: TRACEANDDEBUGALTA */
/* Description: Trace And Debug */

/* Register: TRACEANDDEBUGALTA_STARTCLOCKS */
/* Description: Start all Trace and Debug clocks. */

/* Bit 0 :   */
#define TRACEANDDEBUGALTA_STARTCLOCKS_STARTCLOCKS_Pos (0UL) /*!< Position of STARTCLOCKS field. */
#define TRACEANDDEBUGALTA_STARTCLOCKS_STARTCLOCKS_Msk (0x1UL << TRACEANDDEBUGALTA_STARTCLOCKS_STARTCLOCKS_Pos) /*!< Bit mask of STARTCLOCKS field. */
#define TRACEANDDEBUGALTA_STARTCLOCKS_STARTCLOCKS_STARTCLOCKS (1UL) /*!< Start all Trace and Debug clocks. */

/* Register: TRACEANDDEBUGALTA_STOPCLOCKS */
/* Description: Stop all Trace and Debug clocks. */

/* Bit 0 :   */
#define TRACEANDDEBUGALTA_STOPCLOCKS_STOPCLOCKS_Pos (0UL) /*!< Position of STOPCLOCKS field. */
#define TRACEANDDEBUGALTA_STOPCLOCKS_STOPCLOCKS_Msk (0x1UL << TRACEANDDEBUGALTA_STOPCLOCKS_STOPCLOCKS_Pos) /*!< Bit mask of STOPCLOCKS field. */
#define TRACEANDDEBUGALTA_STOPCLOCKS_STOPCLOCKS_STOPCLOCKS (1UL) /*!< Stop all Trace and Debug clocks. */

/* Register: TRACEANDDEBUGALTA_TASKZEROPENALTY_PCP_3 */
/* Description: TaskZeroPenalty register for PCP 3 */

/* Bit 0 :   */
#define TRACEANDDEBUGALTA_TASKZEROPENALTY_PCP_3_ZERO_PENALTY_Pos (0UL) /*!< Position of ZERO_PENALTY field. */
#define TRACEANDDEBUGALTA_TASKZEROPENALTY_PCP_3_ZERO_PENALTY_Msk (0x1UL << TRACEANDDEBUGALTA_TASKZEROPENALTY_PCP_3_ZERO_PENALTY_Pos) /*!< Bit mask of ZERO_PENALTY field. */
#define TRACEANDDEBUGALTA_TASKZEROPENALTY_PCP_3_ZERO_PENALTY_Set_Zero_Penalty (1UL) /*!< Set Zero Penalty */

/* Register: TRACEANDDEBUGALTA_TASKFULLPENALTY_PCP_3 */
/* Description: TaskFullPenalty register for PCP 3 */

/* Bit 0 :   */
#define TRACEANDDEBUGALTA_TASKFULLPENALTY_PCP_3_FULL_PENALTY_Pos (0UL) /*!< Position of FULL_PENALTY field. */
#define TRACEANDDEBUGALTA_TASKFULLPENALTY_PCP_3_FULL_PENALTY_Msk (0x1UL << TRACEANDDEBUGALTA_TASKFULLPENALTY_PCP_3_FULL_PENALTY_Pos) /*!< Bit mask of FULL_PENALTY field. */
#define TRACEANDDEBUGALTA_TASKFULLPENALTY_PCP_3_FULL_PENALTY_Set_Full_Penalty (1UL) /*!< Set Full Penalty */

/* Register: TRACEANDDEBUGALTA_TASKZEROPENALTY_PCP_2 */
/* Description: TaskZeroPenalty register for PCP 2 */

/* Bit 0 :   */
#define TRACEANDDEBUGALTA_TASKZEROPENALTY_PCP_2_ZERO_PENALTY_Pos (0UL) /*!< Position of ZERO_PENALTY field. */
#define TRACEANDDEBUGALTA_TASKZEROPENALTY_PCP_2_ZERO_PENALTY_Msk (0x1UL << TRACEANDDEBUGALTA_TASKZEROPENALTY_PCP_2_ZERO_PENALTY_Pos) /*!< Bit mask of ZERO_PENALTY field. */
#define TRACEANDDEBUGALTA_TASKZEROPENALTY_PCP_2_ZERO_PENALTY_Set_Zero_Penalty (1UL) /*!< Set Zero Penalty */

/* Register: TRACEANDDEBUGALTA_TASKFULLPENALTY_PCP_2 */
/* Description: TaskFullPenalty register for PCP 2 */

/* Bit 0 :   */
#define TRACEANDDEBUGALTA_TASKFULLPENALTY_PCP_2_FULL_PENALTY_Pos (0UL) /*!< Position of FULL_PENALTY field. */
#define TRACEANDDEBUGALTA_TASKFULLPENALTY_PCP_2_FULL_PENALTY_Msk (0x1UL << TRACEANDDEBUGALTA_TASKFULLPENALTY_PCP_2_FULL_PENALTY_Pos) /*!< Bit mask of FULL_PENALTY field. */
#define TRACEANDDEBUGALTA_TASKFULLPENALTY_PCP_2_FULL_PENALTY_Set_Full_Penalty (1UL) /*!< Set Full Penalty */

/* Register: TRACEANDDEBUGALTA_TASKZEROPENALTY_PCP_1 */
/* Description: TaskZeroPenalty register for PCP 1 */

/* Bit 0 :   */
#define TRACEANDDEBUGALTA_TASKZEROPENALTY_PCP_1_ZERO_PENALTY_Pos (0UL) /*!< Position of ZERO_PENALTY field. */
#define TRACEANDDEBUGALTA_TASKZEROPENALTY_PCP_1_ZERO_PENALTY_Msk (0x1UL << TRACEANDDEBUGALTA_TASKZEROPENALTY_PCP_1_ZERO_PENALTY_Pos) /*!< Bit mask of ZERO_PENALTY field. */
#define TRACEANDDEBUGALTA_TASKZEROPENALTY_PCP_1_ZERO_PENALTY_Set_Zero_Penalty (1UL) /*!< Set Zero Penalty */

/* Register: TRACEANDDEBUGALTA_TASKFULLPENALTY_PCP_1 */
/* Description: TaskFullPenalty register for PCP 1 */

/* Bit 0 :   */
#define TRACEANDDEBUGALTA_TASKFULLPENALTY_PCP_1_FULL_PENALTY_Pos (0UL) /*!< Position of FULL_PENALTY field. */
#define TRACEANDDEBUGALTA_TASKFULLPENALTY_PCP_1_FULL_PENALTY_Msk (0x1UL << TRACEANDDEBUGALTA_TASKFULLPENALTY_PCP_1_FULL_PENALTY_Pos) /*!< Bit mask of FULL_PENALTY field. */
#define TRACEANDDEBUGALTA_TASKFULLPENALTY_PCP_1_FULL_PENALTY_Set_Full_Penalty (1UL) /*!< Set Full Penalty */

/* Register: TRACEANDDEBUGALTA_TASKZEROPENALTY_PCP_0 */
/* Description: TaskZeroPenalty register for PCP 0 */

/* Bit 0 :   */
#define TRACEANDDEBUGALTA_TASKZEROPENALTY_PCP_0_ZERO_PENALTY_Pos (0UL) /*!< Position of ZERO_PENALTY field. */
#define TRACEANDDEBUGALTA_TASKZEROPENALTY_PCP_0_ZERO_PENALTY_Msk (0x1UL << TRACEANDDEBUGALTA_TASKZEROPENALTY_PCP_0_ZERO_PENALTY_Pos) /*!< Bit mask of ZERO_PENALTY field. */
#define TRACEANDDEBUGALTA_TASKZEROPENALTY_PCP_0_ZERO_PENALTY_Set_Zero_Penalty (1UL) /*!< Set Zero Penalty */

/* Register: TRACEANDDEBUGALTA_TASKFULLPENALTY_PCP_0 */
/* Description: TaskFullPenalty register for PCP 0 */

/* Bit 0 :   */
#define TRACEANDDEBUGALTA_TASKFULLPENALTY_PCP_0_FULL_PENALTY_Pos (0UL) /*!< Position of FULL_PENALTY field. */
#define TRACEANDDEBUGALTA_TASKFULLPENALTY_PCP_0_FULL_PENALTY_Msk (0x1UL << TRACEANDDEBUGALTA_TASKFULLPENALTY_PCP_0_FULL_PENALTY_Pos) /*!< Bit mask of FULL_PENALTY field. */
#define TRACEANDDEBUGALTA_TASKFULLPENALTY_PCP_0_FULL_PENALTY_Set_Full_Penalty (1UL) /*!< Set Full Penalty */

/* Register: TRACEANDDEBUGALTA_ENABLEDEBUG */
/* Description: Master enable for PSEL.TraceData[3:0] and PSEL.TraceClk signals */

/* Bit 0 :   */
#define TRACEANDDEBUGALTA_ENABLEDEBUG_ENABLEDEBUG_Pos (0UL) /*!< Position of ENABLEDEBUG field. */
#define TRACEANDDEBUGALTA_ENABLEDEBUG_ENABLEDEBUG_Msk (0x1UL << TRACEANDDEBUGALTA_ENABLEDEBUG_ENABLEDEBUG_Pos) /*!< Bit mask of ENABLEDEBUG field. */
#define TRACEANDDEBUGALTA_ENABLEDEBUG_ENABLEDEBUG_ENABLEDEBUG (1UL) /*!< Master enable for PSEL.TraceData[3:0] and PSEL.TraceClk signals */

/* Register: TRACEANDDEBUGALTA_PSEL_TRACECLK */
/* Description: Pin number configuration for TraceClk signal */

/* Bit 31 : Connection */
#define TRACEANDDEBUGALTA_PSEL_TRACECLK_CONNECT_Pos (31UL) /*!< Position of CONNECT field. */
#define TRACEANDDEBUGALTA_PSEL_TRACECLK_CONNECT_Msk (0x1UL << TRACEANDDEBUGALTA_PSEL_TRACECLK_CONNECT_Pos) /*!< Bit mask of CONNECT field. */
#define TRACEANDDEBUGALTA_PSEL_TRACECLK_CONNECT_Connected (0UL) /*!< Connect */
#define TRACEANDDEBUGALTA_PSEL_TRACECLK_CONNECT_Disconnected (1UL) /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TRACEANDDEBUGALTA_PSEL_TRACECLK_PIN_Pos (0UL) /*!< Position of PIN field. */
#define TRACEANDDEBUGALTA_PSEL_TRACECLK_PIN_Msk (0x1FUL << TRACEANDDEBUGALTA_PSEL_TRACECLK_PIN_Pos) /*!< Bit mask of PIN field. */

/* Register: TRACEANDDEBUGALTA_PSEL_TRACEDATA0 */
/* Description: Pin number configuration for TraceData0 signal */

/* Bit 31 : Connection */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA0_CONNECT_Pos (31UL) /*!< Position of CONNECT field. */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA0_CONNECT_Msk (0x1UL << TRACEANDDEBUGALTA_PSEL_TRACEDATA0_CONNECT_Pos) /*!< Bit mask of CONNECT field. */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA0_CONNECT_Connected (0UL) /*!< Connect */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA0_CONNECT_Disconnected (1UL) /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA0_PIN_Pos (0UL) /*!< Position of PIN field. */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA0_PIN_Msk (0x1FUL << TRACEANDDEBUGALTA_PSEL_TRACEDATA0_PIN_Pos) /*!< Bit mask of PIN field. */

/* Register: TRACEANDDEBUGALTA_PSEL_TRACEDATA1 */
/* Description: Pin number configuration for TraceData1 signal */

/* Bit 31 : Connection */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA1_CONNECT_Pos (31UL) /*!< Position of CONNECT field. */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA1_CONNECT_Msk (0x1UL << TRACEANDDEBUGALTA_PSEL_TRACEDATA1_CONNECT_Pos) /*!< Bit mask of CONNECT field. */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA1_CONNECT_Connected (0UL) /*!< Connect */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA1_CONNECT_Disconnected (1UL) /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA1_PIN_Pos (0UL) /*!< Position of PIN field. */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA1_PIN_Msk (0x1FUL << TRACEANDDEBUGALTA_PSEL_TRACEDATA1_PIN_Pos) /*!< Bit mask of PIN field. */

/* Register: TRACEANDDEBUGALTA_PSEL_TRACEDATA2 */
/* Description: Pin number configuration for TraceData2 signal */

/* Bit 31 : Connection */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA2_CONNECT_Pos (31UL) /*!< Position of CONNECT field. */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA2_CONNECT_Msk (0x1UL << TRACEANDDEBUGALTA_PSEL_TRACEDATA2_CONNECT_Pos) /*!< Bit mask of CONNECT field. */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA2_CONNECT_Connected (0UL) /*!< Connect */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA2_CONNECT_Disconnected (1UL) /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA2_PIN_Pos (0UL) /*!< Position of PIN field. */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA2_PIN_Msk (0x1FUL << TRACEANDDEBUGALTA_PSEL_TRACEDATA2_PIN_Pos) /*!< Bit mask of PIN field. */

