adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Register: TRACEANDDEBUGALTA_PSEL_TRACEDATA3 */
/* Description: Pin number configuration for TraceData3 signal */

/* Bit 31 : Connection */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA3_CONNECT_Pos (31UL) /*!< Position of CONNECT field. */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA3_CONNECT_Msk (0x1UL << TRACEANDDEBUGALTA_PSEL_TRACEDATA3_CONNECT_Pos) /*!< Bit mask of CONNECT field. */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA3_CONNECT_Connected (0UL) /*!< Connect */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA3_CONNECT_Disconnected (1UL) /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA3_PIN_Pos (0UL) /*!< Position of PIN field. */
#define TRACEANDDEBUGALTA_PSEL_TRACEDATA3_PIN_Msk (0x1FUL << TRACEANDDEBUGALTA_PSEL_TRACEDATA3_PIN_Pos) /*!< Bit mask of PIN field. */

/* Register: TRACEANDDEBUGALTA_TRACEPORTSPEED */
/* Description: Trace port speed selection */

/* Bits 1..0 : Speed of Trace Port clock. Note that the TRACECLK pin will output this clock divided by two. */
#define TRACEANDDEBUGALTA_TRACEPORTSPEED_TRACEPORTSPEED_Pos (0UL) /*!< Position of TRACEPORTSPEED field. */
#define TRACEANDDEBUGALTA_TRACEPORTSPEED_TRACEPORTSPEED_Msk (0x3UL << TRACEANDDEBUGALTA_TRACEPORTSPEED_TRACEPORTSPEED_Pos) /*!< Bit mask of TRACEPORTSPEED field. */
#define TRACEANDDEBUGALTA_TRACEPORTSPEED_TRACEPORTSPEED_32MHz (0UL) /*!< 32 MHz Trace Port clock (TRACECLK = 16 MHz) */
#define TRACEANDDEBUGALTA_TRACEPORTSPEED_TRACEPORTSPEED_16MHz (1UL) /*!< 16 MHz Trace Port clock (TRACECLK = 8 MHz) */
#define TRACEANDDEBUGALTA_TRACEPORTSPEED_TRACEPORTSPEED_8MHz (2UL) /*!< 8 MHz Trace Port clock (TRACECLK = 4 MHz) */
#define TRACEANDDEBUGALTA_TRACEPORTSPEED_TRACEPORTSPEED_4MHz (3UL) /*!< 4 MHz Trace Port clock (TRACECLK = 2 MHz) */

/* Register: TRACEANDDEBUGALTA_SWOSEL */
/* Description: Connect the SWO to the TPIU TRACEDATA[0] */

/* Bit 0 :   */
#define TRACEANDDEBUGALTA_SWOSEL_SWOSEL_Pos (0UL) /*!< Position of SWOSEL field. */
#define TRACEANDDEBUGALTA_SWOSEL_SWOSEL_Msk (0x1UL << TRACEANDDEBUGALTA_SWOSEL_SWOSEL_Pos) /*!< Bit mask of SWOSEL field. */
#define TRACEANDDEBUGALTA_SWOSEL_SWOSEL_TRACEDATA0SEL (0UL) /*!< Connect the TRACEDATA[0] to the TPIU TRACEDATA[0] */
#define TRACEANDDEBUGALTA_SWOSEL_SWOSEL_SWOSEL (1UL) /*!< Connect the SWO to the TPIU TRACEDATA[0] */

/* Register: TRACEANDDEBUGALTA_SRAMTSEL */
/* Description: Timing control values for TSMC RAMs */

/* Bits 4..2 : Write cycle timing selection */
#define TRACEANDDEBUGALTA_SRAMTSEL_WTSEL_Pos (2UL) /*!< Position of WTSEL field. */
#define TRACEANDDEBUGALTA_SRAMTSEL_WTSEL_Msk (0x7UL << TRACEANDDEBUGALTA_SRAMTSEL_WTSEL_Pos) /*!< Bit mask of WTSEL field. */

/* Bits 1..0 : Read cycle timing selection */
#define TRACEANDDEBUGALTA_SRAMTSEL_RTSEL_Pos (0UL) /*!< Position of RTSEL field. */
#define TRACEANDDEBUGALTA_SRAMTSEL_RTSEL_Msk (0x3UL << TRACEANDDEBUGALTA_SRAMTSEL_RTSEL_Pos) /*!< Bit mask of RTSEL field. */

/* Register: TRACEANDDEBUGALTA_PENALTY_REG */
/* Description: Description collection: Penalty register for PCP n */

/* Bits 1..0 : Penalty Level */
#define TRACEANDDEBUGALTA_PENALTY_REG_PENALTY_Pos (0UL) /*!< Position of PENALTY field. */
#define TRACEANDDEBUGALTA_PENALTY_REG_PENALTY_Msk (0x3UL << TRACEANDDEBUGALTA_PENALTY_REG_PENALTY_Pos) /*!< Bit mask of PENALTY field. */
#define TRACEANDDEBUGALTA_PENALTY_REG_PENALTY_Full (0UL) /*!< (Auto 0) Full penalty) */
#define TRACEANDDEBUGALTA_PENALTY_REG_PENALTY_Semi1 (1UL) /*!< (Auto 1) Semi (power on, clock off) */
#define TRACEANDDEBUGALTA_PENALTY_REG_PENALTY_Semi0 (2UL) /*!< (Auto 2) Semi (power on, clock core on, clock buffer off) */
#define TRACEANDDEBUGALTA_PENALTY_REG_PENALTY_Zero (3UL) /*!< (Auto 3) Zero penalty */

/* Register: TRACEANDDEBUGALTA_FORCE_OVERRIDE */
/* Description: Description collection: Force override register for PCP n */

/* Bit 15 :   */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_DISABLE_Pos (15UL) /*!< Position of DISABLE field. */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_DISABLE_Msk (0x1UL << TRACEANDDEBUGALTA_FORCE_OVERRIDE_DISABLE_Pos) /*!< Bit mask of DISABLE field. */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_DISABLE_Disable (0UL) /*!< all forcing disabled */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_DISABLE_Enable (1UL) /*!< all forcing enabled */

/* Bit 9 :   */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CORE_POWER_REQUEST_Pos (9UL) /*!< Position of CORE_POWER_REQUEST field. */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CORE_POWER_REQUEST_Msk (0x1UL << TRACEANDDEBUGALTA_FORCE_OVERRIDE_CORE_POWER_REQUEST_Pos) /*!< Bit mask of CORE_POWER_REQUEST field. */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CORE_POWER_REQUEST_REQ0 (0UL) /*!< powerRequest.core = 0 */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CORE_POWER_REQUEST_REQ1 (1UL) /*!< powerRequest.core = 1 */

/* Bit 8 :   */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_POWER_SWITCH_REQUEST_Pos (8UL) /*!< Position of POWER_SWITCH_REQUEST field. */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_POWER_SWITCH_REQUEST_Msk (0x1UL << TRACEANDDEBUGALTA_FORCE_OVERRIDE_POWER_SWITCH_REQUEST_Pos) /*!< Bit mask of POWER_SWITCH_REQUEST field. */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_POWER_SWITCH_REQUEST_REQ0 (0UL) /*!< powerRequest.switch = 0 */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_POWER_SWITCH_REQUEST_REQ1 (1UL) /*!< powerRequest.switch = 1 */

/* Bit 7 :   */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CLOCK_FORCING_Pos (7UL) /*!< Position of CLOCK_FORCING field. */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CLOCK_FORCING_Msk (0x1UL << TRACEANDDEBUGALTA_FORCE_OVERRIDE_CLOCK_FORCING_Pos) /*!< Bit mask of CLOCK_FORCING field. */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CLOCK_FORCING_FORCE0 (0UL) /*!< All clock forcing  disabled */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CLOCK_FORCING_FORCE1 (1UL) /*!< All clock forcing  enabled */

/* Bit 3 :   */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CORE_CLOCK_REQUEST_Pos (3UL) /*!< Position of CORE_CLOCK_REQUEST field. */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CORE_CLOCK_REQUEST_Msk (0x1UL << TRACEANDDEBUGALTA_FORCE_OVERRIDE_CORE_CLOCK_REQUEST_Pos) /*!< Bit mask of CORE_CLOCK_REQUEST field. */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CORE_CLOCK_REQUEST_REQ0 (0UL) /*!< clockRequest.core = 0 */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CORE_CLOCK_REQUEST_REQ1 (1UL) /*!< clockRequest.core = 1 */

/* Bit 2 :   */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CLOCK_BUFFER_REQUEST_Pos (2UL) /*!< Position of CLOCK_BUFFER_REQUEST field. */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CLOCK_BUFFER_REQUEST_Msk (0x1UL << TRACEANDDEBUGALTA_FORCE_OVERRIDE_CLOCK_BUFFER_REQUEST_Pos) /*!< Bit mask of CLOCK_BUFFER_REQUEST field. */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CLOCK_BUFFER_REQUEST_REQ0 (0UL) /*!< clockRequest.buff = 0 */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CLOCK_BUFFER_REQUEST_REQ1 (1UL) /*!< clockRequest.buff = 1 */

/* Bit 1 :   */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_Pos (1UL) /*!< Position of CLOCK_SWITCH_REQUEST field. */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_Msk (0x1UL << TRACEANDDEBUGALTA_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_Pos) /*!< Bit mask of CLOCK_SWITCH_REQUEST field. */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_REQ0 (0UL) /*!< clockRequest.switch = 0 */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_REQ1 (1UL) /*!< clockRequest.switch = 1 */

