adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 0 :   */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_A_Pos (0UL) /*!< Position of CLOCK_SWITCH_REQUEST_A field. */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_A_Msk (0x1UL << TRACEANDDEBUGALTA_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_A_Pos) /*!< Bit mask of CLOCK_SWITCH_REQUEST_A field. */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_A_REQ0 (0UL) /*!< clockRequest.switch_a = 0 */
#define TRACEANDDEBUGALTA_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_A_REQ1 (1UL) /*!< clockRequest.switch_a = 1 */

/* Register: TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ */
/* Description: Turn of the automatic clock request. */

/* Bit 3 :   */
#define TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_3_Pos (3UL) /*!< Position of CLOCK_START_PCP_3 field. */
#define TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_3_Msk (0x1UL << TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_3_Pos) /*!< Bit mask of CLOCK_START_PCP_3 field. */
#define TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_3_NORMAL_PCP_3 (0UL) /*!< normal clock start for PCP 3 */
#define TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_3_OFF_PCP_3 (1UL) /*!< turn off normal clock start for PCP 3 */

/* Bit 2 :   */
#define TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_2_Pos (2UL) /*!< Position of CLOCK_START_PCP_2 field. */
#define TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_2_Msk (0x1UL << TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_2_Pos) /*!< Bit mask of CLOCK_START_PCP_2 field. */
#define TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_2_NORMAL_PCP_2 (0UL) /*!< normal clock start for PCP 2 */
#define TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_2_OFF_PCP_2 (1UL) /*!< turn off normal clock start for PCP 2 */

/* Bit 1 :   */
#define TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_1_Pos (1UL) /*!< Position of CLOCK_START_PCP_1 field. */
#define TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_1_Msk (0x1UL << TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_1_Pos) /*!< Bit mask of CLOCK_START_PCP_1 field. */
#define TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_1_NORMAL_PCP_1 (0UL) /*!< normal clock start for PCP 1 */
#define TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_1_OFF_PCP_1 (1UL) /*!< turn off normal clock start for PCP 1 */

/* Bit 0 :   */
#define TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_0_Pos (0UL) /*!< Position of CLOCK_START_PCP_0 field. */
#define TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_0_Msk (0x1UL << TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_0_Pos) /*!< Bit mask of CLOCK_START_PCP_0 field. */
#define TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_0_NORMAL_PCP_0 (0UL) /*!< normal clock start for PCP 0 */
#define TRACEANDDEBUGALTA_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_0_OFF_PCP_0 (1UL) /*!< turn off normal clock start for PCP 0 */


/* Peripheral: UARTE */
/* Description: UART with EasyDMA */

/* Register: UARTE_TASKS_STARTRX */
/* Description: Start UART receiver */

/* Bit 0 : Start UART receiver */
#define UARTE_TASKS_STARTRX_TASKS_STARTRX_Pos (0UL) /*!< Position of TASKS_STARTRX field. */
#define UARTE_TASKS_STARTRX_TASKS_STARTRX_Msk (0x1UL << UARTE_TASKS_STARTRX_TASKS_STARTRX_Pos) /*!< Bit mask of TASKS_STARTRX field. */
#define UARTE_TASKS_STARTRX_TASKS_STARTRX_Trigger (1UL) /*!< Trigger task */

/* Register: UARTE_TASKS_STOPRX */
/* Description: Stop UART receiver */

/* Bit 0 : Stop UART receiver */
#define UARTE_TASKS_STOPRX_TASKS_STOPRX_Pos (0UL) /*!< Position of TASKS_STOPRX field. */
#define UARTE_TASKS_STOPRX_TASKS_STOPRX_Msk (0x1UL << UARTE_TASKS_STOPRX_TASKS_STOPRX_Pos) /*!< Bit mask of TASKS_STOPRX field. */
#define UARTE_TASKS_STOPRX_TASKS_STOPRX_Trigger (1UL) /*!< Trigger task */

/* Register: UARTE_TASKS_STARTTX */
/* Description: Start UART transmitter */

/* Bit 0 : Start UART transmitter */
#define UARTE_TASKS_STARTTX_TASKS_STARTTX_Pos (0UL) /*!< Position of TASKS_STARTTX field. */
#define UARTE_TASKS_STARTTX_TASKS_STARTTX_Msk (0x1UL << UARTE_TASKS_STARTTX_TASKS_STARTTX_Pos) /*!< Bit mask of TASKS_STARTTX field. */
#define UARTE_TASKS_STARTTX_TASKS_STARTTX_Trigger (1UL) /*!< Trigger task */

/* Register: UARTE_TASKS_STOPTX */
/* Description: Stop UART transmitter */

/* Bit 0 : Stop UART transmitter */
#define UARTE_TASKS_STOPTX_TASKS_STOPTX_Pos (0UL) /*!< Position of TASKS_STOPTX field. */
#define UARTE_TASKS_STOPTX_TASKS_STOPTX_Msk (0x1UL << UARTE_TASKS_STOPTX_TASKS_STOPTX_Pos) /*!< Bit mask of TASKS_STOPTX field. */
#define UARTE_TASKS_STOPTX_TASKS_STOPTX_Trigger (1UL) /*!< Trigger task */

/* Register: UARTE_TASKS_SUSPEND */
/* Description: Suspend UART transaction */

/* Bit 0 : Suspend UART transaction */
#define UARTE_TASKS_SUSPEND_TASKS_SUSPEND_Pos (0UL) /*!< Position of TASKS_SUSPEND field. */
#define UARTE_TASKS_SUSPEND_TASKS_SUSPEND_Msk (0x1UL << UARTE_TASKS_SUSPEND_TASKS_SUSPEND_Pos) /*!< Bit mask of TASKS_SUSPEND field. */
#define UARTE_TASKS_SUSPEND_TASKS_SUSPEND_Trigger (1UL) /*!< Trigger task */

/* Register: UARTE_TASKS_RESUME */
/* Description: Resume UART transaction */

/* Bit 0 : Resume UART transaction */
#define UARTE_TASKS_RESUME_TASKS_RESUME_Pos (0UL) /*!< Position of TASKS_RESUME field. */
#define UARTE_TASKS_RESUME_TASKS_RESUME_Msk (0x1UL << UARTE_TASKS_RESUME_TASKS_RESUME_Pos) /*!< Bit mask of TASKS_RESUME field. */
#define UARTE_TASKS_RESUME_TASKS_RESUME_Trigger (1UL) /*!< Trigger task */

/* Register: UARTE_TASKS_FLUSHRX */
/* Description: Flush RX FIFO into RX buffer */

/* Bit 0 : Flush RX FIFO into RX buffer */
#define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Pos (0UL) /*!< Position of TASKS_FLUSHRX field. */
#define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Msk (0x1UL << UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Pos) /*!< Bit mask of TASKS_FLUSHRX field. */
#define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Trigger (1UL) /*!< Trigger task */

/* Register: UARTE_EVENTS_CTS */
/* Description: CTS is activated (set low). Clear To Send. */

