adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bits 31..0 : Data pointer */
#define UARTE_RXD_PTR_PTR_Pos (0UL) /*!< Position of PTR field. */
#define UARTE_RXD_PTR_PTR_Msk (0xFFFFFFFFUL << UARTE_RXD_PTR_PTR_Pos) /*!< Bit mask of PTR field. */

/* Register: UARTE_RXD_MAXCNT */
/* Description: Maximum number of bytes in receive buffer */

/* Bits 7..0 : Maximum number of bytes in receive buffer */
#define UARTE_RXD_MAXCNT_MAXCNT_Pos (0UL) /*!< Position of MAXCNT field. */
#define UARTE_RXD_MAXCNT_MAXCNT_Msk (0xFFUL << UARTE_RXD_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field. */

/* Register: UARTE_RXD_AMOUNT */
/* Description: Number of bytes transferred in the last transaction */

/* Bits 7..0 : Number of bytes transferred in the last transaction */
#define UARTE_RXD_AMOUNT_AMOUNT_Pos (0UL) /*!< Position of AMOUNT field. */
#define UARTE_RXD_AMOUNT_AMOUNT_Msk (0xFFUL << UARTE_RXD_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field. */

/* Register: UARTE_TXD_PTR */
/* Description: Data pointer */

/* Bits 31..0 : Data pointer */
#define UARTE_TXD_PTR_PTR_Pos (0UL) /*!< Position of PTR field. */
#define UARTE_TXD_PTR_PTR_Msk (0xFFFFFFFFUL << UARTE_TXD_PTR_PTR_Pos) /*!< Bit mask of PTR field. */

/* Register: UARTE_TXD_MAXCNT */
/* Description: Maximum number of bytes in transmit buffer */

/* Bits 7..0 : Maximum number of bytes in transmit buffer */
#define UARTE_TXD_MAXCNT_MAXCNT_Pos (0UL) /*!< Position of MAXCNT field. */
#define UARTE_TXD_MAXCNT_MAXCNT_Msk (0xFFUL << UARTE_TXD_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field. */

/* Register: UARTE_TXD_AMOUNT */
/* Description: Number of bytes transferred in the last transaction */

/* Bits 7..0 : Number of bytes transferred in the last transaction */
#define UARTE_TXD_AMOUNT_AMOUNT_Pos (0UL) /*!< Position of AMOUNT field. */
#define UARTE_TXD_AMOUNT_AMOUNT_Msk (0xFFUL << UARTE_TXD_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field. */

/* Register: UARTE_CONFIG */
/* Description: Configuration of parity and hardware flow control */

/* Bits 3..1 : Parity */
#define UARTE_CONFIG_PARITY_Pos (1UL) /*!< Position of PARITY field. */
#define UARTE_CONFIG_PARITY_Msk (0x7UL << UARTE_CONFIG_PARITY_Pos) /*!< Bit mask of PARITY field. */
#define UARTE_CONFIG_PARITY_Excluded (0x0UL) /*!< Exclude parity bit */
#define UARTE_CONFIG_PARITY_Included (0x7UL) /*!< Include parity bit */

/* Bit 0 : Hardware flow control */
#define UARTE_CONFIG_HWFC_Pos (0UL) /*!< Position of HWFC field. */
#define UARTE_CONFIG_HWFC_Msk (0x1UL << UARTE_CONFIG_HWFC_Pos) /*!< Bit mask of HWFC field. */
#define UARTE_CONFIG_HWFC_Disabled (0UL) /*!< Disabled */
#define UARTE_CONFIG_HWFC_Enabled (1UL) /*!< Enabled */

/* Register: UARTE_POWER */
/* Description: Peripheral power control */

/* Bit 0 : Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again. */
#define UARTE_POWER_POWER_Pos (0UL) /*!< Position of POWER field. */
#define UARTE_POWER_POWER_Msk (0x1UL << UARTE_POWER_POWER_Pos) /*!< Bit mask of POWER field. */
#define UARTE_POWER_POWER_Disabled (0UL) /*!< Peripheral is powered off */
#define UARTE_POWER_POWER_Enabled (1UL) /*!< Peripheral is powered on */


/* Peripheral: UICR */
/* Description: User Information Configuration Registers */

/* Register: UICR_NCKLOCK */
/* Description: Description collection: Encrypted unlock code data for network lock n */

/* Bits 31..0 : Encrypted unlock code data, word n */
#define UICR_NCKLOCK_NCKLOCK_Pos (0UL) /*!< Position of NCKLOCK field. */
#define UICR_NCKLOCK_NCKLOCK_Msk (0xFFFFFFFFUL << UICR_NCKLOCK_NCKLOCK_Pos) /*!< Bit mask of NCKLOCK field. */

/* Register: UICR_NSCKLOCK */
/* Description: Description collection: Encrypted unlock code data for network subset lock n */

/* Bits 31..0 : Encrypted unlock code data, word n */
#define UICR_NSCKLOCK_NSCKLOCK_Pos (0UL) /*!< Position of NSCKLOCK field. */
#define UICR_NSCKLOCK_NSCKLOCK_Msk (0xFFFFFFFFUL << UICR_NSCKLOCK_NSCKLOCK_Pos) /*!< Bit mask of NSCKLOCK field. */

/* Register: UICR_SPCKLOCK */
/* Description: Description collection: Encrypted unlock code data for service provider lock n */

/* Bits 31..0 : Encrypted unlock code data, word n */
#define UICR_SPCKLOCK_SPCKLOCK_Pos (0UL) /*!< Position of SPCKLOCK field. */
#define UICR_SPCKLOCK_SPCKLOCK_Msk (0xFFFFFFFFUL << UICR_SPCKLOCK_SPCKLOCK_Pos) /*!< Bit mask of SPCKLOCK field. */

/* Register: UICR_CCKLOCK */
/* Description: Description collection: Encrypted unlock code data for corporate lock n */

/* Bits 31..0 : Encrypted unlock code data, word n */
#define UICR_CCKLOCK_CCKLOCK_Pos (0UL) /*!< Position of CCKLOCK field. */
#define UICR_CCKLOCK_CCKLOCK_Msk (0xFFFFFFFFUL << UICR_CCKLOCK_CCKLOCK_Pos) /*!< Bit mask of CCKLOCK field. */

/* Register: UICR_PCKLOCK */
/* Description: Description collection: Encrypted unlock code data for SIM/USIM lock n */

/* Bits 31..0 : Encrypted unlock code data, word n */
#define UICR_PCKLOCK_PCKLOCK_Pos (0UL) /*!< Position of PCKLOCK field. */
#define UICR_PCKLOCK_PCKLOCK_Msk (0xFFFFFFFFUL << UICR_PCKLOCK_PCKLOCK_Pos) /*!< Bit mask of PCKLOCK field. */

/* Register: UICR_MASTERLOCK */
/* Description: Description collection: Space reservation for encrypted master unlock code data n */

/* Bits 31..0 : Encrypted unlock code data, word n */
#define UICR_MASTERLOCK_MASTERLOCK_Pos (0UL) /*!< Position of MASTERLOCK field. */
#define UICR_MASTERLOCK_MASTERLOCK_Msk (0xFFFFFFFFUL << UICR_MASTERLOCK_MASTERLOCK_Pos) /*!< Bit mask of MASTERLOCK field. */

/* Register: UICR_PROVIS */
/* Description: Description collection: Provisioning data n */

/* Bits 31..0 : Customer provisioning data, word n */
#define UICR_PROVIS_PROVIS_Pos (0UL) /*!< Position of PROVIS field. */
#define UICR_PROVIS_PROVIS_Msk (0xFFFFFFFFUL << UICR_PROVIS_PROVIS_Pos) /*!< Bit mask of PROVIS field. */

/* Register: UICR_CUSTIMEI */
/* Description: Description collection: Customer IMEI n, used if FICR-&gt;IMEI 
                is not programmed */

/* Bits 31..0 : Customer IMEI in BCD decoded nibbles */
#define UICR_CUSTIMEI_CIMEI_Pos (0UL) /*!< Position of CIMEI field. */
#define UICR_CUSTIMEI_CIMEI_Msk (0xFFFFFFFFUL << UICR_CUSTIMEI_CIMEI_Pos) /*!< Bit mask of CIMEI field. */

/* Register: UICR_CUSTMAC0 */
/* Description: Description collection: Customer MAC0 n, used if FICR-&gt;MAC0 
                is not programmed */

/* Bits 31..0 : Customer MAC0 value */
#define UICR_CUSTMAC0_CUSTMAC0_Pos (0UL) /*!< Position of CUSTMAC0 field. */
#define UICR_CUSTMAC0_CUSTMAC0_Msk (0xFFFFFFFFUL << UICR_CUSTMAC0_CUSTMAC0_Pos) /*!< Bit mask of CUSTMAC0 field. */

/* Register: UICR_CUSTMAC1 */
/* Description: Description collection: Customer MAC1 n, used if FICR-&gt;MAC1 
                is not programmed */

/* Bits 31..0 : Customer MAC1 value */
#define UICR_CUSTMAC1_CUSTMAC1_Pos (0UL) /*!< Position of CUSTMAC1 field. */
#define UICR_CUSTMAC1_CUSTMAC1_Msk (0xFFFFFFFFUL << UICR_CUSTMAC1_CUSTMAC1_Pos) /*!< Bit mask of CUSTMAC1 field. */

/* Register: UICR_CUSTMAC2 */
/* Description: Description collection: Customer MAC2 n, used if FICR-&gt;MAC2 
                is not programmed */

