adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bits 31..0 : Customer MAC2 value */
#define UICR_CUSTMAC2_CUSTMAC2_Pos (0UL) /*!< Position of CUSTMAC2 field. */
#define UICR_CUSTMAC2_CUSTMAC2_Msk (0xFFFFFFFFUL << UICR_CUSTMAC2_CUSTMAC2_Pos) /*!< Bit mask of CUSTMAC2 field. */

/* Register: UICR_CUSTMAC3 */
/* Description: Description collection: Customer MAC3 n, used if FICR-&gt;MAC3 
                  is not programmed */

/* Bits 31..0 : Customer MAC3 value */
#define UICR_CUSTMAC3_CUSTMAC3_Pos (0UL) /*!< Position of CUSTMAC3 field. */
#define UICR_CUSTMAC3_CUSTMAC3_Msk (0xFFFFFFFFUL << UICR_CUSTMAC3_CUSTMAC3_Pos) /*!< Bit mask of CUSTMAC3 field. */

/* Register: UICR_CUSTDEVCONF */
/* Description: Description collection: Customer device configuration n, may be used to further 
                  limit configuration done by FICR-&gt;DEVCONF */

/* Bits 31..0 : Customer device configuration data word n,
                  contents defined in SW */
#define UICR_CUSTDEVCONF_CUSTDEVCONF_Pos (0UL) /*!< Position of CUSTDEVCONF field. */
#define UICR_CUSTDEVCONF_CUSTDEVCONF_Msk (0xFFFFFFFFUL << UICR_CUSTDEVCONF_CUSTDEVCONF_Pos) /*!< Bit mask of CUSTDEVCONF field. */


/* Peripheral: VMC */
/* Description: Volatile Memory controller */

/* Register: VMC_RAM_POWER */
/* Description: Description cluster: RAMn power control register */

/* Bit 17 : Unused retention control bit */
#define VMC_RAM_POWER_UNUSED_RETENTION1_Pos (17UL) /*!< Position of UNUSED_RETENTION1 field. */
#define VMC_RAM_POWER_UNUSED_RETENTION1_Msk (0x1UL << VMC_RAM_POWER_UNUSED_RETENTION1_Pos) /*!< Bit mask of UNUSED_RETENTION1 field. */

/* Bit 16 : Unused retention control bit */
#define VMC_RAM_POWER_S01RETENTION_Pos (16UL) /*!< Position of S01RETENTION field. */
#define VMC_RAM_POWER_S01RETENTION_Msk (0x1UL << VMC_RAM_POWER_S01RETENTION_Pos) /*!< Bit mask of S01RETENTION field. */

/* Bit 1 : Unused power control bit */
#define VMC_RAM_POWER_UNUSED_POWER1_Pos (1UL) /*!< Position of UNUSED_POWER1 field. */
#define VMC_RAM_POWER_UNUSED_POWER1_Msk (0x1UL << VMC_RAM_POWER_UNUSED_POWER1_Pos) /*!< Bit mask of UNUSED_POWER1 field. */

/* Bit 0 : Unused power control bit */
#define VMC_RAM_POWER_S01POWER_Pos (0UL) /*!< Position of S01POWER field. */
#define VMC_RAM_POWER_S01POWER_Msk (0x1UL << VMC_RAM_POWER_S01POWER_Pos) /*!< Bit mask of S01POWER field. */

/* Register: VMC_RAM_POWERSET */
/* Description: Description cluster: RAMn power control set register */

/* Bit 17 : Unused retention set control bit */
#define VMC_RAM_POWERSET_UNUSED_RETENTION1_Pos (17UL) /*!< Position of UNUSED_RETENTION1 field. */
#define VMC_RAM_POWERSET_UNUSED_RETENTION1_Msk (0x1UL << VMC_RAM_POWERSET_UNUSED_RETENTION1_Pos) /*!< Bit mask of UNUSED_RETENTION1 field. */

/* Bit 16 : Unused power control bit */
#define VMC_RAM_POWERSET_S01RETENTION_Pos (16UL) /*!< Position of S01RETENTION field. */
#define VMC_RAM_POWERSET_S01RETENTION_Msk (0x1UL << VMC_RAM_POWERSET_S01RETENTION_Pos) /*!< Bit mask of S01RETENTION field. */

/* Bit 1 : Unused power set control bit */
#define VMC_RAM_POWERSET_UNUSED_POWER1_Pos (1UL) /*!< Position of UNUSED_POWER1 field. */
#define VMC_RAM_POWERSET_UNUSED_POWER1_Msk (0x1UL << VMC_RAM_POWERSET_UNUSED_POWER1_Pos) /*!< Bit mask of UNUSED_POWER1 field. */

/* Bit 0 : Unused power control bit */
#define VMC_RAM_POWERSET_S01POWER_Pos (0UL) /*!< Position of S01POWER field. */
#define VMC_RAM_POWERSET_S01POWER_Msk (0x1UL << VMC_RAM_POWERSET_S01POWER_Pos) /*!< Bit mask of S01POWER field. */

/* Register: VMC_RAM_POWERCLR */
/* Description: Description cluster: RAMn power control clear register */

/* Bit 17 : Unused retention clear control bit */
#define VMC_RAM_POWERCLR_UNUSED_RETENTION1_Pos (17UL) /*!< Position of UNUSED_RETENTION1 field. */
#define VMC_RAM_POWERCLR_UNUSED_RETENTION1_Msk (0x1UL << VMC_RAM_POWERCLR_UNUSED_RETENTION1_Pos) /*!< Bit mask of UNUSED_RETENTION1 field. */

/* Bit 16 : Unused power control bit */
#define VMC_RAM_POWERCLR_S01RETENTION_Pos (16UL) /*!< Position of S01RETENTION field. */
#define VMC_RAM_POWERCLR_S01RETENTION_Msk (0x1UL << VMC_RAM_POWERCLR_S01RETENTION_Pos) /*!< Bit mask of S01RETENTION field. */

/* Bit 1 : Unused power clear control bit */
#define VMC_RAM_POWERCLR_UNUSED_POWER1_Pos (1UL) /*!< Position of UNUSED_POWER1 field. */
#define VMC_RAM_POWERCLR_UNUSED_POWER1_Msk (0x1UL << VMC_RAM_POWERCLR_UNUSED_POWER1_Pos) /*!< Bit mask of UNUSED_POWER1 field. */

/* Bit 0 : Unused power control bit */
#define VMC_RAM_POWERCLR_S01POWER_Pos (0UL) /*!< Position of S01POWER field. */
#define VMC_RAM_POWERCLR_S01POWER_Msk (0x1UL << VMC_RAM_POWERCLR_S01POWER_Pos) /*!< Bit mask of S01POWER field. */

/* Register: VMC_RAMA_POWER */
/* Description: RAM B{n} power control register */

/* Bit 31 : Unused retention bit 14 */
#define VMC_RAMA_POWER_UNUSED_RETENTION14_Pos (31UL) /*!< Position of UNUSED_RETENTION14 field. */
#define VMC_RAMA_POWER_UNUSED_RETENTION14_Msk (0x1UL << VMC_RAMA_POWER_UNUSED_RETENTION14_Pos) /*!< Bit mask of UNUSED_RETENTION14 field. */

/* Bit 30 : Unused retention bit 13 */
#define VMC_RAMA_POWER_UNUSED_RETENTION13_Pos (30UL) /*!< Position of UNUSED_RETENTION13 field. */
#define VMC_RAMA_POWER_UNUSED_RETENTION13_Msk (0x1UL << VMC_RAMA_POWER_UNUSED_RETENTION13_Pos) /*!< Bit mask of UNUSED_RETENTION13 field. */

/* Bit 29 : Unused retention bit 12 */
#define VMC_RAMA_POWER_UNUSED_RETENTION12_Pos (29UL) /*!< Position of UNUSED_RETENTION12 field. */
#define VMC_RAMA_POWER_UNUSED_RETENTION12_Msk (0x1UL << VMC_RAMA_POWER_UNUSED_RETENTION12_Pos) /*!< Bit mask of UNUSED_RETENTION12 field. */

/* Bit 28 : Unused retention bit 11 */
#define VMC_RAMA_POWER_UNUSED_RETENTION11_Pos (28UL) /*!< Position of UNUSED_RETENTION11 field. */
#define VMC_RAMA_POWER_UNUSED_RETENTION11_Msk (0x1UL << VMC_RAMA_POWER_UNUSED_RETENTION11_Pos) /*!< Bit mask of UNUSED_RETENTION11 field. */

/* Bit 27 : Unused retention bit 10 */
#define VMC_RAMA_POWER_UNUSED_RETENTION10_Pos (27UL) /*!< Position of UNUSED_RETENTION10 field. */
#define VMC_RAMA_POWER_UNUSED_RETENTION10_Msk (0x1UL << VMC_RAMA_POWER_UNUSED_RETENTION10_Pos) /*!< Bit mask of UNUSED_RETENTION10 field. */

