adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 21 : Unused retention bit 4 */
#define VMC_RAMB_POWER_UNUSED_RETENTION4_Pos (21UL) /*!< Position of UNUSED_RETENTION4 field. */
#define VMC_RAMB_POWER_UNUSED_RETENTION4_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_RETENTION4_Pos) /*!< Bit mask of UNUSED_RETENTION4 field. */

/* Bit 20 : Unused retention bit 3 */
#define VMC_RAMB_POWER_UNUSED_RETENTION3_Pos (20UL) /*!< Position of UNUSED_RETENTION3 field. */
#define VMC_RAMB_POWER_UNUSED_RETENTION3_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_RETENTION3_Pos) /*!< Bit mask of UNUSED_RETENTION3 field. */

/* Bit 19 : Unused retention bit 2 */
#define VMC_RAMB_POWER_UNUSED_RETENTION2_Pos (19UL) /*!< Position of UNUSED_RETENTION2 field. */
#define VMC_RAMB_POWER_UNUSED_RETENTION2_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_RETENTION2_Pos) /*!< Bit mask of UNUSED_RETENTION2 field. */

/* Bit 18 : Unused retention bit 1 */
#define VMC_RAMB_POWER_UNUSED_RETENTION1_Pos (18UL) /*!< Position of UNUSED_RETENTION1 field. */
#define VMC_RAMB_POWER_UNUSED_RETENTION1_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_RETENTION1_Pos) /*!< Bit mask of UNUSED_RETENTION1 field. */

/* Bit 17 : Unused retention bit 0 */
#define VMC_RAMB_POWER_UNUSED_RETENTION0_Pos (17UL) /*!< Position of UNUSED_RETENTION0 field. */
#define VMC_RAMB_POWER_UNUSED_RETENTION0_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_RETENTION0_Pos) /*!< Bit mask of UNUSED_RETENTION0 field. */

/* Bit 16 : Keep retention on RAM section S0-S15 of RAM Bn when RAM section is switched off */
#define VMC_RAMB_POWER_S015RETENTION_Pos (16UL) /*!< Position of S015RETENTION field. */
#define VMC_RAMB_POWER_S015RETENTION_Msk (0x1UL << VMC_RAMB_POWER_S015RETENTION_Pos) /*!< Bit mask of S015RETENTION field. */
#define VMC_RAMB_POWER_S015RETENTION_Off (0UL) /*!< Off */
#define VMC_RAMB_POWER_S015RETENTION_On (1UL) /*!< On */

/* Bit 11 : Unused power bit 10 */
#define VMC_RAMB_POWER_UNUSED_POWER10_Pos (11UL) /*!< Position of UNUSED_POWER10 field. */
#define VMC_RAMB_POWER_UNUSED_POWER10_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER10_Pos) /*!< Bit mask of UNUSED_POWER10 field. */

/* Bit 10 : Unused power bit 9 */
#define VMC_RAMB_POWER_UNUSED_POWER9_Pos (10UL) /*!< Position of UNUSED_POWER9 field. */
#define VMC_RAMB_POWER_UNUSED_POWER9_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER9_Pos) /*!< Bit mask of UNUSED_POWER9 field. */

/* Bit 9 : Unused power bit 8 */
#define VMC_RAMB_POWER_UNUSED_POWER8_Pos (9UL) /*!< Position of UNUSED_POWER8 field. */
#define VMC_RAMB_POWER_UNUSED_POWER8_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER8_Pos) /*!< Bit mask of UNUSED_POWER8 field. */

/* Bit 8 : Unused power bit 7 */
#define VMC_RAMB_POWER_UNUSED_POWER7_Pos (8UL) /*!< Position of UNUSED_POWER7 field. */
#define VMC_RAMB_POWER_UNUSED_POWER7_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER7_Pos) /*!< Bit mask of UNUSED_POWER7 field. */

/* Bit 7 : Unused power bit 6 */
#define VMC_RAMB_POWER_UNUSED_POWER6_Pos (7UL) /*!< Position of UNUSED_POWER6 field. */
#define VMC_RAMB_POWER_UNUSED_POWER6_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER6_Pos) /*!< Bit mask of UNUSED_POWER6 field. */

/* Bit 6 : Unused power bit 5 */
#define VMC_RAMB_POWER_UNUSED_POWER5_Pos (6UL) /*!< Position of UNUSED_POWER5 field. */
#define VMC_RAMB_POWER_UNUSED_POWER5_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER5_Pos) /*!< Bit mask of UNUSED_POWER5 field. */

/* Bit 5 : Unused power bit 4 */
#define VMC_RAMB_POWER_UNUSED_POWER4_Pos (5UL) /*!< Position of UNUSED_POWER4 field. */
#define VMC_RAMB_POWER_UNUSED_POWER4_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER4_Pos) /*!< Bit mask of UNUSED_POWER4 field. */

/* Bit 4 : Unused power bit 3 */
#define VMC_RAMB_POWER_UNUSED_POWER3_Pos (4UL) /*!< Position of UNUSED_POWER3 field. */
#define VMC_RAMB_POWER_UNUSED_POWER3_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER3_Pos) /*!< Bit mask of UNUSED_POWER3 field. */

/* Bit 3 : Unused power bit 2 */
#define VMC_RAMB_POWER_UNUSED_POWER2_Pos (3UL) /*!< Position of UNUSED_POWER2 field. */
#define VMC_RAMB_POWER_UNUSED_POWER2_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER2_Pos) /*!< Bit mask of UNUSED_POWER2 field. */

/* Bit 2 : Unused power bit 1 */
#define VMC_RAMB_POWER_UNUSED_POWER1_Pos (2UL) /*!< Position of UNUSED_POWER1 field. */
#define VMC_RAMB_POWER_UNUSED_POWER1_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER1_Pos) /*!< Bit mask of UNUSED_POWER1 field. */

/* Bit 1 : Unused power bit 0 */
#define VMC_RAMB_POWER_UNUSED_POWER0_Pos (1UL) /*!< Position of UNUSED_POWER0 field. */
#define VMC_RAMB_POWER_UNUSED_POWER0_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER0_Pos) /*!< Bit mask of UNUSED_POWER0 field. */

/* Bit 0 : Keep RAM sections S0-S15 of RAM Bn on or off in System ON mode */
#define VMC_RAMB_POWER_S015POWER_Pos (0UL) /*!< Position of S015POWER field. */
#define VMC_RAMB_POWER_S015POWER_Msk (0x1UL << VMC_RAMB_POWER_S015POWER_Pos) /*!< Bit mask of S015POWER field. */
#define VMC_RAMB_POWER_S015POWER_Off (0UL) /*!< Off */
#define VMC_RAMB_POWER_S015POWER_On (1UL) /*!< On */

/* Register: VMC_RAMB_POWERSET */
/* Description: Description cluster: RAM Bn power control set register */

/* Bit 27 : Unused retention set bit 10 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION10_Pos (27UL) /*!< Position of UNUSED_RETENTION10 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION10_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION10_Pos) /*!< Bit mask of UNUSED_RETENTION10 field. */

/* Bit 26 : Unused retention set bit 9 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION9_Pos (26UL) /*!< Position of UNUSED_RETENTION9 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION9_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION9_Pos) /*!< Bit mask of UNUSED_RETENTION9 field. */

/* Bit 25 : Unused retention set bit 8 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION8_Pos (25UL) /*!< Position of UNUSED_RETENTION8 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION8_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION8_Pos) /*!< Bit mask of UNUSED_RETENTION8 field. */

/* Bit 24 : Unused retention set bit 7 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION7_Pos (24UL) /*!< Position of UNUSED_RETENTION7 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION7_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION7_Pos) /*!< Bit mask of UNUSED_RETENTION7 field. */

/* Bit 23 : Unused retention set bit 6 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION6_Pos (23UL) /*!< Position of UNUSED_RETENTION6 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION6_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION6_Pos) /*!< Bit mask of UNUSED_RETENTION6 field. */

/* Bit 22 : Unused retention set bit 5 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION5_Pos (22UL) /*!< Position of UNUSED_RETENTION5 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION5_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION5_Pos) /*!< Bit mask of UNUSED_RETENTION5 field. */

/* Bit 21 : Unused retention set bit 4 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION4_Pos (21UL) /*!< Position of UNUSED_RETENTION4 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION4_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION4_Pos) /*!< Bit mask of UNUSED_RETENTION4 field. */

/* Bit 20 : Unused retention set bit 3 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION3_Pos (20UL) /*!< Position of UNUSED_RETENTION3 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION3_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION3_Pos) /*!< Bit mask of UNUSED_RETENTION3 field. */

