adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Register: VMC_RAMD_POWER */
/* Description: RAM D{n} power control register */

/* Bit 17 : Unused retention bit */
#define VMC_RAMD_POWER_UNUSED_RETENTION1_Pos (17UL) /*!< Position of UNUSED_RETENTION1 field. */
#define VMC_RAMD_POWER_UNUSED_RETENTION1_Msk (0x1UL << VMC_RAMD_POWER_UNUSED_RETENTION1_Pos) /*!< Bit mask of UNUSED_RETENTION1 field. */

/* Bit 16 : Keep retention on RAM sections S0 and S1 of RAM D{n} when RAM section is switched off */
#define VMC_RAMD_POWER_S01RETENTION_Pos (16UL) /*!< Position of S01RETENTION field. */
#define VMC_RAMD_POWER_S01RETENTION_Msk (0x1UL << VMC_RAMD_POWER_S01RETENTION_Pos) /*!< Bit mask of S01RETENTION field. */
#define VMC_RAMD_POWER_S01RETENTION_Off (0UL) /*!< Off */
#define VMC_RAMD_POWER_S01RETENTION_On (1UL) /*!< On */

/* Bit 1 : Unused power bit */
#define VMC_RAMD_POWER_UNUSED_POWER1_Pos (1UL) /*!< Position of UNUSED_POWER1 field. */
#define VMC_RAMD_POWER_UNUSED_POWER1_Msk (0x1UL << VMC_RAMD_POWER_UNUSED_POWER1_Pos) /*!< Bit mask of UNUSED_POWER1 field. */

/* Bit 0 : Keep RAM sections S0 and S1 of RAM D{n} on or off in System ON mode */
#define VMC_RAMD_POWER_S01POWER_Pos (0UL) /*!< Position of S01POWER field. */
#define VMC_RAMD_POWER_S01POWER_Msk (0x1UL << VMC_RAMD_POWER_S01POWER_Pos) /*!< Bit mask of S01POWER field. */
#define VMC_RAMD_POWER_S01POWER_Off (0UL) /*!< Off */
#define VMC_RAMD_POWER_S01POWER_On (1UL) /*!< On */

/* Register: VMC_RAMD_POWERSET */
/* Description: RAM D{n} power control set register */

/* Bit 17 : Unused retention set bit */
#define VMC_RAMD_POWERSET_UNUSED_RETENTION1_Pos (17UL) /*!< Position of UNUSED_RETENTION1 field. */
#define VMC_RAMD_POWERSET_UNUSED_RETENTION1_Msk (0x1UL << VMC_RAMD_POWERSET_UNUSED_RETENTION1_Pos) /*!< Bit mask of UNUSED_RETENTION1 field. */

/* Bit 16 : Keep retention on sections S0 and S1 of RAM of RAM D{n} when RAM section is switched off */
#define VMC_RAMD_POWERSET_S01RETENTION_Pos (16UL) /*!< Position of S01RETENTION field. */
#define VMC_RAMD_POWERSET_S01RETENTION_Msk (0x1UL << VMC_RAMD_POWERSET_S01RETENTION_Pos) /*!< Bit mask of S01RETENTION field. */
#define VMC_RAMD_POWERSET_S01RETENTION_On (1UL) /*!< On */

/* Bit 1 : Unused power set bit */
#define VMC_RAMD_POWERSET_UNUSED_POWER1_Pos (1UL) /*!< Position of UNUSED_POWER1 field. */
#define VMC_RAMD_POWERSET_UNUSED_POWER1_Msk (0x1UL << VMC_RAMD_POWERSET_UNUSED_POWER1_Pos) /*!< Bit mask of UNUSED_POWER1 field. */

/* Bit 0 : Keep RAM sections S0 and S1 of RAM D{n} on or off in System ON mode */
#define VMC_RAMD_POWERSET_S01POWER_Pos (0UL) /*!< Position of S01POWER field. */
#define VMC_RAMD_POWERSET_S01POWER_Msk (0x1UL << VMC_RAMD_POWERSET_S01POWER_Pos) /*!< Bit mask of S01POWER field. */
#define VMC_RAMD_POWERSET_S01POWER_On (1UL) /*!< On */

/* Register: VMC_RAMD_POWERCLR */
/* Description: RAM  D{n} power control clear register */

/* Bit 17 : Unused retention clear bit */
#define VMC_RAMD_POWERCLR_UNUSED_RETENTION1_Pos (17UL) /*!< Position of UNUSED_RETENTION1 field. */
#define VMC_RAMD_POWERCLR_UNUSED_RETENTION1_Msk (0x1UL << VMC_RAMD_POWERCLR_UNUSED_RETENTION1_Pos) /*!< Bit mask of UNUSED_RETENTION1 field. */

/* Bit 16 : Keep retention on RAM sections S0 and S1 of RAM D{n} when RAM section is switched off */
#define VMC_RAMD_POWERCLR_S01RETENTION_Pos (16UL) /*!< Position of S01RETENTION field. */
#define VMC_RAMD_POWERCLR_S01RETENTION_Msk (0x1UL << VMC_RAMD_POWERCLR_S01RETENTION_Pos) /*!< Bit mask of S01RETENTION field. */
#define VMC_RAMD_POWERCLR_S01RETENTION_Off (1UL) /*!< Off */

/* Bit 1 : Unused power clear bit */
#define VMC_RAMD_POWERCLR_UNUSED_POWER1_Pos (1UL) /*!< Position of UNUSED_POWER1 field. */
#define VMC_RAMD_POWERCLR_UNUSED_POWER1_Msk (0x1UL << VMC_RAMD_POWERCLR_UNUSED_POWER1_Pos) /*!< Bit mask of UNUSED_POWER1 field. */

/* Bit 0 : Keep RAM sections S0 and S1 of RAM D{n} on or off in System ON mode */
#define VMC_RAMD_POWERCLR_S01POWER_Pos (0UL) /*!< Position of S01POWER field. */
#define VMC_RAMD_POWERCLR_S01POWER_Msk (0x1UL << VMC_RAMD_POWERCLR_S01POWER_Pos) /*!< Bit mask of S01POWER field. */
#define VMC_RAMD_POWERCLR_S01POWER_Off (1UL) /*!< Off */

/* Register: VMC_SRAMTRIM */
/* Description: Backdoor trim values for SRAM */

/* Bit 6 : Read/Write Margin Adjustment */
#define VMC_SRAMTRIM_RWM_Pos (6UL) /*!< Position of RWM field. */
#define VMC_SRAMTRIM_RWM_Msk (0x1UL << VMC_SRAMTRIM_RWM_Pos) /*!< Bit mask of RWM field. */
#define VMC_SRAMTRIM_RWM_Disabled (0UL) /*!< Disable */
#define VMC_SRAMTRIM_RWM_Enabled (1UL) /*!< Enable */

/* Bit 5 : Read Margin Adjustment */
#define VMC_SRAMTRIM_RM_Pos (5UL) /*!< Position of RM field. */
#define VMC_SRAMTRIM_RM_Msk (0x1UL << VMC_SRAMTRIM_RM_Pos) /*!< Bit mask of RM field. */
#define VMC_SRAMTRIM_RM_Disabled (0UL) /*!< Disable */
#define VMC_SRAMTRIM_RM_Enabled (1UL) /*!< Enable */

/* Bit 4 : Write Margin Adjustment */
#define VMC_SRAMTRIM_WM_Pos (4UL) /*!< Position of WM field. */
#define VMC_SRAMTRIM_WM_Msk (0x1UL << VMC_SRAMTRIM_WM_Pos) /*!< Bit mask of WM field. */
#define VMC_SRAMTRIM_WM_Disabled (0UL) /*!< Disable */
#define VMC_SRAMTRIM_WM_Enabled (1UL) /*!< Enable */

/* Bits 3..0 : Source Bias Trim Adjustment for retention */
#define VMC_SRAMTRIM_BTRIM_Pos (0UL) /*!< Position of BTRIM field. */
#define VMC_SRAMTRIM_BTRIM_Msk (0xFUL << VMC_SRAMTRIM_BTRIM_Pos) /*!< Bit mask of BTRIM field. */

/* Register: VMC_RamSSNonRetTSel */
/* Description: Timing control values for TSMC RAMs */

/* Bits 4..2 : Write cycle timing selection */
#define VMC_RamSSNonRetTSel_WTSEL_Pos (2UL) /*!< Position of WTSEL field. */
#define VMC_RamSSNonRetTSel_WTSEL_Msk (0x7UL << VMC_RamSSNonRetTSel_WTSEL_Pos) /*!< Bit mask of WTSEL field. */

/* Bits 1..0 : Read cycle timing selection */
#define VMC_RamSSNonRetTSel_RTSEL_Pos (0UL) /*!< Position of RTSEL field. */
#define VMC_RamSSNonRetTSel_RTSEL_Msk (0x3UL << VMC_RamSSNonRetTSel_RTSEL_Pos) /*!< Bit mask of RTSEL field. */


/* Peripheral: ZUC */
/* Description: ZUC LTE L2 security IP */

/* Register: ZUC_TASKS_STARTGATHER */
/* Description: Start input DMA */

/* Bit 0 : Start input DMA */
#define ZUC_TASKS_STARTGATHER_TASKS_STARTGATHER_Pos (0UL) /*!< Position of TASKS_STARTGATHER field. */
#define ZUC_TASKS_STARTGATHER_TASKS_STARTGATHER_Msk (0x1UL << ZUC_TASKS_STARTGATHER_TASKS_STARTGATHER_Pos) /*!< Bit mask of TASKS_STARTGATHER field. */
#define ZUC_TASKS_STARTGATHER_TASKS_STARTGATHER_Trigger (1UL) /*!< Trigger task */

