adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Register: ZUC_TASKS_STOPGATHER */
/* Description: Stop  input DMA */

/* Bit 0 : Stop  input DMA */
#define ZUC_TASKS_STOPGATHER_TASKS_STOPGATHER_Pos (0UL) /*!< Position of TASKS_STOPGATHER field. */
#define ZUC_TASKS_STOPGATHER_TASKS_STOPGATHER_Msk (0x1UL << ZUC_TASKS_STOPGATHER_TASKS_STOPGATHER_Pos) /*!< Bit mask of TASKS_STOPGATHER field. */
#define ZUC_TASKS_STOPGATHER_TASKS_STOPGATHER_Trigger (1UL) /*!< Trigger task */

/* Register: ZUC_TASKS_STARTSCATTER */
/* Description: Start output DMA */

/* Bit 0 : Start output DMA */
#define ZUC_TASKS_STARTSCATTER_TASKS_STARTSCATTER_Pos (0UL) /*!< Position of TASKS_STARTSCATTER field. */
#define ZUC_TASKS_STARTSCATTER_TASKS_STARTSCATTER_Msk (0x1UL << ZUC_TASKS_STARTSCATTER_TASKS_STARTSCATTER_Pos) /*!< Bit mask of TASKS_STARTSCATTER field. */
#define ZUC_TASKS_STARTSCATTER_TASKS_STARTSCATTER_Trigger (1UL) /*!< Trigger task */

/* Register: ZUC_TASKS_STOPSCATTER */
/* Description: Stop  output DMA */

/* Bit 0 : Stop  output DMA */
#define ZUC_TASKS_STOPSCATTER_TASKS_STOPSCATTER_Pos (0UL) /*!< Position of TASKS_STOPSCATTER field. */
#define ZUC_TASKS_STOPSCATTER_TASKS_STOPSCATTER_Msk (0x1UL << ZUC_TASKS_STOPSCATTER_TASKS_STOPSCATTER_Pos) /*!< Bit mask of TASKS_STOPSCATTER field. */
#define ZUC_TASKS_STOPSCATTER_TASKS_STOPSCATTER_Trigger (1UL) /*!< Trigger task */

/* Register: ZUC_TASKS_INITIALIZEZUC */
/* Description: New keys (and IV) ready to be used, reset keybytes, ivbytes */

/* Bit 0 : New keys (and IV) ready to be used, reset keybytes, ivbytes */
#define ZUC_TASKS_INITIALIZEZUC_TASKS_INITIALIZEZUC_Pos (0UL) /*!< Position of TASKS_INITIALIZEZUC field. */
#define ZUC_TASKS_INITIALIZEZUC_TASKS_INITIALIZEZUC_Msk (0x1UL << ZUC_TASKS_INITIALIZEZUC_TASKS_INITIALIZEZUC_Pos) /*!< Bit mask of TASKS_INITIALIZEZUC field. */
#define ZUC_TASKS_INITIALIZEZUC_TASKS_INITIALIZEZUC_Trigger (1UL) /*!< Trigger task */

/* Register: ZUC_TASKS_STARTOPERATION */
/* Description: Start cipher / MAC calculation depending on MODE */

/* Bit 0 : Start cipher / MAC calculation depending on MODE */
#define ZUC_TASKS_STARTOPERATION_TASKS_STARTOPERATION_Pos (0UL) /*!< Position of TASKS_STARTOPERATION field. */
#define ZUC_TASKS_STARTOPERATION_TASKS_STARTOPERATION_Msk (0x1UL << ZUC_TASKS_STARTOPERATION_TASKS_STARTOPERATION_Pos) /*!< Bit mask of TASKS_STARTOPERATION field. */
#define ZUC_TASKS_STARTOPERATION_TASKS_STARTOPERATION_Trigger (1UL) /*!< Trigger task */

/* Register: ZUC_TASKS_FINALIZEMAC */
/* Description: Finalize MAC calculation */

/* Bit 0 : Finalize MAC calculation */
#define ZUC_TASKS_FINALIZEMAC_TASKS_FINALIZEMAC_Pos (0UL) /*!< Position of TASKS_FINALIZEMAC field. */
#define ZUC_TASKS_FINALIZEMAC_TASKS_FINALIZEMAC_Msk (0x1UL << ZUC_TASKS_FINALIZEMAC_TASKS_FINALIZEMAC_Pos) /*!< Bit mask of TASKS_FINALIZEMAC field. */
#define ZUC_TASKS_FINALIZEMAC_TASKS_FINALIZEMAC_Trigger (1UL) /*!< Trigger task */

/* Register: ZUC_TASKS_RESET */
/* Description: Stop all transfers and crypto operations (initialize) */

/* Bit 0 : Stop all transfers and crypto operations (initialize) */
#define ZUC_TASKS_RESET_TASKS_RESET_Pos (0UL) /*!< Position of TASKS_RESET field. */
#define ZUC_TASKS_RESET_TASKS_RESET_Msk (0x1UL << ZUC_TASKS_RESET_TASKS_RESET_Pos) /*!< Bit mask of TASKS_RESET field. */
#define ZUC_TASKS_RESET_TASKS_RESET_Trigger (1UL) /*!< Trigger task */

/* Register: ZUC_TASKZEROPENALTY_PCP_1 */
/* Description: TaskZeroPenalty register for PCP 1 */

/* Bit 0 : Penalty Level */
#define ZUC_TASKZEROPENALTY_PCP_1_PENALTY_Pos (0UL) /*!< Position of PENALTY field. */
#define ZUC_TASKZEROPENALTY_PCP_1_PENALTY_Msk (0x1UL << ZUC_TASKZEROPENALTY_PCP_1_PENALTY_Pos) /*!< Bit mask of PENALTY field. */
#define ZUC_TASKZEROPENALTY_PCP_1_PENALTY_ZERO (1UL) /*!< Set Zero Penalty */

/* Register: ZUC_TASKFULLPENALTY_PCP_1 */
/* Description: TaskFullPenalty register for PCP 1 */

/* Bit 0 : Penalty Level */
#define ZUC_TASKFULLPENALTY_PCP_1_PENALTY_Pos (0UL) /*!< Position of PENALTY field. */
#define ZUC_TASKFULLPENALTY_PCP_1_PENALTY_Msk (0x1UL << ZUC_TASKFULLPENALTY_PCP_1_PENALTY_Pos) /*!< Bit mask of PENALTY field. */
#define ZUC_TASKFULLPENALTY_PCP_1_PENALTY_FULL (1UL) /*!< Set Full Penalty */

/* Register: ZUC_TASKZEROPENALTY_PCP_0 */
/* Description: TaskZeroPenalty register for PCP 0 */

/* Bit 0 : Penalty Level */
#define ZUC_TASKZEROPENALTY_PCP_0_PENALTY_Pos (0UL) /*!< Position of PENALTY field. */
#define ZUC_TASKZEROPENALTY_PCP_0_PENALTY_Msk (0x1UL << ZUC_TASKZEROPENALTY_PCP_0_PENALTY_Pos) /*!< Bit mask of PENALTY field. */
#define ZUC_TASKZEROPENALTY_PCP_0_PENALTY_ZERO (1UL) /*!< Set Zero Penalty */

/* Register: ZUC_TASKFULLPENALTY_PCP_0 */
/* Description: TaskFullPenalty register for PCP 0 */

/* Bit 0 : Penalty Level */
#define ZUC_TASKFULLPENALTY_PCP_0_PENALTY_Pos (0UL) /*!< Position of PENALTY field. */
#define ZUC_TASKFULLPENALTY_PCP_0_PENALTY_Msk (0x1UL << ZUC_TASKFULLPENALTY_PCP_0_PENALTY_Pos) /*!< Bit mask of PENALTY field. */
#define ZUC_TASKFULLPENALTY_PCP_0_PENALTY_FULL (1UL) /*!< Set Full Penalty */

/* Register: ZUC_EVENTS_GATHERSTARTED */
/* Description: Input DMA started */

/* Bit 0 : Input DMA started */
#define ZUC_EVENTS_GATHERSTARTED_EVENTS_GATHERSTARTED_Pos (0UL) /*!< Position of EVENTS_GATHERSTARTED field. */
#define ZUC_EVENTS_GATHERSTARTED_EVENTS_GATHERSTARTED_Msk (0x1UL << ZUC_EVENTS_GATHERSTARTED_EVENTS_GATHERSTARTED_Pos) /*!< Bit mask of EVENTS_GATHERSTARTED field. */
#define ZUC_EVENTS_GATHERSTARTED_EVENTS_GATHERSTARTED_NotGenerated (0UL) /*!< Event not generated */
#define ZUC_EVENTS_GATHERSTARTED_EVENTS_GATHERSTARTED_Generated (1UL) /*!< Event generated */

/* Register: ZUC_EVENTS_GATHERDONE */
/* Description: Input DMA done */

/* Bit 0 : Input DMA done */
#define ZUC_EVENTS_GATHERDONE_EVENTS_GATHERDONE_Pos (0UL) /*!< Position of EVENTS_GATHERDONE field. */
#define ZUC_EVENTS_GATHERDONE_EVENTS_GATHERDONE_Msk (0x1UL << ZUC_EVENTS_GATHERDONE_EVENTS_GATHERDONE_Pos) /*!< Bit mask of EVENTS_GATHERDONE field. */
#define ZUC_EVENTS_GATHERDONE_EVENTS_GATHERDONE_NotGenerated (0UL) /*!< Event not generated */
#define ZUC_EVENTS_GATHERDONE_EVENTS_GATHERDONE_Generated (1UL) /*!< Event generated */

