adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Register: ZUC_EVENTS_SCATTERSTARTED */
/* Description: Output DMA started */

/* Bit 0 : Output DMA started */
#define ZUC_EVENTS_SCATTERSTARTED_EVENTS_SCATTERSTARTED_Pos (0UL) /*!< Position of EVENTS_SCATTERSTARTED field. */
#define ZUC_EVENTS_SCATTERSTARTED_EVENTS_SCATTERSTARTED_Msk (0x1UL << ZUC_EVENTS_SCATTERSTARTED_EVENTS_SCATTERSTARTED_Pos) /*!< Bit mask of EVENTS_SCATTERSTARTED field. */
#define ZUC_EVENTS_SCATTERSTARTED_EVENTS_SCATTERSTARTED_NotGenerated (0UL) /*!< Event not generated */
#define ZUC_EVENTS_SCATTERSTARTED_EVENTS_SCATTERSTARTED_Generated (1UL) /*!< Event generated */

/* Register: ZUC_EVENTS_SCATTERDONE */
/* Description: Output DMA done */

/* Bit 0 : Output DMA done */
#define ZUC_EVENTS_SCATTERDONE_EVENTS_SCATTERDONE_Pos (0UL) /*!< Position of EVENTS_SCATTERDONE field. */
#define ZUC_EVENTS_SCATTERDONE_EVENTS_SCATTERDONE_Msk (0x1UL << ZUC_EVENTS_SCATTERDONE_EVENTS_SCATTERDONE_Pos) /*!< Bit mask of EVENTS_SCATTERDONE field. */
#define ZUC_EVENTS_SCATTERDONE_EVENTS_SCATTERDONE_NotGenerated (0UL) /*!< Event not generated */
#define ZUC_EVENTS_SCATTERDONE_EVENTS_SCATTERDONE_Generated (1UL) /*!< Event generated */

/* Register: ZUC_EVENTS_IVREADY */
/* Description: IV received (ivbytes == 16) */

/* Bit 0 : IV received (ivbytes == 16) */
#define ZUC_EVENTS_IVREADY_EVENTS_IVREADY_Pos (0UL) /*!< Position of EVENTS_IVREADY field. */
#define ZUC_EVENTS_IVREADY_EVENTS_IVREADY_Msk (0x1UL << ZUC_EVENTS_IVREADY_EVENTS_IVREADY_Pos) /*!< Bit mask of EVENTS_IVREADY field. */
#define ZUC_EVENTS_IVREADY_EVENTS_IVREADY_NotGenerated (0UL) /*!< Event not generated */
#define ZUC_EVENTS_IVREADY_EVENTS_IVREADY_Generated (1UL) /*!< Event generated */

/* Register: ZUC_EVENTS_ZUCINITIALIZED */
/* Description: New keys and IV taken into use */

/* Bit 0 : New keys and IV taken into use */
#define ZUC_EVENTS_ZUCINITIALIZED_EVENTS_ZUCINITIALIZED_Pos (0UL) /*!< Position of EVENTS_ZUCINITIALIZED field. */
#define ZUC_EVENTS_ZUCINITIALIZED_EVENTS_ZUCINITIALIZED_Msk (0x1UL << ZUC_EVENTS_ZUCINITIALIZED_EVENTS_ZUCINITIALIZED_Pos) /*!< Bit mask of EVENTS_ZUCINITIALIZED field. */
#define ZUC_EVENTS_ZUCINITIALIZED_EVENTS_ZUCINITIALIZED_NotGenerated (0UL) /*!< Event not generated */
#define ZUC_EVENTS_ZUCINITIALIZED_EVENTS_ZUCINITIALIZED_Generated (1UL) /*!< Event generated */

/* Register: ZUC_EVENTS_MESSAGEREADY */
/* Description: LENGTH == 0 */

/* Bit 0 : LENGTH == 0 */
#define ZUC_EVENTS_MESSAGEREADY_EVENTS_MESSAGEREADY_Pos (0UL) /*!< Position of EVENTS_MESSAGEREADY field. */
#define ZUC_EVENTS_MESSAGEREADY_EVENTS_MESSAGEREADY_Msk (0x1UL << ZUC_EVENTS_MESSAGEREADY_EVENTS_MESSAGEREADY_Pos) /*!< Bit mask of EVENTS_MESSAGEREADY field. */
#define ZUC_EVENTS_MESSAGEREADY_EVENTS_MESSAGEREADY_NotGenerated (0UL) /*!< Event not generated */
#define ZUC_EVENTS_MESSAGEREADY_EVENTS_MESSAGEREADY_Generated (1UL) /*!< Event generated */

/* Register: ZUC_EVENTS_MACREADY */
/* Description: MAC calculated */

/* Bit 0 : MAC calculated */
#define ZUC_EVENTS_MACREADY_EVENTS_MACREADY_Pos (0UL) /*!< Position of EVENTS_MACREADY field. */
#define ZUC_EVENTS_MACREADY_EVENTS_MACREADY_Msk (0x1UL << ZUC_EVENTS_MACREADY_EVENTS_MACREADY_Pos) /*!< Bit mask of EVENTS_MACREADY field. */
#define ZUC_EVENTS_MACREADY_EVENTS_MACREADY_NotGenerated (0UL) /*!< Event not generated */
#define ZUC_EVENTS_MACREADY_EVENTS_MACREADY_Generated (1UL) /*!< Event generated */

/* Register: ZUC_EVENTS_RESETTED */
/* Description: Resetted (all transfers and crypto operations stopped) */

/* Bit 0 : Resetted (all transfers and crypto operations stopped) */
#define ZUC_EVENTS_RESETTED_EVENTS_RESETTED_Pos (0UL) /*!< Position of EVENTS_RESETTED field. */
#define ZUC_EVENTS_RESETTED_EVENTS_RESETTED_Msk (0x1UL << ZUC_EVENTS_RESETTED_EVENTS_RESETTED_Pos) /*!< Bit mask of EVENTS_RESETTED field. */
#define ZUC_EVENTS_RESETTED_EVENTS_RESETTED_NotGenerated (0UL) /*!< Event not generated */
#define ZUC_EVENTS_RESETTED_EVENTS_RESETTED_Generated (1UL) /*!< Event generated */

/* Register: ZUC_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 6 : Shortcut between event MACREADY and task RESET */
#define ZUC_SHORTS_MACREADY_RESET_Pos (6UL) /*!< Position of MACREADY_RESET field. */
#define ZUC_SHORTS_MACREADY_RESET_Msk (0x1UL << ZUC_SHORTS_MACREADY_RESET_Pos) /*!< Bit mask of MACREADY_RESET field. */
#define ZUC_SHORTS_MACREADY_RESET_Disabled (0UL) /*!< Disable shortcut */
#define ZUC_SHORTS_MACREADY_RESET_Enabled (1UL) /*!< Enable shortcut */

/* Bit 5 : Shortcut between event SCATTERDONE and task RESET */
#define ZUC_SHORTS_SCATTERDONE_RESET_Pos (5UL) /*!< Position of SCATTERDONE_RESET field. */
#define ZUC_SHORTS_SCATTERDONE_RESET_Msk (0x1UL << ZUC_SHORTS_SCATTERDONE_RESET_Pos) /*!< Bit mask of SCATTERDONE_RESET field. */
#define ZUC_SHORTS_SCATTERDONE_RESET_Disabled (0UL) /*!< Disable shortcut */
#define ZUC_SHORTS_SCATTERDONE_RESET_Enabled (1UL) /*!< Enable shortcut */

/* Bit 4 : Shortcut between event ZUCINITIALIZED and task STARTGATHER */
#define ZUC_SHORTS_ZUCINITIALIZED_STARTGATHER_Pos (4UL) /*!< Position of ZUCINITIALIZED_STARTGATHER field. */
#define ZUC_SHORTS_ZUCINITIALIZED_STARTGATHER_Msk (0x1UL << ZUC_SHORTS_ZUCINITIALIZED_STARTGATHER_Pos) /*!< Bit mask of ZUCINITIALIZED_STARTGATHER field. */
#define ZUC_SHORTS_ZUCINITIALIZED_STARTGATHER_Disabled (0UL) /*!< Disable shortcut */
#define ZUC_SHORTS_ZUCINITIALIZED_STARTGATHER_Enabled (1UL) /*!< Enable shortcut */

/* Bit 3 : Shortcut between event MESSAGEREADY and task FINALIZEMAC */
#define ZUC_SHORTS_MESSAGEREADY_FINALIZEMAC_Pos (3UL) /*!< Position of MESSAGEREADY_FINALIZEMAC field. */
#define ZUC_SHORTS_MESSAGEREADY_FINALIZEMAC_Msk (0x1UL << ZUC_SHORTS_MESSAGEREADY_FINALIZEMAC_Pos) /*!< Bit mask of MESSAGEREADY_FINALIZEMAC field. */
#define ZUC_SHORTS_MESSAGEREADY_FINALIZEMAC_Disabled (0UL) /*!< Disable shortcut */
#define ZUC_SHORTS_MESSAGEREADY_FINALIZEMAC_Enabled (1UL) /*!< Enable shortcut */

/* Bit 2 : Shortcut between event ZUCINITIALIZED and task STARTOPERATION */
#define ZUC_SHORTS_ZUCINITIALIZED_STARTOPERATION_Pos (2UL) /*!< Position of ZUCINITIALIZED_STARTOPERATION field. */
#define ZUC_SHORTS_ZUCINITIALIZED_STARTOPERATION_Msk (0x1UL << ZUC_SHORTS_ZUCINITIALIZED_STARTOPERATION_Pos) /*!< Bit mask of ZUCINITIALIZED_STARTOPERATION field. */
#define ZUC_SHORTS_ZUCINITIALIZED_STARTOPERATION_Disabled (0UL) /*!< Disable shortcut */
#define ZUC_SHORTS_ZUCINITIALIZED_STARTOPERATION_Enabled (1UL) /*!< Enable shortcut */

/* Bit 1 : Shortcut between event IVREADY and task INITIALIZEZUC */
#define ZUC_SHORTS_IVREADY_INITIALIZEZUC_Pos (1UL) /*!< Position of IVREADY_INITIALIZEZUC field. */
#define ZUC_SHORTS_IVREADY_INITIALIZEZUC_Msk (0x1UL << ZUC_SHORTS_IVREADY_INITIALIZEZUC_Pos) /*!< Bit mask of IVREADY_INITIALIZEZUC field. */
#define ZUC_SHORTS_IVREADY_INITIALIZEZUC_Disabled (0UL) /*!< Disable shortcut */
#define ZUC_SHORTS_IVREADY_INITIALIZEZUC_Enabled (1UL) /*!< Enable shortcut */

/* Bit 0 : Shortcut between event GATHERSTARTED and task STARTSCATTER */
#define ZUC_SHORTS_GATHERSTARTED_STARTSCATTER_Pos (0UL) /*!< Position of GATHERSTARTED_STARTSCATTER field. */
#define ZUC_SHORTS_GATHERSTARTED_STARTSCATTER_Msk (0x1UL << ZUC_SHORTS_GATHERSTARTED_STARTSCATTER_Pos) /*!< Bit mask of GATHERSTARTED_STARTSCATTER field. */
#define ZUC_SHORTS_GATHERSTARTED_STARTSCATTER_Disabled (0UL) /*!< Disable shortcut */
#define ZUC_SHORTS_GATHERSTARTED_STARTSCATTER_Enabled (1UL) /*!< Enable shortcut */

