adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Bit 7 : Write '1' to disable interrupt for event MACREADY */
#define ZUC_INTENCLR_MACREADY_Pos (7UL) /*!< Position of MACREADY field. */
#define ZUC_INTENCLR_MACREADY_Msk (0x1UL << ZUC_INTENCLR_MACREADY_Pos) /*!< Bit mask of MACREADY field. */
#define ZUC_INTENCLR_MACREADY_Disabled (0UL) /*!< Read: Disabled */
#define ZUC_INTENCLR_MACREADY_Enabled (1UL) /*!< Read: Enabled */
#define ZUC_INTENCLR_MACREADY_Clear (1UL) /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event MESSAGEREADY */
#define ZUC_INTENCLR_MESSAGEREADY_Pos (6UL) /*!< Position of MESSAGEREADY field. */
#define ZUC_INTENCLR_MESSAGEREADY_Msk (0x1UL << ZUC_INTENCLR_MESSAGEREADY_Pos) /*!< Bit mask of MESSAGEREADY field. */
#define ZUC_INTENCLR_MESSAGEREADY_Disabled (0UL) /*!< Read: Disabled */
#define ZUC_INTENCLR_MESSAGEREADY_Enabled (1UL) /*!< Read: Enabled */
#define ZUC_INTENCLR_MESSAGEREADY_Clear (1UL) /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event ZUCINITIALIZED */
#define ZUC_INTENCLR_ZUCINITIALIZED_Pos (5UL) /*!< Position of ZUCINITIALIZED field. */
#define ZUC_INTENCLR_ZUCINITIALIZED_Msk (0x1UL << ZUC_INTENCLR_ZUCINITIALIZED_Pos) /*!< Bit mask of ZUCINITIALIZED field. */
#define ZUC_INTENCLR_ZUCINITIALIZED_Disabled (0UL) /*!< Read: Disabled */
#define ZUC_INTENCLR_ZUCINITIALIZED_Enabled (1UL) /*!< Read: Enabled */
#define ZUC_INTENCLR_ZUCINITIALIZED_Clear (1UL) /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event IVREADY */
#define ZUC_INTENCLR_IVREADY_Pos (4UL) /*!< Position of IVREADY field. */
#define ZUC_INTENCLR_IVREADY_Msk (0x1UL << ZUC_INTENCLR_IVREADY_Pos) /*!< Bit mask of IVREADY field. */
#define ZUC_INTENCLR_IVREADY_Disabled (0UL) /*!< Read: Disabled */
#define ZUC_INTENCLR_IVREADY_Enabled (1UL) /*!< Read: Enabled */
#define ZUC_INTENCLR_IVREADY_Clear (1UL) /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event SCATTERDONE */
#define ZUC_INTENCLR_SCATTERDONE_Pos (3UL) /*!< Position of SCATTERDONE field. */
#define ZUC_INTENCLR_SCATTERDONE_Msk (0x1UL << ZUC_INTENCLR_SCATTERDONE_Pos) /*!< Bit mask of SCATTERDONE field. */
#define ZUC_INTENCLR_SCATTERDONE_Disabled (0UL) /*!< Read: Disabled */
#define ZUC_INTENCLR_SCATTERDONE_Enabled (1UL) /*!< Read: Enabled */
#define ZUC_INTENCLR_SCATTERDONE_Clear (1UL) /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event SCATTERSTARTED */
#define ZUC_INTENCLR_SCATTERSTARTED_Pos (2UL) /*!< Position of SCATTERSTARTED field. */
#define ZUC_INTENCLR_SCATTERSTARTED_Msk (0x1UL << ZUC_INTENCLR_SCATTERSTARTED_Pos) /*!< Bit mask of SCATTERSTARTED field. */
#define ZUC_INTENCLR_SCATTERSTARTED_Disabled (0UL) /*!< Read: Disabled */
#define ZUC_INTENCLR_SCATTERSTARTED_Enabled (1UL) /*!< Read: Enabled */
#define ZUC_INTENCLR_SCATTERSTARTED_Clear (1UL) /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event GATHERDONE */
#define ZUC_INTENCLR_GATHERDONE_Pos (1UL) /*!< Position of GATHERDONE field. */
#define ZUC_INTENCLR_GATHERDONE_Msk (0x1UL << ZUC_INTENCLR_GATHERDONE_Pos) /*!< Bit mask of GATHERDONE field. */
#define ZUC_INTENCLR_GATHERDONE_Disabled (0UL) /*!< Read: Disabled */
#define ZUC_INTENCLR_GATHERDONE_Enabled (1UL) /*!< Read: Enabled */
#define ZUC_INTENCLR_GATHERDONE_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event GATHERSTARTED */
#define ZUC_INTENCLR_GATHERSTARTED_Pos (0UL) /*!< Position of GATHERSTARTED field. */
#define ZUC_INTENCLR_GATHERSTARTED_Msk (0x1UL << ZUC_INTENCLR_GATHERSTARTED_Pos) /*!< Bit mask of GATHERSTARTED field. */
#define ZUC_INTENCLR_GATHERSTARTED_Disabled (0UL) /*!< Read: Disabled */
#define ZUC_INTENCLR_GATHERSTARTED_Enabled (1UL) /*!< Read: Enabled */
#define ZUC_INTENCLR_GATHERSTARTED_Clear (1UL) /*!< Disable */

/* Register: ZUC_INTPEND */
/* Description: Pending interrupts */

/* Bit 8 : Read pending status of interrupt for event RESETTED */
#define ZUC_INTPEND_RESETTED_Pos (8UL) /*!< Position of RESETTED field. */
#define ZUC_INTPEND_RESETTED_Msk (0x1UL << ZUC_INTPEND_RESETTED_Pos) /*!< Bit mask of RESETTED field. */
#define ZUC_INTPEND_RESETTED_NotPending (0UL) /*!< Read: Not pending */
#define ZUC_INTPEND_RESETTED_Pending (1UL) /*!< Read: Pending */

/* Bit 7 : Read pending status of interrupt for event MACREADY */
#define ZUC_INTPEND_MACREADY_Pos (7UL) /*!< Position of MACREADY field. */
#define ZUC_INTPEND_MACREADY_Msk (0x1UL << ZUC_INTPEND_MACREADY_Pos) /*!< Bit mask of MACREADY field. */
#define ZUC_INTPEND_MACREADY_NotPending (0UL) /*!< Read: Not pending */
#define ZUC_INTPEND_MACREADY_Pending (1UL) /*!< Read: Pending */

/* Bit 6 : Read pending status of interrupt for event MESSAGEREADY */
#define ZUC_INTPEND_MESSAGEREADY_Pos (6UL) /*!< Position of MESSAGEREADY field. */
#define ZUC_INTPEND_MESSAGEREADY_Msk (0x1UL << ZUC_INTPEND_MESSAGEREADY_Pos) /*!< Bit mask of MESSAGEREADY field. */
#define ZUC_INTPEND_MESSAGEREADY_NotPending (0UL) /*!< Read: Not pending */
#define ZUC_INTPEND_MESSAGEREADY_Pending (1UL) /*!< Read: Pending */

/* Bit 5 : Read pending status of interrupt for event ZUCINITIALIZED */
#define ZUC_INTPEND_ZUCINITIALIZED_Pos (5UL) /*!< Position of ZUCINITIALIZED field. */
#define ZUC_INTPEND_ZUCINITIALIZED_Msk (0x1UL << ZUC_INTPEND_ZUCINITIALIZED_Pos) /*!< Bit mask of ZUCINITIALIZED field. */
#define ZUC_INTPEND_ZUCINITIALIZED_NotPending (0UL) /*!< Read: Not pending */
#define ZUC_INTPEND_ZUCINITIALIZED_Pending (1UL) /*!< Read: Pending */

/* Bit 4 : Read pending status of interrupt for event IVREADY */
#define ZUC_INTPEND_IVREADY_Pos (4UL) /*!< Position of IVREADY field. */
#define ZUC_INTPEND_IVREADY_Msk (0x1UL << ZUC_INTPEND_IVREADY_Pos) /*!< Bit mask of IVREADY field. */
#define ZUC_INTPEND_IVREADY_NotPending (0UL) /*!< Read: Not pending */
#define ZUC_INTPEND_IVREADY_Pending (1UL) /*!< Read: Pending */

/* Bit 3 : Read pending status of interrupt for event SCATTERDONE */
#define ZUC_INTPEND_SCATTERDONE_Pos (3UL) /*!< Position of SCATTERDONE field. */
#define ZUC_INTPEND_SCATTERDONE_Msk (0x1UL << ZUC_INTPEND_SCATTERDONE_Pos) /*!< Bit mask of SCATTERDONE field. */
#define ZUC_INTPEND_SCATTERDONE_NotPending (0UL) /*!< Read: Not pending */
#define ZUC_INTPEND_SCATTERDONE_Pending (1UL) /*!< Read: Pending */

/* Bit 2 : Read pending status of interrupt for event SCATTERSTARTED */
#define ZUC_INTPEND_SCATTERSTARTED_Pos (2UL) /*!< Position of SCATTERSTARTED field. */
#define ZUC_INTPEND_SCATTERSTARTED_Msk (0x1UL << ZUC_INTPEND_SCATTERSTARTED_Pos) /*!< Bit mask of SCATTERSTARTED field. */
#define ZUC_INTPEND_SCATTERSTARTED_NotPending (0UL) /*!< Read: Not pending */
#define ZUC_INTPEND_SCATTERSTARTED_Pending (1UL) /*!< Read: Pending */

/* Bit 1 : Read pending status of interrupt for event GATHERDONE */
#define ZUC_INTPEND_GATHERDONE_Pos (1UL) /*!< Position of GATHERDONE field. */
#define ZUC_INTPEND_GATHERDONE_Msk (0x1UL << ZUC_INTPEND_GATHERDONE_Pos) /*!< Bit mask of GATHERDONE field. */
#define ZUC_INTPEND_GATHERDONE_NotPending (0UL) /*!< Read: Not pending */
#define ZUC_INTPEND_GATHERDONE_Pending (1UL) /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event GATHERSTARTED */
#define ZUC_INTPEND_GATHERSTARTED_Pos (0UL) /*!< Position of GATHERSTARTED field. */
#define ZUC_INTPEND_GATHERSTARTED_Msk (0x1UL << ZUC_INTPEND_GATHERSTARTED_Pos) /*!< Bit mask of GATHERSTARTED field. */
#define ZUC_INTPEND_GATHERSTARTED_NotPending (0UL) /*!< Read: Not pending */
#define ZUC_INTPEND_GATHERSTARTED_Pending (1UL) /*!< Read: Pending */

