adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem_bitfields.h
/* Register: ZUC_LENGTH */
/* Description: Keystream length in bits (Cipher), message length in bits (MAC) */

/* Bits 31..0 : Stream/message length */
#define ZUC_LENGTH_LENGTH_Pos (0UL) /*!< Position of LENGTH field. */
#define ZUC_LENGTH_LENGTH_Msk (0xFFFFFFFFUL << ZUC_LENGTH_LENGTH_Pos) /*!< Bit mask of LENGTH field. */

/* Register: ZUC_MODE */
/* Description: Mode select */

/* Bit 0 : Mode select. */
#define ZUC_MODE_MODE_Pos (0UL) /*!< Position of MODE field. */
#define ZUC_MODE_MODE_Msk (0x1UL << ZUC_MODE_MODE_Pos) /*!< Bit mask of MODE field. */
#define ZUC_MODE_MODE_CIPHER (0UL) /*!< Data cipher mode */
#define ZUC_MODE_MODE_MAC (1UL) /*!< MAC mode. */

/* Register: ZUC_MAC */
/* Description: Message Authentication Code. */

/* Bits 31..0 : Calculated MAC. */
#define ZUC_MAC_MAC_Pos (0UL) /*!< Position of MAC field. */
#define ZUC_MAC_MAC_Msk (0xFFFFFFFFUL << ZUC_MAC_MAC_Pos) /*!< Bit mask of MAC field. */

/* Register: ZUC_INDCP_MEMORY_ADDR */
/* Description: Pointer to input DMA scatter and gather job list (Write) / current output job address (Read) */

/* Bits 31..0 : Scatter and gather input job pointer / current input job address. */
#define ZUC_INDCP_MEMORY_ADDR_MEMORY_ADDR_Pos (0UL) /*!< Position of MEMORY_ADDR field. */
#define ZUC_INDCP_MEMORY_ADDR_MEMORY_ADDR_Msk (0xFFFFFFFFUL << ZUC_INDCP_MEMORY_ADDR_MEMORY_ADDR_Pos) /*!< Bit mask of MEMORY_ADDR field. */

/* Register: ZUC_OUTDCP_MEMORY_ADDR */
/* Description: Pointer to output DMA scatter and gather job list (Write) / current output job address (Read) */

/* Bits 31..0 : Scatter and gather output job pointer / current output job address. */
#define ZUC_OUTDCP_MEMORY_ADDR_MEMORY_ADDR_Pos (0UL) /*!< Position of MEMORY_ADDR field. */
#define ZUC_OUTDCP_MEMORY_ADDR_MEMORY_ADDR_Msk (0xFFFFFFFFUL << ZUC_OUTDCP_MEMORY_ADDR_MEMORY_ADDR_Pos) /*!< Bit mask of MEMORY_ADDR field. */

/* Register: ZUC_PENALTY_REG */
/* Description: Description collection: Penalty register for PCP n */

/* Bits 1..0 : Penalty Level */
#define ZUC_PENALTY_REG_Penalty_Pos (0UL) /*!< Position of Penalty field. */
#define ZUC_PENALTY_REG_Penalty_Msk (0x3UL << ZUC_PENALTY_REG_Penalty_Pos) /*!< Bit mask of Penalty field. */
#define ZUC_PENALTY_REG_Penalty_Full (0UL) /*!< Auto 0) Full penalty) */
#define ZUC_PENALTY_REG_Penalty_Semi1 (1UL) /*!< (Auto 1)  Semi (power on, clock off) */
#define ZUC_PENALTY_REG_Penalty_Semi2 (2UL) /*!< (Auto 2) Semi (power on, clock core on, clock buffer off) */
#define ZUC_PENALTY_REG_Penalty_Zero (3UL) /*!< (Auto 3)  Zero penalty */

/* Register: ZUC_FORCE_OVERRIDE */
/* Description: Description collection: Force override register for PCP n */

/* Bit 15 :   */
#define ZUC_FORCE_OVERRIDE_DISABLE_Pos (15UL) /*!< Position of DISABLE field. */
#define ZUC_FORCE_OVERRIDE_DISABLE_Msk (0x1UL << ZUC_FORCE_OVERRIDE_DISABLE_Pos) /*!< Bit mask of DISABLE field. */
#define ZUC_FORCE_OVERRIDE_DISABLE_DISABLE (0UL) /*!< all forcing disabled */
#define ZUC_FORCE_OVERRIDE_DISABLE_ENABLE (1UL) /*!< all forcing enabled */

/* Bit 9 :   */
#define ZUC_FORCE_OVERRIDE_CORE_POWER_REQUEST_Pos (9UL) /*!< Position of CORE_POWER_REQUEST field. */
#define ZUC_FORCE_OVERRIDE_CORE_POWER_REQUEST_Msk (0x1UL << ZUC_FORCE_OVERRIDE_CORE_POWER_REQUEST_Pos) /*!< Bit mask of CORE_POWER_REQUEST field. */
#define ZUC_FORCE_OVERRIDE_CORE_POWER_REQUEST_REQ0 (0UL) /*!< powerRequest.core = 0 */
#define ZUC_FORCE_OVERRIDE_CORE_POWER_REQUEST_REQ1 (1UL) /*!< powerRequest.core = 1 */

/* Bit 8 :   */
#define ZUC_FORCE_OVERRIDE_SWITCH_POWER_REQUEST_Pos (8UL) /*!< Position of SWITCH_POWER_REQUEST field. */
#define ZUC_FORCE_OVERRIDE_SWITCH_POWER_REQUEST_Msk (0x1UL << ZUC_FORCE_OVERRIDE_SWITCH_POWER_REQUEST_Pos) /*!< Bit mask of SWITCH_POWER_REQUEST field. */
#define ZUC_FORCE_OVERRIDE_SWITCH_POWER_REQUEST_REQ0 (0UL) /*!< powerRequest.switch = 0 */
#define ZUC_FORCE_OVERRIDE_SWITCH_POWER_REQUEST_REQ1 (1UL) /*!< powerRequest.switch = 1 */

/* Bit 7 :   */
#define ZUC_FORCE_OVERRIDE_CLOCK_FORCING_Pos (7UL) /*!< Position of CLOCK_FORCING field. */
#define ZUC_FORCE_OVERRIDE_CLOCK_FORCING_Msk (0x1UL << ZUC_FORCE_OVERRIDE_CLOCK_FORCING_Pos) /*!< Bit mask of CLOCK_FORCING field. */
#define ZUC_FORCE_OVERRIDE_CLOCK_FORCING_FORCE0 (0UL) /*!< All clock forcing  disabled */
#define ZUC_FORCE_OVERRIDE_CLOCK_FORCING_FORCE1 (1UL) /*!< All clock forcing  enabled */

/* Bit 3 :   */
#define ZUC_FORCE_OVERRIDE_CORE_CLOCK_REQUEST_Pos (3UL) /*!< Position of CORE_CLOCK_REQUEST field. */
#define ZUC_FORCE_OVERRIDE_CORE_CLOCK_REQUEST_Msk (0x1UL << ZUC_FORCE_OVERRIDE_CORE_CLOCK_REQUEST_Pos) /*!< Bit mask of CORE_CLOCK_REQUEST field. */
#define ZUC_FORCE_OVERRIDE_CORE_CLOCK_REQUEST_REQ0 (0UL) /*!< clockRequest.core = 0 */
#define ZUC_FORCE_OVERRIDE_CORE_CLOCK_REQUEST_REQ1 (1UL) /*!< clockRequest.core = 1 */

/* Bit 2 :   */
#define ZUC_FORCE_OVERRIDE_CLOCK_BUFFER_REQUEST_Pos (2UL) /*!< Position of CLOCK_BUFFER_REQUEST field. */
#define ZUC_FORCE_OVERRIDE_CLOCK_BUFFER_REQUEST_Msk (0x1UL << ZUC_FORCE_OVERRIDE_CLOCK_BUFFER_REQUEST_Pos) /*!< Bit mask of CLOCK_BUFFER_REQUEST field. */
#define ZUC_FORCE_OVERRIDE_CLOCK_BUFFER_REQUEST_REQ0 (0UL) /*!< clockRequest.buff = 0 */
#define ZUC_FORCE_OVERRIDE_CLOCK_BUFFER_REQUEST_REQ1 (1UL) /*!< clockRequest.buff = 1 */

/* Bit 1 :   */
#define ZUC_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_Pos (1UL) /*!< Position of CLOCK_SWITCH_REQUEST field. */
#define ZUC_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_Msk (0x1UL << ZUC_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_Pos) /*!< Bit mask of CLOCK_SWITCH_REQUEST field. */
#define ZUC_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_REQ0 (0UL) /*!< clockRequest.switch = 0 */
#define ZUC_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_REQ1 (1UL) /*!< clockRequest.switch = 1 */

/* Bit 0 :   */
#define ZUC_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_A_Pos (0UL) /*!< Position of CLOCK_SWITCH_REQUEST_A field. */
#define ZUC_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_A_Msk (0x1UL << ZUC_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_A_Pos) /*!< Bit mask of CLOCK_SWITCH_REQUEST_A field. */
#define ZUC_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_A_REQ0 (0UL) /*!< clockRequest.switch_a = 0 */
#define ZUC_FORCE_OVERRIDE_CLOCK_SWITCH_REQUEST_A_REQ1 (1UL) /*!< clockRequest.switch_a = 1 */

/* Register: ZUC_TURN_OFF_AUTO_CLOCKSOURCE_REQ */
/* Description: Turn of the automatic clock request. */

/* Bit 1 :   */
#define ZUC_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_1_Pos (1UL) /*!< Position of CLOCK_START_PCP_1 field. */
#define ZUC_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_1_Msk (0x1UL << ZUC_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_1_Pos) /*!< Bit mask of CLOCK_START_PCP_1 field. */
#define ZUC_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_1_NORMAL_1 (0UL) /*!< normal clock start for PCP 1 */
#define ZUC_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_1_OFF_1 (1UL) /*!< turn off normal clock start for PCP 1 */

/* Bit 0 :   */
#define ZUC_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_0_Pos (0UL) /*!< Position of CLOCK_START_PCP_0 field. */
#define ZUC_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_0_Msk (0x1UL << ZUC_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_0_Pos) /*!< Bit mask of CLOCK_START_PCP_0 field. */
#define ZUC_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_0_NORMAL_0 (0UL) /*!< normal clock start for PCP 0 */
#define ZUC_TURN_OFF_AUTO_CLOCKSOURCE_REQ_CLOCK_START_PCP_0_OFF_0 (1UL) /*!< turn off normal clock start for PCP 0 */


/*lint --flb "Leave library region" */
#endif
